G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/*
 * ESP32-S3 健身识别手柄生产入口。
 *
 * 线程所有权：QMI 任务只读取芯片并投递原始帧；应用任务独占 imu_pipeline 和
 * device_coordinator；UI、BLE、存储、振动、电源任务只消费按值效果。该边界保证
 * 次数、步数、热量只由 workout_engine 产生一次，公式与任务关系见
 * docs/手柄与上位机软件详细设计.md。
 */

/* 引入 Waveshare 板级运行时，提供 BSP 显示、I2C、马达、TF 与 LVGL 锁。 */
#include "board_runtime.h"
/* 引入 QMI8658、AXP2101、PCF85063 独立驱动。 */
#include "board_sensors.h"
/* 引入 ESP-NimBLE 服务、LiveState、Event 和控制回调合同。 */
#include "ble_service_nimble.h"
/* 引入正式 Manifest TLV 构建器、标签、能力位和版本合同。 */
#include "ble_service_manifest.h"
/* 引入训练控制、UI/BLE/存储/振动/电源统一效果。 */
#include "device_coordinator.h"
/* 引入 Cmd6/7/8/9/11 TLV、配置事务和 CRC32 稳定 blob。 */
#include "device_config.h"
/* 引入严格 25 Hz 重采样、62 点窗口和质量位。 */
#include "imu_pipeline.h"
/* 引入自动生成 297 维双六分支 M0 推理适配器。 */
#include "imu_pipeline_dual_m0.h"
/* 直接读取自动生成的特征维度、类别顺序和两个 M0 SHA-256，禁止手工复制哈希。 */
#include "../../include/esp32_dual_m0_model.h"
/* 引入双槽会话摘要和固定容量文件后端。 */
#include "session_store.h"
/* 引入 BLE LIST/GET 会话补传服务。 */
#include "session_transfer.h"
/* 引入 LVGL 9 页面渲染器和触摸按钮命令。 */
#include "ui_lvgl_renderer.h"
/* 引入 NimBLE 到应用任务的无阻塞配对码原子邮箱。 */
#include "ui_app_pairing.h"

/* 引入 GPIO 唤醒接口；GPIO21 用于 Deep-sleep，GPIO38/39 仅用于 Light-sleep。 */
#include "driver/gpio.h"
/* 引入 ESP-IDF 统一错误码。 */
#include "esp_err.h"
#include "esp_check.h"
/* 引入设备唯一蓝牙 MAC 读取接口。 */
#include "esp_mac.h"
/* 引入串口日志。 */
#include "esp_log.h"
/* 引入 40~240 MHz 动态频率和自动 Light-sleep 配置。 */
#include "esp_pm.h"
/* 引入 Deep-sleep 入口。 */
#include "esp_sleep.h"
/* 引入片内堆统计；BLE 控制器启动前记录总空闲量和最大连续块。 */
#include "esp_heap_caps.h"
/* 引入芯片复位原因接口；现场隔离版在 ready 日志保留上一次复位来源。 */
#include "esp_system.h"
/* 引入单调微秒时钟。 */
#include "esp_timer.h"
/* 引入 LittleFS VFS 挂载。 */
#include "esp_littlefs.h"
/* 引入 FreeRTOS 基础类型和毫秒换算。 */
#include "freertos/FreeRTOS.h"
/* 引入按值队列。 */
#include "freertos/queue.h"
/* 引入互斥锁与二值信号量。 */
#include "freertos/semphr.h"
/* 引入多任务创建、延时和删除。 */
#include "freertos/task.h"
/* 引入 NVS 初始化；NimBLE 绑定密钥依赖 NVS。 */
#include "nvs.h"
/* 引入 NVS 分区初始化；NimBLE 绑定密钥依赖 NVS。 */
#include "nvs_flash.h"

/* 引入 bool。 */
#include <stdbool.h>
/* 引入定长整数。 */
#include <stdint.h>
/* 引入 snprintf。 */
#include <stdio.h>
/* 引入 memset 和 memcpy。 */
#include <string.h>

/* 固定应用日志标签。 */
static const char *const APP_TAG = "imu_handheld";
/* LittleFS VFS 根目录固定为 /littlefs。 */
#define APP_LITTLEFS_BASE_PATH "/littlefs"
/* 双槽摘要文件固定放在内部 Flash LittleFS。 */
#define APP_SESSION_FILE_PATH APP_LITTLEFS_BASE_PATH "/sessions.bin"
/* 设备偏好使用独立 NVS 命名空间，避免与 NimBLE bond 键冲突。 */
#define APP_CONFIG_NVS_NAMESPACE "fitness"
/* CRC32 配置 blob 固定存放在 device_cfg 键。 */
#define APP_CONFIG_NVS_KEY "device_cfg"
/* 马达强度固定 75%，单次有效重复的时长仍由领域层固定为 30 ms。 */
#define APP_HAPTIC_INTENSITY_PERCENT UINT8_C(75)
/* QMI 活动时每 4 ms 查询一次 DATA_READY，覆盖 125 Hz 与 112.1 Hz 两路 ODR。 */
#define APP_QMI_POLL_MS UINT32_C(4)
/* 电池每 30 秒刷新一次；启动阶段另读一次。 */
#define APP_BATTERY_POLL_MS UINT32_C(30000)
/* 空闲任务每 1 秒查询一次单调计时器，误差上限约 1 秒且不会高频唤醒 CPU。 */
#define APP_IDLE_POLL_MS UINT32_C(1000)
/* 默认 30 秒无操作熄屏；设备偏好命令可在 10~300 秒内覆盖。 */
#define APP_DEFAULT_SCREEN_TIMEOUT_MS UINT32_C(30000)
/* 无活动会话时连续 10 分钟无操作进入 Deep-sleep。 */
#define APP_LONG_IDLE_MS UINT32_C(600000)
/* 当前现场联调固件固定常亮：true 时禁止自动熄屏、自动 Light-sleep 和长空闲 Deep-sleep；用户主动关机仍有效。 */
#define APP_BENCH_ALWAYS_ON (true)
/* 当前功能联调版恢复 BLE 射频，用于真机配对、RawStream、LiveState 和分类结果验证。 */
#define APP_BENCH_DISABLE_BLE (false)
/* 当前功能联调版恢复首个 HOME 电源策略，使 QMI 在开始训练后可切换到 ACTIVE 采样。 */
#define APP_BENCH_SKIP_INITIAL_POWER_POLICY (false)
/* 显示重影已单独登记；当前退出显示-only，恢复 NVS、传感器、模型、任务和 BLE 产品链。 */
#define APP_BENCH_DISPLAY_ONLY (false)
/* 传感器-only 仍保留为回退工具，但本轮执行完整功能链。 */
#define APP_BENCH_SENSOR_ONLY (false)
/* 自检页至少保留 350 ms，使用户能看到启动阶段而不会明显拖慢开机。 */
#define APP_SELF_TEST_HOLD_MS UINT32_C(350)
/* 1001 表示板载 QMI8658、AXP2101 或 PCF85063 初始化未达到继续运行条件。 */
#define APP_STARTUP_FAULT_SENSOR INT32_C(1001)
/* 1002 表示 LittleFS 或双槽会话仓储不能安全挂载和恢复。 */
#define APP_STARTUP_FAULT_STORAGE INT32_C(1002)
/* 1003 表示协调器、IMU 流水线或模型运行域初始化失败。 */
#define APP_STARTUP_FAULT_DOMAIN INT32_C(1003)
/* NimBLE 控制回调等待应用任务提交事务的上限。 */
/* 设置命令包含一次 NVS commit；异步 BLE worker 最多等待 1.5 秒，不阻塞 NimBLE GAP 回调。 */
#define APP_BLE_COMMAND_TIMEOUT_MS UINT32_C(1500)
/* NimBLE 控制器异步启动后最多等待 2 秒完成主机同步和可连接广播。 */
#define APP_BLE_READY_TIMEOUT_MS UINT32_C(2000)
/* 每 20 ms 查询一次 BLE 快照；共最多 100 次，不忙等且不阻塞 NimBLE 主机任务。 */
#define APP_BLE_READY_POLL_MS UINT32_C(20)
/* 控制请求固定头之外最多 250 字节 TLV，和 ble_service_core 合同一致。 */
#define APP_BLE_COMMAND_MAX_TLV UINT16_C(250)
/* RawStream v1 固定为 sample index、单调毫秒、六轴 int16 和质量位，共 22 字节。 */
#define APP_RAW_STREAM_V1_SIZE UINT16_C(22)
/* 0x0210 表示设置 TLV 畸形、缺项或越界。 */
#define APP_BLE_ERROR_CONFIG_TLV UINT16_C(0x0210)
/* 0x0211 表示 NVS 配置未成功 commit。 */
#define APP_BLE_ERROR_CONFIG_PERSIST UINT16_C(0x0211)
/* 0x0212 表示 PCF85063 校时写入失败。 */
#define APP_BLE_ERROR_RTC_WRITE UINT16_C(0x0212)
/* 0x0213 表示未开启开发者模式却请求 RawStream。 */
#define APP_BLE_ERROR_DEVELOPER_REQUIRED UINT16_C(0x0213)
/* 0x0214 表示资料或偏好 revision 旧于设备当前事实。 */
#define APP_BLE_ERROR_STALE_REVISION UINT16_C(0x0214)
/* 会话传输响应 indication 后至少等待 100 ms 再发第一条 notification。 */
#define APP_TRANSFER_PUMP_MS UINT32_C(100)
/* 主应用事件队列容量，覆盖短时 QMI 帧突发及 UI/BLE 事件。 */
#define APP_EVENT_QUEUE_LENGTH UINT32_C(48)
/* UI 只需要最新完整快照，长度固定为 1 并使用 overwrite。 */
#define APP_UI_QUEUE_LENGTH UINT32_C(1)
/* 电源只需要最新策略，长度固定为 1。 */
#define APP_POWER_QUEUE_LENGTH UINT32_C(1)
/* BLE 输出允许缓存 LiveState 与 Event 短突发。 */
#define APP_BLE_QUEUE_LENGTH UINT32_C(16)
/* 摘要队列覆盖动作事件和停止事务。 */
#define APP_STORAGE_QUEUE_LENGTH UINT32_C(12)
/* 振动队列与领域层固定 FIFO 容量一致。 */
#define APP_HAPTIC_QUEUE_LENGTH FITNESS_HAPTIC_QUEUE_CAPACITY

/* 应用事件类型；所有可能修改 coordinator 的输入都在同一队列串行执行。 */
typedef enum app_event_kind {
    /* 一帧 QMI 异步加速度/角速度原始数据。 */
    APP_EVENT_QMI_FRAME = 0,
    /* QMI 读取或事件队列溢出，流水线必须重置连续窗。 */
    APP_EVENT_QMI_DROP,
    /* LVGL 按钮产生的用户命令。 */
    APP_EVENT_UI_COMMAND,
    /* NimBLE 控制命令 broker 请求。 */
    APP_EVENT_BLE_COMMAND,
    /* PC BLE 连接或断开。 */
    APP_EVENT_BLE_CONNECTION,
    /* NimBLE 配对码邮箱有新快照；应用任务负责安全分派到 LVGL。 */
    APP_EVENT_PAIRING_UPDATE,
    /* AXP2101 电量与充电状态更新。 */
    APP_EVENT_BATTERY,
    /* 马达任务已经真实启动一次 PWM 脉冲，应用任务据实际时刻登记 IMU 污染区。 */
    APP_EVENT_HAPTIC_STARTED,
    /* 生产空闲时钟每秒请求一次熄屏或长空闲门槛检查。 */
    APP_EVENT_IDLE_POLL,
    /* 关键摘要刷盘结果，用于授权或拒绝 PMIC 关机。 */
    APP_EVENT_STORAGE_RESULT
} app_event_kind_t;

/* 存储完成负载。 */
typedef struct app_storage_result {
    /* true 表示 session_store_upsert 已完成双槽同步。 */
    bool success;
    /* true 表示本次成功后必须执行 PMIC 关机。 */
    bool authorize_shutdown;
} app_storage_result_t;

/* 电池事件负载。 */
typedef struct app_battery_event {
    /* AXP2101 SOC，范围 0~100。 */
    uint8_t percent;
    /* true 表示 VBUS/PMIC 当前处于充电方向。 */
    bool charging;
} app_battery_event_t;

/* 保存一次已经实际启动的马达 PWM 导通区间；单位为单调微秒。 */
typedef struct app_haptic_interval_event {
    /* start_us 是 board_adapter_pulse_haptic 调用前立即捕获的单调时刻。 */
    uint64_t start_us;
    /* end_us 是 start_us 加本次 on_ms 得到的计划关断时刻，实际关断由 esp_timer 执行。 */
    uint64_t end_us;
} app_haptic_interval_event_t;

/* 跨任务应用事件；最大成员为一帧 QMI，按值复制后不借用驱动缓冲。 */
typedef struct app_event {
    /* 指明联合体有效成员。 */
    app_event_kind_t kind;
    /* 保存事件源捕获的单调毫秒。 */
    uint64_t monotonic_ms;
    /* 保存互斥事件负载。 */
    union {
        /* QMI 原始帧。 */
        board_qmi8658_frame_t qmi_frame;
        /* LVGL 命令。 */
        ui_command_t ui_command;
        /* BLE 连接状态。 */
        bool ble_connected;
        /* 电池状态。 */
        app_battery_event_t battery;
        /* 已实际启动的马达 PWM 区间。 */
        app_haptic_interval_event_t haptic_interval;
        /* 关键存储结果。 */
        app_storage_result_t storage_result;
    } data;
} app_event_t;

