G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* BLE 输出类型。 */
typedef enum app_ble_output_kind {
    /* 发布完整权威 LiveStateV1。 */
    APP_BLE_OUTPUT_LIVE_STATE = 0,
    /* 发布已经编码的 36 字节 EventV1 payload。 */
    APP_BLE_OUTPUT_EVENT,
    /* 发布开发者 25 Hz 六轴原始码诊断流；不重传、不落盘。 */
    APP_BLE_OUTPUT_RAW_STREAM
} app_ble_output_kind_t;

/* BLE 输出队列项。 */
typedef struct app_ble_output {
    /* 指明 live_state 或 event_payload 有效。 */
    app_ble_output_kind_t kind;
    /* 保存权威快照。 */
    ble_service_live_state_v1_t live_state;
    /* 保存固定 36 字节事件 payload。 */
    uint8_t event_payload[BLE_SERVICE_EVENT_V1_SIZE];
    /* 保存事件有效长度，当前固定为 36。 */
    uint16_t event_length;
    /* 保存 RawStream v1 固定 22 字节 payload。 */
    uint8_t raw_payload[APP_RAW_STREAM_V1_SIZE];
    /* 保存 RawStream 有效长度，当前固定为 22。 */
    uint16_t raw_length;
} app_ble_output_t;

/* 摘要存储队列项。 */
typedef struct app_storage_request {
    /* 保存需幂等写入的 64 字节内存摘要。 */
    session_summary_t summary;
    /* true 表示成功刷盘后授权 PMIC 断电。 */
    bool shutdown_after_persist;
} app_storage_request_t;

/* 电源任务队列项。 */
typedef struct app_power_request {
    /* 保存协调器生成的完整电源策略。 */
    power_policy_t policy;
    /* true 表示摘要已刷盘，允许执行 policy 中的 PMIC 关机。 */
    bool persist_authorized;
} app_power_request_t;

/* BLE 同步 broker 的单槽状态；NimBLE v1 只有一个 PC 且 GATT 写串行。 */
typedef struct app_ble_command_slot {
    /* 保存请求 ID。 */
    uint32_t request_id;
    /* 保存命令 ID 1~11。 */
    uint8_t command_id;
    /* 保存命令版本，当前必须为 1。 */
    uint8_t command_version;
    /* 深拷贝控制请求 TLV；NimBLE worker 返回前后均不借用 mbuf 内存。 */
    uint8_t tlv[APP_BLE_COMMAND_MAX_TLV];
    /* 保存深拷贝 TLV 有效长度，范围 0~250。 */
    uint16_t tlv_length;
    /* 保存应用任务生成的稳定响应。 */
    ble_service_command_result_t result;
} app_ble_command_slot_t;

/* 传感器集合；external_ops 在 board_runtime 初始化前即可指向本静态对象。 */
typedef struct app_sensor_hub {
    /* 保存 ESP-IDF 共用 I2C 设备适配器。 */
    board_sensors_esp_idf_i2c_t i2c;
    /* 保存 QMI8658 驱动状态。 */
    board_qmi8658_t qmi;
    /* 保存 AXP2101 驱动状态。 */
    board_axp2101_t axp;
    /* 保存 PCF85063 驱动状态。 */
    board_pcf85063_t rtc;
    /* 标记 QMI 轮询任务是否允许访问芯片。 */
    volatile bool qmi_sampling_enabled;
    /* 串行化 QMI 数据读取与 ACTIVE/WOM/OFF 寄存器切换；句柄由启动阶段创建。 */
    SemaphoreHandle_t qmi_mutex;
    /* 标记全部独立传感器驱动已完成初始化。 */
    bool initialized;
} app_sensor_hub_t;

/* 板级运行时生命周期覆盖全部任务。 */
static board_runtime_t s_board_runtime;
/* 保存显示初始化后的板级探测事实，后续传感器自检只读该快照。 */
static board_runtime_diagnostics_t s_board_diagnostics;
/* 独立传感器驱动生命周期覆盖全部任务。 */
static app_sensor_hub_t s_sensors;
/* IMU 流水线约 5.5 KiB，必须位于静态区而不是任务栈。 */
static imu_pipeline_t s_imu_pipeline;
/* 应用协调器含训练引擎和状态机，只有应用任务允许修改。 */
static device_coordinator_t s_coordinator;
/* 生产空闲计时器只由应用任务修改，空闲任务只投递查询事件。 */
static power_idle_timer_t s_power_idle_timer;
/* 当前熄屏门槛单位毫秒；启动使用 30 秒，加载偏好后覆盖。 */
static uint32_t s_screen_timeout_ms = APP_DEFAULT_SCREEN_TIMEOUT_MS;
/* 保存从 NVS 恢复或默认生成的完整设备配置；应用任务是运行期唯一写者。 */
static device_config_t s_device_config;
/* RawStream 是断线即关闭的易失诊断开关；volatile 允许 BLE 发布任务快速丢弃关闭后的排队帧。 */
static volatile bool s_raw_stream_enabled;
/* 每个 25 Hz 重采样点递增一次，uint32 溢出按协议自然回绕。 */
static uint32_t s_raw_sample_index;
/* 会话仓储含最近 200 条摘要，静态分配避免堆碎片。 */
static session_store_t s_session_store;
/* LittleFS 固定容量 stdio 后端。 */
static session_file_backend_t s_session_file_backend;
/* 会话 LIST/GET 补传服务。 */
static session_transfer_service_t s_session_transfer;
/* LVGL 页面渲染器。 */
static ui_lvgl_renderer_t s_ui_renderer;
/* NimBLE 主机任务到应用任务的最新配对码/清除事件邮箱；不保存动态指针。 */
static ui_app_pairing_mailbox_t s_pairing_mailbox;
/* 保存 BLE 命令同步 broker 单槽。 */
static app_ble_command_slot_t s_ble_command_slot;
/* 保存长期有效的 BLE 配置字符串。 */
static char s_ble_device_name[32];
/* 保存设备序列号。 */
static char s_ble_serial_number[32];
/* 板卡型号同时用于标准 Device Information，生命周期覆盖 BLE 服务。 */
static const char s_ble_model_number[] = "ESP32-S3-AMOLED-2.06";
/* 板卡修订同时进入标准 Device Information 和 Manifest。 */
static const char s_ble_hardware_revision[] = "2.06";
/* 固件语义版本同时进入标准 Device Information 和 Manifest。 */
static const char s_ble_firmware_revision[] = "0.1.0";
/* 正式 Manifest 最多 512 字节；NimBLE start 会复制有效部分。 */
static uint8_t s_ble_manifest[BLE_SERVICE_NIMBLE_MAX_MANIFEST_PAYLOAD];
/* 生成特征维度必须能无损写入 Manifest 的 u16LE 字段。 */
_Static_assert(FEATURE_DIM <= UINT16_MAX, "FEATURE_DIM exceeds Manifest u16");
/* 生成类别数量必须能无损写入 Manifest 的 u8 字段。 */
_Static_assert(CLASS_NUM <= UINT8_MAX, "CLASS_NUM exceeds Manifest u8");
/* 主应用事件队列。 */
static QueueHandle_t s_app_event_queue;
/* UI 最新快照队列。 */
static QueueHandle_t s_ui_queue;
/* BLE 输出队列。 */
static QueueHandle_t s_ble_queue;
/* 摘要写入队列。 */
static QueueHandle_t s_storage_queue;
/* 振动请求队列。 */
static QueueHandle_t s_haptic_queue;
/* 电源策略队列。 */
static QueueHandle_t s_power_queue;
/* BLE 命令单槽互斥锁。 */
static SemaphoreHandle_t s_ble_command_mutex;
/* BLE 命令应用完成信号。 */
static SemaphoreHandle_t s_ble_command_done;
/* 会话仓储互斥锁，保护存储任务写和 BLE 传输读。 */
static SemaphoreHandle_t s_session_store_mutex;
/* 会话传输服务互斥锁，保护 NimBLE handler 与 BLE pump。 */
static SemaphoreHandle_t s_session_transfer_mutex;
/* 双 M0 推理 PM 锁；仅在 297 特征与两个网络前向期间请求 CPU 最高频率。 */
static esp_pm_lock_handle_t s_inference_pm_lock;
/* 电源任务独占保存最近成功应用的 BLE 模式；-1 表示尚未向 NimBLE 提交。 */
static int s_applied_ble_power_mode = -1;

/* 声明 ESP-IDF 应用入口。 */
void app_main(void);

/*
 * 把完整设备配置编码成固定 44 字节、带 CRC32 的稳定 blob，并同步写入 NVS。
 * config 指向应用任务拥有的候选配置；调用期间必须非空且保持有效，函数不保存该指针。
 * 返回 ESP_OK 表示配置已进入非易失存储；其它错误表示编码、打开 NVS、写入或提交失败。
 */
static esp_err_t app_persist_device_config(const device_config_t *config);

/* 返回当前单调毫秒。 */
static uint64_t app_now_ms(void)
{
    /* ESP 定时器返回单调微秒，除以 1000 得毫秒。 */
    return (uint64_t)(esp_timer_get_time() / 1000LL);
}

/* 返回当前单调微秒。 */
static uint64_t app_now_us(void)
{
    /* esp_timer 在正常设备寿命内不会达到有符号 64 位上限。 */
    return (uint64_t)esp_timer_get_time();
}

/* 使用 ESP-IDF CPU 最高频率锁包装完整 297 特征提取和双 M0 前向。 */
static int app_pm_locked_dual_m0_infer(
    void *context,
    const float window[IMU_PIPELINE_WINDOW_SAMPLES][IMU_PIPELINE_AXIS_COUNT],
    float logits[IMU_PIPELINE_CLASS_COUNT])
{
    /* 启动阶段必须成功创建锁；空锁表示软件初始化合同被破坏。 */
    if (s_inference_pm_lock == NULL) {
        /* 返回负值，流水线会给窗口增加 INFERENCE_FAILED 质量位。 */
        return -2;
    }
    /* 获取 ESP_PM_CPU_FREQ_MAX 锁，保证 DFT、自相关和双 M0 在稳定高频下完成。 */
    const esp_err_t acquire_status = esp_pm_lock_acquire(s_inference_pm_lock);
    /* 锁获取失败时不运行可能超时的推理。 */
    if (acquire_status != ESP_OK) {
        /* 记录错误供诊断，避免输出未计算 logits。 */
        ESP_LOGE(APP_TAG, "inference PM lock acquire failed=%s", esp_err_to_name(acquire_status));
        /* 返回负值。 */
        return -3;
    }
    /* 在锁持有期同步执行特征提取、基础 M0、掩码 M0 和固定 logits 融合。 */
    const int inference_status = imu_pipeline_dual_m0_infer(context, window, logits);
    /* 无论推理成功或失败都释放锁，避免设备永久停留 240 MHz。 */
    const esp_err_t release_status = esp_pm_lock_release(s_inference_pm_lock);
    /* 释放失败表示 PM 锁计数异常，记录但保留真实推理返回码供流水线诊断。 */
    if (release_status != ESP_OK) {
        /* 输出 ESP-IDF 错误。 */
        ESP_LOGE(APP_TAG, "inference PM lock release failed=%s", esp_err_to_name(release_status));
    }
    /* 返回双 M0 原始状态；零表示本窗口 11 类 logits 有效。 */
    return inference_status;
}

/* 将跨任务捕获时间夹到协调器已提交时间，消除多生产者排队造成的微小乱序。 */
static uint64_t app_coordinator_time_ms(const uint64_t captured_ms)
{
    /* 相同毫秒被协调器允许；较旧事件使用最近提交时刻。 */
    return captured_ms < s_coordinator.last_monotonic_ms
               ? s_coordinator.last_monotonic_ms
               : captured_ms;
}

/* 饱和 uint64 到 uint32。 */
static uint32_t app_u64_to_u32(const uint64_t value)
{
    /* 超出线上字段范围时固定为 UINT32_MAX。 */
    return value > UINT32_MAX ? UINT32_MAX : (uint32_t)value;
}

/* 把 microkcal 转为 0.001 kcal，使用整数截断且饱和。 */
static uint32_t app_microkcal_to_mcal(const uint64_t microkcal)
{
    /* 1000 microkcal 等于 1 mcal。 */
    return app_u64_to_u32(microkcal / UINT64_C(1000));
}

/* 把 u16 按协议小端写入至少两个字节。 */
static void app_write_u16_le(uint8_t *output, const uint16_t value)
{
    /* 写低八位。 */
    output[0] = (uint8_t)(value & UINT16_C(0x00FF));
    /* 写高八位。 */
    output[1] = (uint8_t)((value >> 8U) & UINT16_C(0x00FF));
}

