G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 把 int16 的二补码位模式按小端写入。 */
static void app_write_i16_le(uint8_t *output, const int16_t value)
{
    /* 使用 memcpy 获取标准 int16 位模式，避免有符号右移。 */
    uint16_t raw = UINT16_C(0);
    /* 复制两个字节。 */
    (void)memcpy(&raw, &value, sizeof(raw));
    /* 复用无符号小端写入。 */
    app_write_u16_le(output, raw);
}

/* 把 u32 按协议小端写入至少四个字节。 */
static void app_write_u32_le(uint8_t *output, const uint32_t value)
{
    /* 写位 0~7。 */
    output[0] = (uint8_t)(value & UINT32_C(0x000000FF));
    /* 写位 8~15。 */
    output[1] = (uint8_t)((value >> 8U) & UINT32_C(0x000000FF));
    /* 写位 16~23。 */
    output[2] = (uint8_t)((value >> 16U) & UINT32_C(0x000000FF));
    /* 写位 24~31。 */
    output[3] = (uint8_t)((value >> 24U) & UINT32_C(0x000000FF));
}

/* 把滤波/重采样后的物理量反量化为 QMI int16 码，供开发诊断流显示。 */
static int16_t app_quantize_raw_axis(const float physical_value, const float units_per_lsb)
{
    /* 比例由流水线固定为正数；防御式拒绝零或负比例。 */
    if (!(units_per_lsb > 0.0F)) {
        /* 返回零，避免除零。 */
        return INT16_C(0);
    }
    /* 转换为传感器原始码浮点值。 */
    const float scaled = physical_value / units_per_lsb;
    /* 正方向超量程饱和到 int16 最大值。 */
    if (scaled >= 32767.0F) {
        /* 返回最大码。 */
        return INT16_MAX;
    }
    /* 负方向超量程饱和到 int16 最小值。 */
    if (scaled <= -32768.0F) {
        /* 返回最小码。 */
        return INT16_MIN;
    }
    /* 正数加 0.5、负数减 0.5 后向零截断，实现对称四舍五入。 */
    const float rounded = scaled >= 0.0F ? scaled + 0.5F : scaled - 0.5F;
    /* 范围已钳制，转换不会溢出。 */
    return (int16_t)rounded;
}

/* AXP 外部回调：读取 0~100 SOC 与 VBUS 外部供电状态。 */
static int app_sensor_read_battery(void *context, uint8_t *percent, bool *charging)
{
    /* 检查静态 hub 和两个输出指针。 */
    app_sensor_hub_t *hub = (app_sensor_hub_t *)context;
    /* 未初始化或空输出不能读。 */
    if ((hub == NULL) || !hub->initialized || (percent == NULL) || (charging == NULL)) {
        /* 返回非零供 board_runtime 映射为 I/O 错误。 */
        return -1;
    }
    /* 读取同一时刻 PMIC 快照。 */
    board_axp2101_status_t status;
    /* I2C 或范围错误时拒绝输出旧值。 */
    if (board_axp2101_read_status(&hub->axp, &status) != BOARD_SENSORS_OK) {
        /* 返回失败。 */
        return -1;
    }
    /* 输出燃料计百分比。 */
    *percent = status.soc_percent;
    /* 输出 VBUS good；即使电池充满停止充电，USB 接入时仍阻止长空闲 Deep-sleep。 */
    *charging = status.vbus_good;
    /* 返回成功。 */
    return 0;
}

/* QMI 外部回调：串行切换活动采样、21 Hz WOM 或完全关闭寄存器模式。 */
static int app_sensor_set_qmi_mode(void *context, const board_runtime_qmi_mode_t mode)
{
    /* 恢复长期 sensor hub。 */
    app_sensor_hub_t *hub = (app_sensor_hub_t *)context;
    /* 未初始化、无互斥锁或模式越界时拒绝。 */
    if ((hub == NULL) || !hub->initialized || (hub->qmi_mutex == NULL) ||
        ((mode != BOARD_RUNTIME_QMI_OFF) && (mode != BOARD_RUNTIME_QMI_ACTIVE) &&
         (mode != BOARD_RUNTIME_QMI_WAKE_ON_MOTION))) {
        /* 返回失败。 */
        return -1;
    }
    /* 先关闭轮询门控，使尚未取得互斥锁的 QMI 任务在锁内二次检查后退出。 */
    hub->qmi_sampling_enabled = false;
    /* 等待当前 I2C 数据读取结束；模式切换必须独占同一 QMI 寄存器集合。 */
    if (xSemaphoreTake(hub->qmi_mutex, portMAX_DELAY) != pdTRUE) {
        /* FreeRTOS 异常时拒绝切换。 */
        return -1;
    }
    /* 默认结果为参数错误；显式分支保证每个 runtime 枚举都映射到一个驱动 API。 */
    board_sensors_result_t result = BOARD_SENSORS_ERR_ARGUMENT;
    /* 按产品策略切换真实芯片寄存器。 */
    switch (mode) {
        /* 活动模式恢复训练部署的双传感器量程和 ODR。 */
        case BOARD_RUNTIME_QMI_ACTIVE:
            /* 调用 ACTIVE 恢复函数。 */
            result = board_qmi8658_set_active(&hub->qmi);
            /* 结束该分支。 */
            break;
        /* WOM 使用固定 40 mg 阈值和 4 个 21 Hz 消隐样本。 */
        case BOARD_RUNTIME_QMI_WAKE_ON_MOTION:
            /* 调用 WOM 配置并完成 CTRL9 握手。 */
            result = board_qmi8658_set_wake_on_motion(
                &hub->qmi,
                BOARD_QMI8658_WOM_THRESHOLD_MG,
                BOARD_QMI8658_WOM_BLANKING_SAMPLES);
            /* 结束该分支。 */
            break;
        /* OFF 清零 WOM 阈值并关闭加速度与陀螺。 */
        case BOARD_RUNTIME_QMI_OFF:
            /* 调用完全关闭函数。 */
            result = board_qmi8658_power_down(&hub->qmi);
            /* 结束该分支。 */
            break;
        /* 上方参数检查已经拒绝越界值；保留 default 作为防御式安全关闭。 */
        default:
            /* 保持参数错误。 */
            result = BOARD_SENSORS_ERR_ARGUMENT;
            /* 结束该分支。 */
            break;
    }
    /* 模式寄存器事务结束，释放 QMI 独占锁。 */
    (void)xSemaphoreGive(hub->qmi_mutex);
    /* 只有完整 ACTIVE 配置成功后才重新允许 4 ms 数据轮询。 */
    hub->qmi_sampling_enabled = (result == BOARD_SENSORS_OK) &&
                                (mode == BOARD_RUNTIME_QMI_ACTIVE);
    /* 返回零表示模式与驱动状态一致；非零会阻止 Deep-sleep。 */
    return result == BOARD_SENSORS_OK ? 0 : -1;
}

/* RTC 外部回调：读取 UTC Unix 秒。 */
static int app_sensor_read_rtc(void *context, uint64_t *unix_seconds)
{
    /* 恢复 hub 并检查输出。 */
    app_sensor_hub_t *hub = (app_sensor_hub_t *)context;
    /* 参数或状态无效时拒绝。 */
    if ((hub == NULL) || !hub->initialized || (unix_seconds == NULL)) {
        /* 返回失败。 */
        return -1;
    }
    /* 核心 RTC 使用有符号 Unix 秒。 */
    int64_t signed_seconds = 0;
    /* RTC VL 位或 I2C 错误时拒绝。 */
    if (board_pcf85063_read_unix(&hub->rtc, &signed_seconds) != BOARD_SENSORS_OK) {
        /* 返回失败。 */
        return -1;
    }
    /* 负 Unix 时间不属于产品支持范围。 */
    if (signed_seconds < 0) {
        /* 返回失败。 */
        return -1;
    }
    /* 安全转换为无符号输出。 */
    *unix_seconds = (uint64_t)signed_seconds;
    /* 返回成功。 */
    return 0;
}

/* PMIC 外部回调：执行 AXP2101 软关机。 */
static int app_sensor_request_shutdown(void *context)
{
    /* 恢复 hub。 */
    app_sensor_hub_t *hub = (app_sensor_hub_t *)context;
    /* 未初始化不能关机。 */
    if ((hub == NULL) || !hub->initialized) {
        /* 返回失败。 */
        return -1;
    }
    /* 写 AXP COMMON_CONFIG.bit0；调用方已保证摘要刷盘。 */
    return board_axp2101_request_shutdown(&hub->axp) == BOARD_SENSORS_OK ? 0 : -1;
}

/* 将 UI 完整快照投递给 LVGL 任务；队列满时覆盖旧帧。 */
static void app_queue_ui(const ui_context_t *ui)
{
    /* 空指针或队列未创建时不访问。 */
    if ((ui == NULL) || (s_ui_queue == NULL)) {
        /* 安全返回。 */
        return;
    }
    /* 长度 1 队列只保留最新状态。 */
    (void)xQueueOverwrite(s_ui_queue, ui);
}

/* 将权威 LiveState 投递给 BLE 任务。 */
static void app_queue_live_state(const ble_service_live_state_v1_t *state)
{
    /* 检查输入和队列。 */
    if ((state == NULL) || (s_ble_queue == NULL)) {
        /* 安全返回。 */
        return;
    }
    /* 构造按值消息。 */
    app_ble_output_t output;
    /* 清零事件缓冲等无效字段。 */
    (void)memset(&output, 0, sizeof(output));
    /* 标记 LiveState。 */
    output.kind = APP_BLE_OUTPUT_LIVE_STATE;
    /* 复制权威状态。 */
    output.live_state = *state;
    /* 队列短时满时丢旧中间态，后续修订会重新发布。 */
    if (xQueueSend(s_ble_queue, &output, 0U) != pdPASS) {
        /* 记录诊断；不阻塞应用任务。 */
        ESP_LOGW(APP_TAG, "BLE LiveState queue full revision=%lu", (unsigned long)state->state_revision);
    }
}

