G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 编码并排队一个 25 Hz RawStream v1 样本；普通产品模式完全不产生该流。 */
static void app_queue_raw_sample(
    const imu_resampled_sample_t *sample,
    const uint32_t sample_index)
{
    /* 只有开发者模式、显式流开关、安全连接和有效队列同时成立才发布。 */
    if ((sample == NULL) || !s_device_config.developer_mode ||
        !s_raw_stream_enabled || !ble_service_nimble_is_connected() ||
        (s_ble_queue == NULL)) {
        /* 不产生缓存或持久化。 */
        return;
    }
    /* 构造按值队列项。 */
    app_ble_output_t output;
    /* 清零其它消息字段。 */
    (void)memset(&output, 0, sizeof(output));
    /* 标记 RawStream。 */
    output.kind = APP_BLE_OUTPUT_RAW_STREAM;
    /* 偏移 0 写自启动递增序号。 */
    app_write_u32_le(&output.raw_payload[0], sample_index);
    /* 偏移 4 写单调毫秒低 32 位，约 49.7 天自然回绕。 */
    app_write_u32_le(&output.raw_payload[4], (uint32_t)(sample->timestamp_us / UINT64_C(1000)));
    /* 遍历固定 gx、gy、gz、ax、ay、az 六轴顺序。 */
    for (uint8_t axis = 0U; axis < IMU_PIPELINE_AXIS_COUNT; ++axis) {
        /* 前三轴使用 deg/s/LSB，后三轴使用 g/LSB。 */
        const float scale = axis < 3U
            ? BOARD_QMI8658_GYRO_DPS_PER_LSB
            : BOARD_QMI8658_ACCEL_G_PER_LSB;
        /* 反量化滤波后的物理值，诊断流不冒充未滤波芯片 FIFO。 */
        const int16_t raw_value = app_quantize_raw_axis(sample->axes[axis], scale);
        /* 每轴占 2 字节，从偏移 8 开始连续写入。 */
        app_write_i16_le(&output.raw_payload[8U + (size_t)axis * 2U], raw_value);
    }
    /* 偏移 20 写质量位低 16 位；完整内部位图仍保留在设备诊断统计。 */
    app_write_u16_le(&output.raw_payload[20], (uint16_t)(sample->quality_flags & UINT16_MAX));
    /* 固定线上长度。 */
    output.raw_length = APP_RAW_STREAM_V1_SIZE;
    /* RawStream 不可靠且不重传；队列满时直接丢当前诊断点，避免阻塞识别。 */
    (void)xQueueSend(s_ble_queue, &output, 0U);
}

/* 把唯一 MetricEvent 转成固定 EventV1 并投递。 */
static void app_queue_metric_event(const device_effects_t *effects)
{
    /* effect 必须同时含 MetricEvent 和 LiveState，后者提供修订号与电量。 */
    if ((effects == NULL) || (s_ble_queue == NULL)) {
        /* 安全返回。 */
        return;
    }
    /* 组装协议事件；PC 只用它驱动即时动画，不二次累计。 */
    const ble_service_event_v1_t event = {
        /* 当前事件结构版本固定为 1。 */
        .event_version = 1U,
        /* 指标事件统一使用 REPETITION_COUNTED，metric_kind 区分次/步/秒。 */
        .event_type = BLE_SERVICE_EVENT_REPETITION_COUNTED,
        /* 使用效果同修订的设备状态。 */
        .device_state = effects->live_state.device_state,
        /* 使用领域事件动作。 */
        .action_id = (uint8_t)effects->metric_event.action,
        /* fitness 0~2 映射 BLE 1~3。 */
        .metric_kind = (uint8_t)effects->metric_event.metric_kind + 1U,
        /* 使用同修订电量。 */
        .battery_percent = effects->live_state.battery_percent,
        /* 传播质量位。 */
        .quality_flags = effects->metric_event.quality_flags,
        /* 使用会话序号。 */
        .session_sequence = effects->metric_event.session_seq,
        /* 使用会话内幂等事件号。 */
        .event_sequence = effects->metric_event.event_seq,
        /* 使用协调器权威修订号。 */
        .state_revision = effects->live_state.state_revision,
        /* 写入本次增量。 */
        .metric_delta = effects->metric_event.delta_value,
        /* 饱和写入当前累计。 */
        .metric_total = app_u64_to_u32(effects->metric_event.total_value),
        /* microkcal 转 mcal。 */
        .calories_mcal = app_microkcal_to_mcal(effects->metric_event.gross_microkcal),
        /* 直接携带领域 Q15 稳定度。 */
        .confidence_q15 = effects->metric_event.stability_q15,
        /* 普通指标事件没有额外原因。 */
        .detail_code = 0U,
    };
    /* 构造队列消息。 */
    app_ble_output_t output;
    /* 清零全部字段。 */
    (void)memset(&output, 0, sizeof(output));
    /* 标记 Event。 */
    output.kind = APP_BLE_OUTPUT_EVENT;
    /* 编码函数使用 size_t 输出长度。 */
    size_t encoded_length = 0U;
    /* 编码固定小端 36 字节。 */
    const ble_service_status_t status = ble_service_encode_event_v1(
        &event,
        output.event_payload,
        sizeof(output.event_payload),
        &encoded_length);
    /* 编码失败表示内部合同错误，只记录而不发送半帧。 */
    if ((status != BLE_SERVICE_STATUS_OK) || (encoded_length != BLE_SERVICE_EVENT_V1_SIZE)) {
        /* 输出精确错误。 */
        ESP_LOGE(APP_TAG, "EventV1 encode failed status=%d len=%u", (int)status, (unsigned int)encoded_length);
        /* 返回。 */
        return;
    }
    /* 保存线上长度。 */
    output.event_length = (uint16_t)encoded_length;
    /* Event 队列满时不重算指标；LiveState 与摘要仍是权威恢复源。 */
    if (xQueueSend(s_ble_queue, &output, 0U) != pdPASS) {
        /* 记录丢失。 */
        ESP_LOGW(APP_TAG, "BLE Event queue full event=%lu", (unsigned long)event.event_sequence);
    }
}

/* 把电源策略投递给电源任务。 */
static void app_queue_power(const power_policy_t *policy, const bool persist_authorized)
{
    /* 检查输入与队列。 */
    if ((policy == NULL) || (s_power_queue == NULL)) {
        /* 安全返回。 */
        return;
    }
    /* 构造完整请求。 */
    app_power_request_t request = {
        /* 先复制领域策略。 */
        .policy = *policy,
        /* 写入刷盘授权。 */
        .persist_authorized = persist_authorized,
    };
    /* 默认 35% 档由用户偏好完整替换；暂停 15% 档只允许用户再调暗。 */
    if (request.policy.display_on &&
        ((request.policy.display_brightness_percent == UINT8_C(35)) ||
         (s_device_config.brightness_percent < request.policy.display_brightness_percent))) {
        /* 使用 Cmd9/NVS 的偏好值或更低亮度。 */
        request.policy.display_brightness_percent = s_device_config.brightness_percent;
    }
    /* 长度 1 队列只保留最新策略；关机状态不会再被普通状态覆盖。 */
    (void)xQueueOverwrite(s_power_queue, &request);
}

/* 投递非阻塞振动序列；污染区只能由马达任务按真实 PWM 启动时刻登记。 */
static void app_queue_haptic(const fitness_haptic_request_t *request)
{
    /* 参数和队列必须有效。 */
    if ((request == NULL) || (s_haptic_queue == NULL) || (request->repeat_count == 0U)) {
        /* 安全返回。 */
        return;
    }
    /* 用户关闭振动时丢弃新请求；计数、BLE 和摘要仍照常更新。 */
    if (!s_device_config.haptic_enabled) {
        /* 不向马达任务入队。 */
        return;
    }
    /* 队列满时记录；不在应用任务中等待马达。 */
    if (xQueueSend(s_haptic_queue, request, 0U) != pdPASS) {
        /* 输出原因。 */
        ESP_LOGW(APP_TAG, "haptic queue full reason=%d", (int)request->reason);
    }
}

/* 消费一次协调器 effect，禁止在此重算业务指标。 */
static void app_dispatch_effects(const device_effects_t *effects)
{
    /* 空 effect 无副作用。 */
    if (effects == NULL) {
        /* 安全返回。 */
        return;
    }
    /* UI 只收完整快照。 */
    if ((effects->flags & DEVICE_EFFECT_UI_RENDER) != 0U) {
        /* 投递最新页面。 */
        app_queue_ui(&effects->ui);
    }
    /* BLE 状态只收权威完整修订。 */
    if ((effects->flags & DEVICE_EFFECT_BLE_LIVE_STATE) != 0U) {
        /* 投递状态。 */
        app_queue_live_state(&effects->live_state);
    }
    /* Event 从唯一 MetricEvent 编码。 */
    if ((effects->flags & DEVICE_EFFECT_BLE_EVENT) != 0U) {
        /* 投递事件。 */
        app_queue_metric_event(effects);
    }
    /* 逐条预登记并投递振动波形。 */
    if ((effects->flags & DEVICE_EFFECT_HAPTIC) != 0U) {
        /* 遍历有效请求数。 */
        for (uint8_t index = 0U; index < effects->haptic_count; ++index) {
            /* 投递当前请求。 */
            app_queue_haptic(&effects->haptics[index]);
        }
    }
    /* 电源策略默认没有刷盘关机授权。 */
    if ((effects->flags & DEVICE_EFFECT_POWER_POLICY) != 0U) {
        /* 投递策略。 */
        app_queue_power(&effects->power_policy, false);
    }
    /* 保存摘要；shutdown 标志随同摘要交给存储任务。 */
    if ((effects->flags & DEVICE_EFFECT_SUMMARY_WRITE) != 0U) {
        /* 构造存储事务。 */
        const app_storage_request_t request = {
            /* 复制摘要。 */
            .summary = effects->summary,
            /* 保存成功后是否关机。 */
            .shutdown_after_persist =
                (effects->flags & DEVICE_EFFECT_SHUTDOWN_AFTER_PERSIST) != 0U,
        };
        /* 关机摘要最多等待 500 ms 入队，普通中间摘要不阻塞。 */
        const TickType_t wait_ticks = request.shutdown_after_persist
                                          ? pdMS_TO_TICKS(500U)
                                          : 0U;
        /* 入队失败时绝不授权断电。 */
        if (xQueueSend(s_storage_queue, &request, wait_ticks) != pdPASS) {
            /* 输出错误。 */
            ESP_LOGE(APP_TAG, "session summary queue full seq=%lu shutdown=%d",
                     (unsigned long)request.summary.session_seq,
                     request.shutdown_after_persist ? 1 : 0);
        }
    } else if ((effects->flags & DEVICE_EFFECT_SHUTDOWN_AFTER_PERSIST) != 0U) {
        /* 空会话没有摘要可写，当前持久化状态已稳定，可直接授权关机。 */
        app_queue_power(&effects->power_policy, true);
    }
}

/* 通过协调器原子提交熄屏、唤醒或长空闲事件，使 UI 与功耗状态不会分裂。 */
static device_coordinator_status_t app_handle_idle_power_event(
    const power_event_type_t event_type,
    const uint64_t captured_ms)
{
    /* 保存本次完整按值效果。 */
    device_effects_t effects;
    /* 由协调器在同一候选副本更新 UI、Power、修订号和 LiveState。 */
    const device_coordinator_status_t status = device_coordinator_handle_idle_power_event(
        &s_coordinator,
        event_type,
        app_coordinator_time_ms(captured_ms),
        &effects);
    /* 成功后才扇出页面、BLE 和硬件策略。 */
    if (status == DEVICE_COORDINATOR_OK) {
        /* 投递同一修订的全部效果。 */
        app_dispatch_effects(&effects);
    }
    /* 返回状态供 UI/BLE 调用方记录或决定是否继续控制。 */
    return status;
}

/* 25 Hz 点回调；同步运行在应用任务，直接进入唯一协调器。 */
static void app_pipeline_on_sample(void *context, const imu_resampled_sample_t *sample)
{
    /* 当前回调不使用 context。 */
    (void)context;
    /* 空样本不处理。 */
    if (sample == NULL) {
        /* 安全返回。 */
        return;
    }
    /* 为所有 25 Hz 点分配连续序号，即使 RawStream 关闭也保持时间线语义。 */
    const uint32_t raw_sample_index = s_raw_sample_index;
    /* uint32 达到最大值后按协议自然回绕。 */
    s_raw_sample_index += UINT32_C(1);
    /* 开发模式开启时把当前滤波/重采样六轴点排入 BLE 诊断流。 */
    app_queue_raw_sample(sample, raw_sample_index);
    /* 构造 motion_phase 固定六轴输入。 */
    motion_phase_sample_t motion_sample;
    /* 时间转毫秒并夹到协调器单调边界。 */
    motion_sample.monotonic_ms = app_coordinator_time_ms(sample->timestamp_us / UINT64_C(1000));
    /* 复制 gx、gy、gz、ax、ay、az。 */
    (void)memcpy(motion_sample.axis, sample->axes, sizeof(motion_sample.axis));
    /* 连续性破坏位表示当前动作段分类证据存在时间缺口，必须清空历史 logits。 */
    const uint32_t bout_reset_mask =
        (uint32_t)IMU_QUALITY_ACCEL_GAP |
        (uint32_t)IMU_QUALITY_GYRO_GAP |
        (uint32_t)IMU_QUALITY_OUT_OF_ORDER |
        (uint32_t)IMU_QUALITY_QUEUE_OVERFLOW |
        (uint32_t)IMU_QUALITY_DRIVER_DROP |
        (uint32_t)IMU_QUALITY_RESAMPLER_RESET;
    /* 只在真实连续性破坏时重置动作段分类证据；马达污染仅跳过当前点，不能丢弃整段历史。 */
    if ((sample->quality_flags & bout_reset_mask) != 0U) {
        /* 清空累计 logits，但保留当前会话的动作、次数、时间和热量。 */
        workout_engine_reset_bout_evidence(&s_coordinator.workout);
    }
    /* 马达污染、间断或队列溢出时仍累计热量，但冻结相位/步峰。 */
    const uint32_t invalid_count_mask =
        (uint32_t)IMU_QUALITY_ACCEL_GAP |
        (uint32_t)IMU_QUALITY_GYRO_GAP |
        (uint32_t)IMU_QUALITY_OUT_OF_ORDER |
        (uint32_t)IMU_QUALITY_QUEUE_OVERFLOW |
        (uint32_t)IMU_QUALITY_HAPTIC_CONTAMINATED |
        (uint32_t)IMU_QUALITY_DRIVER_DROP |
        (uint32_t)IMU_QUALITY_RESAMPLER_RESET;
    /* 只有零关键质量位时允许推进计数器。 */
    const bool count_input_valid = (sample->quality_flags & invalid_count_mask) == 0U;
    /* 保存按值效果。 */
    device_effects_t effects;
    /* 进入唯一业务事实链。 */
    const device_coordinator_status_t status = device_coordinator_push_sample(
        &s_coordinator,
        &motion_sample,
        count_input_valid,
        (uint16_t)(sample->quality_flags & UINT16_MAX),
        &effects);
    /* 成功 effect 可能为空或包含 MetricEvent。 */
    if (status == DEVICE_COORDINATOR_OK) {
        /* 扇出效果。 */
        app_dispatch_effects(&effects);
    } else if ((status != DEVICE_COORDINATOR_IGNORED) &&
               (status != DEVICE_COORDINATOR_ERR_STATE)) {
        /* 记录真正异常；准备/暂停状态拒绝样本不刷屏。 */
        ESP_LOGW(APP_TAG, "coordinator sample status=%d quality=0x%08lX",
                 (int)status,
                 (unsigned long)sample->quality_flags);
    }
}

