G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 双 M0 推理回调；失败或关键质量窗不用于锁定动作。 */
static void app_pipeline_on_inference(
    void *context,
    const imu_pipeline_inference_result_t *result)
{
    /* 当前回调不使用 context。 */
    (void)context;
    /* 检查结果。 */
    if (result == NULL) {
        /* 安全返回。 */
        return;
    }
    /* 任何推理失败或质量告警都不提交动作证据。 */
    if ((result->inference_status != 0) || (result->quality_flags != IMU_QUALITY_OK)) {
        /* 只记录推理错误，常规质量位由诊断统计观察。 */
        if (result->inference_status != 0) {
            /* 输出错误。 */
            ESP_LOGE(APP_TAG, "dual M0 inference failed=%d seq=%lu",
                     result->inference_status,
                     (unsigned long)result->sequence);
        }
        /* 返回。 */
        return;
    }
    /* 保存效果。 */
    device_effects_t effects;
    /* 提交 11 维融合 logits。 */
    const device_coordinator_status_t status = device_coordinator_push_inference(
        &s_coordinator,
        result->logits,
        app_coordinator_time_ms(result->end_timestamp_us / UINT64_C(1000)),
        (uint16_t)(result->quality_flags & UINT16_MAX),
        &effects);
    /* 成功时可能触发动作锁定和页面切换。 */
    if (status == DEVICE_COORDINATOR_OK) {
        /* 扇出效果。 */
        app_dispatch_effects(&effects);
    } else if ((status != DEVICE_COORDINATOR_IGNORED) &&
               (status != DEVICE_COORDINATOR_ERR_STATE)) {
        /* 记录异常。 */
        ESP_LOGW(APP_TAG, "coordinator inference status=%d", (int)status);
    }
}

/* 将一帧 QMI 原始数据提交给应用任务独占的流水线。 */
static void app_process_qmi_frame(const board_qmi8658_frame_t *frame)
{
    /* 空帧不处理。 */
    if (frame == NULL) {
        /* 安全返回。 */
        return;
    }
    /* 复用一个三轴原始点结构。 */
    imu_qmi_raw_sample_t raw;
    /* 清零质量位和轴。 */
    (void)memset(&raw, 0, sizeof(raw));
    /* 两路使用驱动捕获的同一单调微秒。 */
    raw.timestamp_us = frame->timestamp_us;
    /* 新加速度存在时提交 ax、ay、az。 */
    if (frame->accel_available) {
        /* 复制三个 int16 原始轴。 */
        (void)memcpy(raw.raw_xyz, frame->accel_raw, sizeof(raw.raw_xyz));
        /* 提交 125 Hz 流。 */
        (void)imu_pipeline_push_accel_raw(&s_imu_pipeline, &raw);
    }
    /* 新角速度存在时提交 gx、gy、gz。 */
    if (frame->gyro_available) {
        /* 复制三个 int16 原始轴。 */
        (void)memcpy(raw.raw_xyz, frame->gyro_raw, sizeof(raw.raw_xyz));
        /* 提交 112.1 Hz 流。 */
        (void)imu_pipeline_push_gyro_raw(&s_imu_pipeline, &raw);
    }
}

/* 把运行配置投影到 UI 只读设置快照；不修改训练、BLE 或 NVS。 */
static void app_project_device_config_to_ui(ui_context_t *ui)
{
    /* 输出页面上下文必须存在。 */
    if (ui == NULL) {
        /* 无可写对象时安全返回。 */
        return;
    }
    /* 复制 AMOLED 用户亮度百分比。 */
    ui->view.brightness_percent = s_device_config.brightness_percent;
    /* 复制自动熄屏秒数。 */
    ui->view.screen_timeout_seconds = s_device_config.screen_timeout_seconds;
    /* 复制偏好修订号，供设备与 PC 诊断对照。 */
    ui->view.preferences_revision = s_device_config.preferences_revision;
    /* 复制计次振动总开关。 */
    ui->view.haptic_enabled = s_device_config.haptic_enabled;
}

/* 返回下一个设备端亮度预设；任意 PC 自定义值会向上取最近档。 */
static uint8_t app_next_brightness_percent(const uint8_t current)
{
    /* 小于 15% 先进入最低可用预设。 */
    if (current < UINT8_C(15)) {
        /* 返回 15%。 */
        return UINT8_C(15);
    }
    /* 15~34% 进入默认 35%。 */
    if (current < UINT8_C(35)) {
        /* 返回 35%。 */
        return UINT8_C(35);
    }
    /* 35~59% 进入 60%。 */
    if (current < UINT8_C(60)) {
        /* 返回 60%。 */
        return UINT8_C(60);
    }
    /* 60~99% 进入最高 100%。 */
    if (current < UINT8_C(100)) {
        /* 返回 100%。 */
        return UINT8_C(100);
    }
    /* 100% 后回到省电 15%。 */
    return UINT8_C(15);
}

/* 返回下一个设备端熄屏预设，单位秒。 */
static uint16_t app_next_screen_timeout_seconds(const uint16_t current)
{
    /* 小于 15 秒时进入 15 秒预设。 */
    if (current < UINT16_C(15)) {
        /* 返回 15 秒。 */
        return UINT16_C(15);
    }
    /* 15~29 秒进入 30 秒。 */
    if (current < UINT16_C(30)) {
        /* 返回 30 秒。 */
        return UINT16_C(30);
    }
    /* 30~59 秒进入 60 秒。 */
    if (current < UINT16_C(60)) {
        /* 返回 60 秒。 */
        return UINT16_C(60);
    }
    /* 60~119 秒进入 120 秒。 */
    if (current < UINT16_C(120)) {
        /* 返回 120 秒。 */
        return UINT16_C(120);
    }
    /* 120 秒及更长 PC 自定义值后回到 15 秒。 */
    return UINT16_C(15);
}

/* 处理不经过领域协调器的设备端设置与诊断按钮；返回 true 表示命令已消费。 */
static bool app_process_local_ui_command(const ui_command_t command)
{
    /* 诊断振动只在诊断页接受，复用与一次有效计数完全相同的 30 ms 脉冲。 */
    if (command == UI_COMMAND_TEST_HAPTIC) {
        /* 页面已切走或振动关闭时丢弃排队旧命令。 */
        if ((s_coordinator.ui.state != UI_STATE_DIAGNOSTICS) ||
            !s_device_config.haptic_enabled) {
            /* 命令属于本地设置集合，仍视为已消费。 */
            return true;
        }
        /* 构造一次计数反馈同波形请求；不产生 MetricEvent。 */
        const fitness_haptic_request_t request = {
            /* 马达有效导通 30 ms。 */
            .on_ms = UINT16_C(30),
            /* 单脉冲没有间隔。 */
            .off_ms = UINT16_C(0),
            /* 只振动一次。 */
            .repeat_count = UINT8_C(1),
            /* 复用一次有效重复的硬件波形。 */
            .reason = FITNESS_HAPTIC_REASON_REPETITION,
        };
        /* 异步投递，UI 线程和应用任务均不等待电机。 */
        app_queue_haptic(&request);
        /* 命令处理完成。 */
        return true;
    }
    /* “忘记电脑”只删除 NimBLE 绑定，不修改设备偏好、训练记录或算法状态。 */
    if (command == UI_COMMAND_FORGET_COMPUTER) {
        /* 页面已切走时安全消费旧触摸事件，防止后台误删合法绑定。 */
        if (s_coordinator.ui.state != UI_STATE_SETTINGS) {
            /* 命令属于本地设置集合，返回已消费。 */
            return true;
        }
        /* 断开当前 PC 并调用 NimBLE 官方存储清除全部绑定。 */
        const esp_err_t forget_status = ble_service_nimble_forget_all_bonds();
        /* 服务未启动或底层清密钥失败时保留明确串口诊断；不得伪装成功。 */
        if (forget_status != ESP_OK) {
            /* 输出 ESP-IDF 稳定错误名，不记录电脑地址或密钥。 */
            ESP_LOGE(APP_TAG, "forget BLE bonds failed=%s", esp_err_to_name(forget_status));
        }
        /* API 内部会通过 passkey_clear 回调清除屏幕敏感码。 */
        return true;
    }
    /* 判断命令是否属于三项可持久化设备偏好。 */
    const bool brightness_command = command == UI_COMMAND_CYCLE_BRIGHTNESS;
    /* 判断振动切换。 */
    const bool haptic_command = command == UI_COMMAND_TOGGLE_HAPTIC;
    /* 判断熄屏时长切换。 */
    const bool timeout_command = command == UI_COMMAND_CYCLE_TIMEOUT;
    /* 其它命令交回普通导航或会话控制。 */
    if (!brightness_command && !haptic_command && !timeout_command) {
        /* 返回未消费。 */
        return false;
    }
    /* 亮度和振动只允许 SETTINGS；熄屏时长只允许 DIAGNOSTICS。 */
    const bool valid_page = (brightness_command || haptic_command)
        ? (s_coordinator.ui.state == UI_STATE_SETTINGS)
        : (s_coordinator.ui.state == UI_STATE_DIAGNOSTICS);
    /* 页面切换后到达的旧按钮事件不得修改配置。 */
    if (!valid_page) {
        /* 命令已安全消费。 */
        return true;
    }
    /* 在局部副本修改，NVS commit 成功前运行事实保持不变。 */
    device_config_t candidate = s_device_config;
    /* 按命令修改唯一字段。 */
    if (brightness_command) {
        /* 循环 15/35/60/100% 预设。 */
        candidate.brightness_percent = app_next_brightness_percent(candidate.brightness_percent);
    } else if (haptic_command) {
        /* 切换计次与系统反馈马达总开关。 */
        candidate.haptic_enabled = !candidate.haptic_enabled;
    } else {
        /* 循环 15/30/60/120 秒预设。 */
        candidate.screen_timeout_seconds = app_next_screen_timeout_seconds(
            candidate.screen_timeout_seconds);
    }
    /* 修订号饱和于 UINT32_MAX；达到上限后仍允许同修订幂等覆盖。 */
    if (candidate.preferences_revision < UINT32_MAX) {
        /* 每次成功本地修改增加一次。 */
        candidate.preferences_revision += UINT32_C(1);
    }
    /* 先持久化完整 CRC32 blob，失败时不改变屏幕或运行开关。 */
    const esp_err_t persist_error = app_persist_device_config(&candidate);
    /* NVS 失败只记录并保留旧页面事实。 */
    if (persist_error != ESP_OK) {
        /* 输出错误供诊断页和串口定位。 */
        ESP_LOGE(APP_TAG, "local preference persist failed error=%s", esp_err_to_name(persist_error));
        /* 命令已消费。 */
        return true;
    }
    /* NVS 成功后提交运行配置。 */
    s_device_config = candidate;
    /* 秒转毫秒；最大 600 秒不会溢出 uint32。 */
    s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
    /* 关闭振动时清除尚未执行的排队波形。 */
    if (!s_device_config.haptic_enabled) {
        /* 已导通脉冲仍由硬件定时器自然结束。 */
        (void)xQueueReset(s_haptic_queue);
    }
    /* 把真实设置投影到当前页面快照。 */
    app_project_device_config_to_ui(&s_coordinator.ui);
    /* 立即刷新设置或诊断文字。 */
    app_queue_ui(&s_coordinator.ui);
    /* 重新投递当前电源策略，使亮度修改立即作用于 AMOLED。 */
    const power_policy_t policy = power_manager_policy(&s_coordinator.power);
    /* 应用亮度但不授权 PMIC 关机。 */
    app_queue_power(&policy, false);
    /* 开启振动时用一次 30 ms 计数同波形给用户确认。 */
    if (haptic_command && s_device_config.haptic_enabled) {
        /* 构造单脉冲。 */
        const fitness_haptic_request_t confirmation = {
            /* 有效导通 30 ms。 */
            .on_ms = UINT16_C(30),
            /* 单脉冲无关闭间隔。 */
            .off_ms = UINT16_C(0),
            /* 重复一次。 */
            .repeat_count = UINT8_C(1),
            /* 使用有效计数波形。 */
            .reason = FITNESS_HAPTIC_REASON_REPETITION,
        };
        /* 异步投递确认反馈。 */
        app_queue_haptic(&confirmation);
    }
    /* 设置命令完成。 */
    return true;
}

/* 处理 UI 命令；设置/诊断直接改纯 UI，其余走协调器统一控制。 */
static void app_process_ui_command(const ui_command_t command, const uint64_t captured_ms)
{
    /* 任意真实触摸都是用户活动，重新开始熄屏和长空闲计时。 */
    power_idle_timer_note_activity(&s_power_idle_timer, captured_ms);
    /* 熄屏透明按钮只负责原子恢复 UI 和功耗，不进入普通页面导航。 */
    if (command == UI_COMMAND_WAKE) {
        /* 当前状态若已被其它来源唤醒，状态错误只代表命令已过期。 */
        const device_coordinator_status_t wake_status = app_handle_idle_power_event(
            POWER_EVENT_USER_WAKE,
            captured_ms);
        /* 非幂等状态错误之外的异常需输出诊断。 */
        if ((wake_status != DEVICE_COORDINATOR_OK) &&
            (wake_status != DEVICE_COORDINATOR_ERR_STATE)) {
            /* 记录唤醒失败。 */
            ESP_LOGW(APP_TAG, "UI wake rejected status=%d", (int)wake_status);
        }
        /* 唤醒命令已消费。 */
        return;
    }
    /* 亮度、振动、熄屏与马达自检由应用任务本地事务处理。 */
    if (app_process_local_ui_command(command)) {
        /* 本地命令已处理或因页面过期安全忽略。 */
        return;
    }
    /* 先映射纯 UI 事件。 */
    ui_event_t ui_event;
    /* 无映射命令安全忽略。 */
    if (!ui_command_to_event(command, (uint32_t)captured_ms, &ui_event)) {
        /* 返回。 */
        return;
    }
    /* 尝试映射为训练控制。 */
    device_control_t control;
    /* 训练控制必须进入协调器。 */
    if (device_coordinator_control_from_ui(ui_event.type, &control)) {
        /* 保存效果。 */
        device_effects_t effects;
        /* 使用单调夹取时间。 */
        const device_coordinator_status_t status = device_coordinator_handle_control(
            &s_coordinator,
            control,
            app_coordinator_time_ms(captured_ms),
            &effects);
        /* 成功时扇出。 */
        if (status == DEVICE_COORDINATOR_OK) {
            /* START/RESUME 成功后丢弃旧 62 点窗口，禁止上一个会话或暂停前数据进入新判断。 */
            if ((command == UI_COMMAND_START) || (command == UI_COMMAND_RESUME)) {
                /* 同时清空重采样网格、环形窗口和待传播质量位。 */
                imu_pipeline_reset_session(&s_imu_pipeline);
            }
            /* 扇出效果。 */
            app_dispatch_effects(&effects);
        } else {
            /* 输出被拒绝原因，例如 8% 低电量。 */
            ESP_LOGW(APP_TAG, "UI command=%d rejected status=%d", (int)command, (int)status);
        }
        /* 返回。 */
        return;
    }
    /* 设置、诊断和返回只更新协调器内部纯 UI。 */
    const ui_dispatch_result_t ui_status = ui_dispatch_event(&s_coordinator.ui, &ui_event);
    /* 成功时投递新页面。 */
    if (ui_status == UI_DISPATCH_OK) {
        /* 渲染完整快照。 */
        app_queue_ui(&s_coordinator.ui);
    }
}

/* 完成一个显式 BLE 业务结果并唤醒等待中的异步 NimBLE worker。 */
static void app_finish_ble_explicit(const uint8_t status, const uint16_t error_code)
{
    /* 设置命令 v1 当前不返回可选 TLV。 */
    s_ble_command_slot.result.tlv = NULL;
    /* 可选 TLV 长度固定为零。 */
    s_ble_command_slot.result.tlv_length = 0U;
    /* 返回命令提交后的权威协调器修订号。 */
    s_ble_command_slot.result.state_revision = s_coordinator.state_revision;
    /* 写入线上业务状态。 */
    s_ble_command_slot.result.status = status;
    /* 写入稳定错误码；成功时调用者传 BLE_SERVICE_ERROR_NONE。 */
    s_ble_command_slot.result.error_code = error_code;
    /* 唤醒等待中的 NimBLE worker；GATT 回调线程本身从不等待该事务。 */
    (void)xSemaphoreGive(s_ble_command_done);
}

/* 把协调器返回码映射为 BLE 稳定响应。 */
static void app_finish_ble_command(const device_coordinator_status_t status)
{
    /* 默认不返回 TLV。 */
    s_ble_command_slot.result.tlv = NULL;
    /* 默认 TLV 长度为零。 */
    s_ble_command_slot.result.tlv_length = 0U;
    /* 返回事务后的权威修订号。 */
    s_ble_command_slot.result.state_revision = s_coordinator.state_revision;
    /* 成功或安全忽略都视为幂等成功。 */
    if ((status == DEVICE_COORDINATOR_OK) || (status == DEVICE_COORDINATOR_IGNORED)) {
        /* 写成功状态。 */
        s_ble_command_slot.result.status = BLE_SERVICE_CONTROL_OK;
        /* 无错误。 */
        s_ble_command_slot.result.error_code = BLE_SERVICE_ERROR_NONE;
    } else if ((status == DEVICE_COORDINATOR_ERR_STATE) ||
               (status == DEVICE_COORDINATOR_ERR_LOW_BATTERY)) {
        /* 安全策略拒绝。 */
        s_ble_command_slot.result.status = BLE_SERVICE_CONTROL_REJECTED;
        /* 0x0201 表示设备状态不允许，0x0202 表示低电量。 */
        s_ble_command_slot.result.error_code =
            status == DEVICE_COORDINATOR_ERR_LOW_BATTERY ? UINT16_C(0x0202) : UINT16_C(0x0201);
    } else {
        /* 其它错误映射内部错误。 */
        s_ble_command_slot.result.status = BLE_SERVICE_CONTROL_INTERNAL_ERROR;
        /* 使用通用业务处理失败码。 */
        s_ble_command_slot.result.error_code = BLE_SERVICE_ERROR_HANDLER_FAILED;
    }
    /* 唤醒等待中的 NimBLE 回调。 */
    (void)xSemaphoreGive(s_ble_command_done);
}

/* 判断命令是否属于配置/校时/RawStream TLV 组件。 */
static bool app_is_device_config_command(const uint8_t command_id)
{
    /* 五个固定命令以外仍交给会话协调器。 */
    return (command_id == (uint8_t)DEVICE_COMMAND_SYNC_TIME) ||
           (command_id == (uint8_t)DEVICE_COMMAND_SET_USER_PROFILE) ||
           (command_id == (uint8_t)DEVICE_COMMAND_SET_GOAL) ||
           (command_id == (uint8_t)DEVICE_COMMAND_SET_PREFERENCES) ||
           (command_id == (uint8_t)DEVICE_COMMAND_SET_RAW_STREAM);
}

/* 检查 Cmd9 内容是否与当前持久配置完全相同，用于 revision 相等时幂等成功。 */
static bool app_preferences_match_current(const device_preferences_command_t *preferences)
{
    /* 空输入不匹配。 */
    if (preferences == NULL) {
        /* 返回 false。 */
        return false;
    }
    /* 比较六个持久字段；RawStream 是独立易失命令，不参与 Cmd9。 */
    return (preferences->brightness_percent == s_device_config.brightness_percent) &&
           (preferences->haptic_enabled == s_device_config.haptic_enabled) &&
           (preferences->sound_enabled == s_device_config.sound_enabled) &&
           (preferences->screen_timeout_seconds == s_device_config.screen_timeout_seconds) &&
           (preferences->preferences_revision == s_device_config.preferences_revision) &&
           (preferences->developer_mode == s_device_config.developer_mode);
}

/* 处理 Cmd6/7/8/9/11；返回 true 表示命令已完成并已释放完成信号。 */
static bool app_process_device_config_command(const uint64_t captured_ms)
{
    /* 非配置命令交给原会话控制路径。 */
    if (!app_is_device_config_command(s_ble_command_slot.command_id)) {
        /* 返回未处理。 */
        return false;
    }
    /* 解码为类型安全联合体；输入 TLV 已在 broker 深拷贝。 */
    device_command_v1_t command;
    /* 严格检查版本、长度、重复项、缺项和范围。 */
    const device_config_status_t decode_status = device_command_v1_decode(
        s_ble_command_slot.command_id,
        s_ble_command_slot.command_version,
        s_ble_command_slot.tlv,
        s_ble_command_slot.tlv_length,
        &command);
    /* 任一解析失败返回固定设置错误，不修改 RTC、NVS 或运行状态。 */
    if (decode_status != DEVICE_CONFIG_OK) {
        /* 输出精确内部状态供串口诊断。 */
        ESP_LOGW(APP_TAG, "device command decode failed cmd=%u status=%d",
                 (unsigned int)s_ble_command_slot.command_id,
                 (int)decode_status);
        /* 返回业务拒绝。 */
        app_finish_ble_explicit(BLE_SERVICE_CONTROL_REJECTED, APP_BLE_ERROR_CONFIG_TLV);
        /* 命令已完成。 */
        return true;
    }
    /* Cmd7 revision 小于当前值时拒绝旧配置覆盖；默认 revision=1 允许 PC 首次同号认领。 */
    if (command.command_id == (uint8_t)DEVICE_COMMAND_SET_USER_PROFILE) {
        /* 读取线上 revision。 */
        const uint32_t revision = command.value.user_profile.profile_revision;
        /* 判断严格旧 revision。 */
        if (revision < s_device_config.profile_revision) {
            /* 返回稳定陈旧修订错误。 */
            app_finish_ble_explicit(BLE_SERVICE_CONTROL_REJECTED, APP_BLE_ERROR_STALE_REVISION);
            /* 命令已完成。 */
            return true;
        }
        /* 同 revision 且同体重属于幂等重试，不重复写 Flash。 */
        if ((revision == s_device_config.profile_revision) &&
            (command.value.user_profile.weight_g == s_device_config.weight_g)) {
            /* 返回成功。 */
            app_finish_ble_explicit(BLE_SERVICE_CONTROL_OK, BLE_SERVICE_ERROR_NONE);
            /* 命令已完成。 */
            return true;
        }
    }
    /* Cmd9 同样拒绝严格旧 revision；相同 revision 可覆盖冻结默认值或形成幂等重试。 */
    if (command.command_id == (uint8_t)DEVICE_COMMAND_SET_PREFERENCES) {
        /* 读取偏好 revision。 */
        const uint32_t revision = command.value.preferences.preferences_revision;
        /* 更旧 revision 拒绝。 */
        if (revision < s_device_config.preferences_revision) {
            /* 返回陈旧修订。 */
            app_finish_ble_explicit(BLE_SERVICE_CONTROL_REJECTED, APP_BLE_ERROR_STALE_REVISION);
            /* 命令已完成。 */
            return true;
        }
        /* 完全相同属于幂等成功。 */
        if ((revision == s_device_config.preferences_revision) &&
            app_preferences_match_current(&command.value.preferences)) {
            /* 返回成功且不磨损 Flash。 */
            app_finish_ble_explicit(BLE_SERVICE_CONTROL_OK, BLE_SERVICE_ERROR_NONE);
            /* 命令已完成。 */
            return true;
        }
    }
    /* Cmd11 开启时必须先由 Cmd9 显式打开开发者模式。 */
    if ((command.command_id == (uint8_t)DEVICE_COMMAND_SET_RAW_STREAM) &&
        command.value.raw_stream.raw_stream_enabled &&
        !s_device_config.developer_mode) {
        /* 返回开发者权限错误。 */
        app_finish_ble_explicit(BLE_SERVICE_CONTROL_REJECTED, APP_BLE_ERROR_DEVELOPER_REQUIRED);
        /* 命令已完成。 */
        return true;
    }
    /* 在局部副本应用命令，失败不会污染运行配置。 */
    device_config_t candidate = s_device_config;
    /* Cmd11 使用同一配置规则，但后续不会持久化原始流位。 */
    const device_config_status_t apply_status = device_config_apply_command(&candidate, &command);
    /* 理论上解码后的命令必能应用；防御式拒绝内部组合漂移。 */
    if (apply_status != DEVICE_CONFIG_OK) {
        /* 返回设置语义错误。 */
        app_finish_ble_explicit(BLE_SERVICE_CONTROL_REJECTED, APP_BLE_ERROR_CONFIG_TLV);
        /* 命令已完成。 */
        return true;
    }
    /* Cmd11 只更新易失开关，断线、重启或关闭开发者模式立即清零。 */
    if (command.command_id == (uint8_t)DEVICE_COMMAND_SET_RAW_STREAM) {
        /* 保存运行配置视图。 */
        s_device_config.raw_stream_enabled = candidate.raw_stream_enabled;
        /* 发布任务只读取该易失门控。 */
        s_raw_stream_enabled = candidate.raw_stream_enabled;
        /* 返回成功，不执行 NVS commit。 */
        app_finish_ble_explicit(BLE_SERVICE_CONTROL_OK, BLE_SERVICE_ERROR_NONE);
        /* 命令已完成。 */
        return true;
    }
    /* 保存协调器旧副本；体重/目标若 NVS 失败可原子回滚且尚未扇出效果。 */
    const device_coordinator_t coordinator_before = s_coordinator;
    /* 保存可能由体重或目标更新生成的效果。 */
    device_effects_t effects;
    /* 默认无协调器副作用。 */
    bool coordinator_changed = false;
    /* 默认协调器状态成功。 */
    device_coordinator_status_t coordinator_status = DEVICE_COORDINATOR_OK;
    /* Cmd6 先写 RTC；写失败时不保存“已同步”配置。 */
    if (command.command_id == (uint8_t)DEVICE_COMMAND_SYNC_TIME) {
        /* PCF85063 接收 UTC Unix 秒，时区仅保存在配置供显示使用。 */
        if (board_pcf85063_write_unix(
                &s_sensors.rtc,
                command.value.sync_time.utc_unix_seconds) != BOARD_SENSORS_OK) {
            /* 返回硬件校时错误。 */
            app_finish_ble_explicit(BLE_SERVICE_CONTROL_INTERNAL_ERROR, APP_BLE_ERROR_RTC_WRITE);
            /* 命令已完成。 */
            return true;
        }
    } else if (command.command_id == (uint8_t)DEVICE_COMMAND_SET_USER_PROFILE) {
        /* 更新下次会话体重；正在运行的会话保持启动时体重。 */
        coordinator_status = device_coordinator_set_next_session_weight(
            &s_coordinator,
            candidate.weight_g,
            app_coordinator_time_ms(captured_ms),
            &effects);
        /* 标记成功后需在持久化成功时扇出。 */
        coordinator_changed = coordinator_status == DEVICE_COORDINATOR_OK;
    } else if (command.command_id == (uint8_t)DEVICE_COMMAND_SET_GOAL) {
        /* 更新目标并重算权威进度。 */
        coordinator_status = device_coordinator_set_goal(
            &s_coordinator,
            candidate.goal_kind,
            candidate.goal_value,
            app_coordinator_time_ms(captured_ms),
            &effects);
        /* 标记成功后需扇出 UI 与 LiveState。 */
        coordinator_changed = coordinator_status == DEVICE_COORDINATOR_OK;
    }
    /* 协调器拒绝时保持原配置并使用统一映射响应。 */
    if (coordinator_status != DEVICE_COORDINATOR_OK) {
        /* 恢复防御性旧副本，尽管协调器事务本身也保证失败不提交。 */
        s_coordinator = coordinator_before;
        /* 返回统一业务错误。 */
        app_finish_ble_command(coordinator_status);
        /* 命令已完成。 */
        return true;
    }
    /* Cmd9 关闭开发者模式时同时关闭易失 RawStream。 */
    if ((command.command_id == (uint8_t)DEVICE_COMMAND_SET_PREFERENCES) &&
        !candidate.developer_mode) {
        /* 清除候选中的易失位。 */
        candidate.raw_stream_enabled = false;
    }
    /* 先把候选完整写入 NVS，成功前不发布协调器效果或设备偏好。 */
    const esp_err_t persist_error = app_persist_device_config(&candidate);
    /* NVS 失败时恢复协调器，RTC 可能已校准但不会伪装为跨重启成功。 */
    if (persist_error != ESP_OK) {
        /* 回滚尚未向外发布的协调器副本。 */
        s_coordinator = coordinator_before;
        /* 记录 NVS 错误。 */
        ESP_LOGE(APP_TAG, "device config persist failed cmd=%u error=%s",
                 (unsigned int)command.command_id,
                 esp_err_to_name(persist_error));
        /* 返回内部持久化错误。 */
        app_finish_ble_explicit(BLE_SERVICE_CONTROL_INTERNAL_ERROR, APP_BLE_ERROR_CONFIG_PERSIST);
        /* 命令已完成。 */
        return true;
    }
    /* 持久化成功后提交运行配置。 */
    s_device_config = candidate;
    /* 同步易失 RawStream；Cmd9 仅可能在关闭开发者模式时把它清零。 */
    s_raw_stream_enabled = s_device_config.raw_stream_enabled && s_device_config.developer_mode;
    /* Cmd9 立即更新熄屏门槛和当前显示亮度。 */
    if (command.command_id == (uint8_t)DEVICE_COMMAND_SET_PREFERENCES) {
        /* 秒转毫秒；最大 600 秒安全落入 uint32。 */
        s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
        /* 关闭振动时清除尚未执行的排队波形；已经导通的 30 ms 脉冲自然结束。 */
        if (!s_device_config.haptic_enabled) {
            /* 清空待处理请求。 */
            (void)xQueueReset(s_haptic_queue);
        }
        /* 重新投递当前功耗策略，app_queue_power 会套用新亮度。 */
        const power_policy_t policy = power_manager_policy(&s_coordinator.power);
        /* 应用亮度与外设状态。 */
        app_queue_power(&policy, false);
        /* 把 PC 已确认持久化的真实偏好同步到设备设置/诊断页。 */
        app_project_device_config_to_ui(&s_coordinator.ui);
        /* 即使没有训练领域 effect，也立即刷新当前设备页面。 */
        app_queue_ui(&s_coordinator.ui);
    }
    /* 体重或目标的 effect 此时才允许对 UI/BLE 可见。 */
    if (coordinator_changed) {
        /* 扇出同一修订效果。 */
        app_dispatch_effects(&effects);
    }
    /* 返回成功。 */
    app_finish_ble_explicit(BLE_SERVICE_CONTROL_OK, BLE_SERVICE_ERROR_NONE);
    /* 命令已完成。 */
    return true;
}

