G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 应用任务处理 broker 中已复制的 BLE 控制命令。 */
static void app_process_ble_command(const uint64_t captured_ms)
{
    /* 每个已经通过 BLE 安全层和协议解析的控制命令都属于用户活动。 */
    power_idle_timer_note_activity(&s_power_idle_timer, captured_ms);
    /* START/RESUME 可能从黑屏 Home/Paused 发起，先原子恢复页面与功耗。 */
    if (((s_ble_command_slot.command_id == BLE_SERVICE_COMMAND_START_SESSION) ||
         (s_ble_command_slot.command_id == BLE_SERVICE_COMMAND_RESUME_SESSION)) &&
        (s_coordinator.ui.state == UI_STATE_SCREEN_OFF)) {
        /* 恢复熄屏前页面，保证随后统一控制状态合法。 */
        const device_coordinator_status_t wake_status = app_handle_idle_power_event(
            POWER_EVENT_USER_WAKE,
            captured_ms);
        /* 不能恢复时直接返回对应稳定业务状态，避免半执行训练控制。 */
        if (wake_status != DEVICE_COORDINATOR_OK) {
            /* 完成命令并唤醒等待中的 NimBLE handler。 */
            app_finish_ble_command(wake_status);
            /* 返回。 */
            return;
        }
    }
    /* 配置/校时/RawStream 命令由专用 TLV 事务处理，成功或失败都已发完成信号。 */
    if (app_process_device_config_command(captured_ms)) {
        /* 命令已完成。 */
        return;
    }
    /* 专用配置命令已在上方结束；这里只把会话命令 1~5/10 映射为协调器控制。 */
    device_control_t control;
    /* 不能映射的剩余编号属于未知或当前协议版本不支持的命令，必须明确拒绝。 */
    if (!device_coordinator_control_from_ble(s_ble_command_slot.command_id, &control)) {
        /* 返回无 TLV。 */
        s_ble_command_slot.result.tlv = NULL;
        /* 返回零长度。 */
        s_ble_command_slot.result.tlv_length = 0U;
        /* 当前状态修订不变。 */
        s_ble_command_slot.result.state_revision = s_coordinator.state_revision;
        /* 使用拒绝而不是伪装成功。 */
        s_ble_command_slot.result.status = BLE_SERVICE_CONTROL_REJECTED;
        /* 0x0203 表示该命令编号在当前固件协议版本中不受支持。 */
        s_ble_command_slot.result.error_code = UINT16_C(0x0203);
        /* 通知完成。 */
        (void)xSemaphoreGive(s_ble_command_done);
        /* 返回。 */
        return;
    }
    /* 保存效果。 */
    device_effects_t effects;
    /* 执行统一控制。 */
    const device_coordinator_status_t status = device_coordinator_handle_control(
        &s_coordinator,
        control,
        app_coordinator_time_ms(captured_ms),
        &effects);
    /* 成功时先提交所有副作用。 */
    if (status == DEVICE_COORDINATOR_OK) {
        /* BLE START/RESUME 与本机触摸遵守同一窗口隔离合同。 */
        if ((control == DEVICE_CONTROL_START) || (control == DEVICE_CONTROL_RESUME)) {
            /* 清空暂停前或上一会话留下的重采样点及 62 点推理窗口。 */
            imu_pipeline_reset_session(&s_imu_pipeline);
        }
        /* 扇出效果。 */
        app_dispatch_effects(&effects);
    }
    /* 填响应并通知 NimBLE。 */
    app_finish_ble_command(status);
}

/* NimBLE command handler：把命令同步 broker 到应用任务，自己不改业务状态。 */
static ble_service_status_t app_ble_command_handler(
    const ble_service_control_request_t *request,
    ble_service_command_result_t *result,
    void *context)
{
    /* 当前不使用 context。 */
    (void)context;
    /* 检查输入和同步对象。 */
    if ((request == NULL) || (result == NULL) ||
        (s_ble_command_mutex == NULL) || (s_ble_command_done == NULL)) {
        /* 返回 handler 错误。 */
        return BLE_SERVICE_STATUS_HANDLER_ERROR;
    }
    /* v1、TLV 长度和非空地址应由核心提前校验，这里再次保护跨组件边界。 */
    if ((request->command_version != 1U) ||
        (request->tlv_length > APP_BLE_COMMAND_MAX_TLV) ||
        ((request->tlv_length > 0U) && (request->tlv == NULL))) {
        /* 返回非法参数。 */
        return BLE_SERVICE_STATUS_INVALID_ARGUMENT;
    }
    /* 单连接串行取得 broker。 */
    if (xSemaphoreTake(s_ble_command_mutex, pdMS_TO_TICKS(APP_BLE_COMMAND_TIMEOUT_MS)) != pdTRUE) {
        /* 返回忙错误。 */
        return BLE_SERVICE_STATUS_HANDLER_ERROR;
    }
    /* 清理异常超时遗留的完成信号。 */
    (void)xSemaphoreTake(s_ble_command_done, 0U);
    /* 复制不借用请求视图的稳定字段。 */
    s_ble_command_slot.request_id = request->request_id;
    /* 复制命令。 */
    s_ble_command_slot.command_id = request->command_id;
    /* 复制版本。 */
    s_ble_command_slot.command_version = request->command_version;
    /* 保存 TLV 长度。 */
    s_ble_command_slot.tlv_length = request->tlv_length;
    /* 非空 TLV 深拷贝到静态 broker；应用队列延迟期间不再依赖 NimBLE mbuf。 */
    if (request->tlv_length > 0U) {
        /* 复制精确有效字节。 */
        (void)memcpy(
            s_ble_command_slot.tlv,
            request->tlv,
            request->tlv_length);
    }
    /* 清零旧响应。 */
    (void)memset(&s_ble_command_slot.result, 0, sizeof(s_ble_command_slot.result));
    /* 构造应用事件。 */
    const app_event_t event = {
        /* 标记 BLE 命令。 */
        .kind = APP_EVENT_BLE_COMMAND,
        /* 捕获当前单调时间。 */
        .monotonic_ms = app_now_ms(),
    };
    /* 应用队列满时释放 broker 并失败。 */
    if (xQueueSend(s_app_event_queue, &event, pdMS_TO_TICKS(50U)) != pdPASS) {
        /* 释放互斥锁。 */
        (void)xSemaphoreGive(s_ble_command_mutex);
        /* 返回失败。 */
        return BLE_SERVICE_STATUS_HANDLER_ERROR;
    }
    /* 等待应用任务完成事务。 */
    if (xSemaphoreTake(s_ble_command_done, pdMS_TO_TICKS(APP_BLE_COMMAND_TIMEOUT_MS)) != pdTRUE) {
        /* 释放互斥锁。 */
        (void)xSemaphoreGive(s_ble_command_mutex);
        /* 返回超时。 */
        return BLE_SERVICE_STATUS_HANDLER_ERROR;
    }
    /* 复制稳定结果；设置命令当前不返回可选 TLV。 */
    *result = s_ble_command_slot.result;
    /* 释放 broker。 */
    (void)xSemaphoreGive(s_ble_command_mutex);
    /* 返回服务处理成功，业务拒绝由 result.status 表达。 */
    return BLE_SERVICE_STATUS_OK;
}

/* 包装 session transfer handler，用双互斥保护存储快照和待发送页。 */
static ble_service_status_t app_transfer_handler(
    const uint8_t *request_payload,
    const uint16_t request_length,
    uint8_t *response_payload,
    const size_t response_capacity,
    uint16_t *response_length,
    void *context)
{
    /* 当前 context 应指向全局 transfer service。 */
    session_transfer_service_t *service = (session_transfer_service_t *)context;
    /* 取得存储锁，防止同时 upsert 改环形索引。 */
    if (xSemaphoreTake(s_session_store_mutex, pdMS_TO_TICKS(500U)) != pdTRUE) {
        /* 返回 handler 失败。 */
        return BLE_SERVICE_STATUS_HANDLER_ERROR;
    }
    /* 取得传输状态锁。 */
    if (xSemaphoreTake(s_session_transfer_mutex, pdMS_TO_TICKS(500U)) != pdTRUE) {
        /* 释放存储锁。 */
        (void)xSemaphoreGive(s_session_store_mutex);
        /* 返回失败。 */
        return BLE_SERVICE_STATUS_HANDLER_ERROR;
    }
    /* 在锁内冻结一页并生成响应。 */
    const ble_service_status_t status = session_transfer_service_handle_request(
        request_payload,
        request_length,
        response_payload,
        response_capacity,
        response_length,
        service);
    /* 释放传输锁。 */
    (void)xSemaphoreGive(s_session_transfer_mutex);
    /* 释放存储锁。 */
    (void)xSemaphoreGive(s_session_store_mutex);
    /* 返回原状态。 */
    return status;
}

/* LVGL 按钮回调：只投递命令，不阻塞 UI 任务。 */
static void app_ui_command_callback(void *context, const ui_command_t command)
{
    /* 当前不使用 context。 */
    (void)context;
    /* 两个分级隔离阶段都没有创建应用事件队列；即使用户触摸按钮也不能访问空句柄。 */
    if (APP_BENCH_DISPLAY_ONLY || APP_BENCH_SENSOR_ONLY || (s_app_event_queue == NULL)) {
        /* 丢弃隔离阶段交互命令；恢复产品启动链后由同一回调正常投递。 */
        return;
    }
    /* 构造事件。 */
    app_event_t event;
    /* 清零联合体。 */
    (void)memset(&event, 0, sizeof(event));
    /* 标记 UI 命令。 */
    event.kind = APP_EVENT_UI_COMMAND;
    /* 捕获触摸单调时间。 */
    event.monotonic_ms = app_now_ms();
    /* 保存命令。 */
    event.data.ui_command = command;
    /* 队列满时记录，不在 LVGL 回调等待。 */
    if (xQueueSend(s_app_event_queue, &event, 0U) != pdPASS) {
        /* 输出诊断。 */
        ESP_LOGW(APP_TAG, "UI command queue full command=%d", (int)command);
    }
}

/* BLE 连接回调：只投递连接事实。 */
static void app_ble_connection_changed(const bool connected, const uint16_t att_mtu, void *context)
{
    /* 当前不使用 context。 */
    (void)context;
    /* 构造事件。 */
    app_event_t event;
    /* 清零联合体。 */
    (void)memset(&event, 0, sizeof(event));
    /* 标记连接事件。 */
    event.kind = APP_EVENT_BLE_CONNECTION;
    /* 捕获时间。 */
    event.monotonic_ms = app_now_ms();
    /* 保存连接状态。 */
    event.data.ble_connected = connected;
    /* 投递失败只记录，GAP 回调不得阻塞。 */
    if (xQueueSend(s_app_event_queue, &event, 0U) != pdPASS) {
        /* 输出错误。 */
        ESP_LOGW(APP_TAG, "BLE connection queue full");
    }
    /* 输出协商 MTU 供诊断。 */
    ESP_LOGI(APP_TAG, "BLE connected=%d mtu=%u", connected ? 1 : 0, (unsigned int)att_mtu);
}

