G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 把配对邮箱更新提示投递到应用任务；队列满时每秒空闲事件仍会补取最新快照。 */
static void app_notify_pairing_mailbox(void)
{
    /* 应用队列尚未创建时不能投递；正常 BLE 启动严格晚于队列创建。 */
    if (s_app_event_queue == NULL) {
        /* 安全返回。 */
        return;
    }
    /* 构造无负载提示事件；真正敏感码只保存在原子邮箱，不复制进通用队列。 */
    const app_event_t event = {
        /* 标记配对邮箱有新快照。 */
        .kind = APP_EVENT_PAIRING_UPDATE,
        /* 捕获当前单调时间供日志排序。 */
        .monotonic_ms = app_now_ms(),
    };
    /* NimBLE 回调不得阻塞；队列满时丢提示但不丢邮箱中的最新状态。 */
    (void)xQueueSend(s_app_event_queue, &event, 0U);
}

/* 配对码回调：无阻塞发布六位码并唤醒应用任务显示中文覆盖层。 */
static void app_ble_passkey_display(const uint32_t passkey, void *context)
{
    /* context 必须指向启动前初始化且覆盖 BLE 生命周期的静态邮箱。 */
    ui_app_pairing_mailbox_t *const mailbox = (ui_app_pairing_mailbox_t *)context;
    /* 发布 0～999999 六位码；单调毫秒截取低 32 位并使用回绕安全超时比较。 */
    const ui_app_pairing_result_t status = ui_app_pairing_publish_code(
        mailbox,
        passkey,
        (uint32_t)app_now_ms());
    /* 六位补零只写串口诊断；LVGL 从邮箱数值独立格式化，不解析日志。 */
    ESP_LOGI(APP_TAG, "BLE passkey=%06lu", (unsigned long)passkey);
    /* 成功发布后提示应用任务立即消费。 */
    if (status == UI_APP_PAIRING_OK) {
        /* 非阻塞投递提示。 */
        app_notify_pairing_mailbox();
    } else {
        /* 邮箱忙或参数损坏时记录稳定状态，后续安全失败/断线仍会发布清除。 */
        ESP_LOGW(APP_TAG, "pairing code mailbox status=%d", (int)status);
    }
}

/* 把 NimBLE 清除原因映射为 UI 稳定原因并发布到同一原子邮箱。 */
static void app_ble_passkey_clear(
    const ble_service_pairing_clear_reason_t reason,
    void *context)
{
    /* context 与显示回调共享同一静态邮箱。 */
    ui_app_pairing_mailbox_t *const mailbox = (ui_app_pairing_mailbox_t *)context;
    /* 保存映射后的 UI 原因。 */
    ui_pairing_clear_reason_t ui_reason = UI_PAIRING_CLEAR_FAILED;
    /* 显式映射全部公开 BLE 枚举，禁止依赖两个枚举偶然具有相同数值。 */
    switch (reason) {
        /* 安全绑定完成。 */
        case BLE_SERVICE_PAIRING_CLEAR_SUCCESS:
            ui_reason = UI_PAIRING_CLEAR_SUCCESS;
            break;
        /* 安全握手或 IO 注入失败。 */
        case BLE_SERVICE_PAIRING_CLEAR_FAILED:
            ui_reason = UI_PAIRING_CLEAR_FAILED;
            break;
        /* 物理断线或主机复位。 */
        case BLE_SERVICE_PAIRING_CLEAR_DISCONNECTED:
            ui_reason = UI_PAIRING_CLEAR_DISCONNECTED;
            break;
        /* 用户显式忘记电脑。 */
        case BLE_SERVICE_PAIRING_CLEAR_FORGOTTEN:
            ui_reason = UI_PAIRING_CLEAR_FORGOTTEN;
            break;
        /* BLE 服务停止。 */
        case BLE_SERVICE_PAIRING_CLEAR_SERVICE_STOPPED:
            ui_reason = UI_PAIRING_CLEAR_SERVICE_STOPPED;
            break;
        /* 未知值按失败处理，并保留日志供版本漂移诊断。 */
        default:
            ESP_LOGW(APP_TAG, "unknown pairing clear reason=%d", (int)reason);
            break;
    }
    /* 发布清除事件并覆盖邮箱旧码，避免敏感值在成功或失败后残留。 */
    const ui_app_pairing_result_t status = ui_app_pairing_publish_clear(
        mailbox,
        ui_reason,
        (uint32_t)app_now_ms());
    /* 成功时提示应用任务尽快恢复底层业务页。 */
    if (status == UI_APP_PAIRING_OK) {
        /* 非阻塞投递提示。 */
        app_notify_pairing_mailbox();
    } else {
        /* 并发覆盖失败需要诊断；连接状态事件仍会在 UI 状态机中强制清码。 */
        ESP_LOGW(APP_TAG, "pairing clear mailbox status=%d", (int)status);
    }
}

/* 应用任务消费最新配对邮箱并更新唯一 UI 状态机。 */
static void app_drain_pairing_mailbox(void)
{
    /* 保存从原子邮箱复制出的无指针事件。 */
    ui_event_t pairing_event;
    /* 无新事件或发布正在进行时安全返回，后续空闲轮询会重试。 */
    if (!ui_app_pairing_try_take(&s_pairing_mailbox, &pairing_event)) {
        /* 当前没有稳定快照。 */
        return;
    }
    /* 显示配对码时确保黑屏设备恢复显示，否则用户无法输入六位码。 */
    if ((pairing_event.type == UI_EVENT_PAIRING_CODE_SHOWN) &&
        (s_coordinator.ui.state == UI_STATE_SCREEN_OFF)) {
        /* 复用统一唤醒事务；返回状态错误只表示其它来源已先唤醒。 */
        (void)app_handle_idle_power_event(
            POWER_EVENT_USER_WAKE,
            (uint64_t)pairing_event.monotonic_ms);
    }
    /* 配对属于用户连接活动，重新开始熄屏和长空闲计时。 */
    power_idle_timer_note_activity(
        &s_power_idle_timer,
        (uint64_t)pairing_event.monotonic_ms);
    /* 由应用任务独占更新 UI，避免 NimBLE 任务直接访问 LVGL 或协调器。 */
    const ui_dispatch_result_t status = ui_dispatch_event(
        &s_coordinator.ui,
        &pairing_event);
    /* 成功时投递完整页面快照。 */
    if (status == UI_DISPATCH_OK) {
        /* 渲染配对覆盖层或恢复底层页面。 */
        app_queue_ui(&s_coordinator.ui);
    } else {
        /* 范围错误表示跨组件合同损坏，需要串口诊断。 */
        ESP_LOGW(APP_TAG, "pairing UI event rejected status=%d", (int)status);
    }
}

/* 应用任务：唯一修改 pipeline 和 coordinator。 */
static void app_event_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 保存循环事件。 */
    app_event_t event;
    /* 永久消费队列。 */
    while (true) {
        /* 阻塞等待下一输入，空闲时允许 Light-sleep。 */
        if (xQueueReceive(s_app_event_queue, &event, portMAX_DELAY) != pdPASS) {
            /* 理论上不会失败，继续等待。 */
            continue;
        }
        /* 按事件类型串行处理。 */
        switch (event.kind) {
            /* 提交 QMI 帧。 */
            case APP_EVENT_QMI_FRAME:
                app_process_qmi_frame(&event.data.qmi_frame);
                break;
            /* 上报两路驱动丢样并清空连续窗。 */
            case APP_EVENT_QMI_DROP:
                (void)imu_pipeline_report_source_drop(&s_imu_pipeline, IMU_SOURCE_ACCEL, 1U);
                (void)imu_pipeline_report_source_drop(&s_imu_pipeline, IMU_SOURCE_GYRO, 1U);
                /* 驱动丢帧造成连续窗失效，同时清空动作段分类历史，避免跨缺口累计 logits。 */
                workout_engine_reset_bout_evidence(&s_coordinator.workout);
                break;
            /* 处理触摸命令。 */
            case APP_EVENT_UI_COMMAND:
                app_process_ui_command(event.data.ui_command, event.monotonic_ms);
                break;
            /* 处理同步 BLE 命令。 */
            case APP_EVENT_BLE_COMMAND:
                app_process_ble_command(event.monotonic_ms);
                break;
            /* 更新 BLE 连接、电源和 UI。 */
            case APP_EVENT_BLE_CONNECTION: {
                /* 断线立即关闭易失 RawStream，重连后必须由开发者再次显式授权。 */
                if (!event.data.ble_connected) {
                    /* 关闭 BLE 发布任务门控。 */
                    s_raw_stream_enabled = false;
                    /* 同步运行配置视图，但不写入 NVS。 */
                    s_device_config.raw_stream_enabled = false;
                }
                /* 保存效果。 */
                device_effects_t effects;
                /* 更新连接。 */
                const device_coordinator_status_t status = device_coordinator_set_ble_connected(
                    &s_coordinator,
                    event.data.ble_connected,
                    app_coordinator_time_ms(event.monotonic_ms),
                    &effects);
                /* 成功时扇出。 */
                if (status == DEVICE_COORDINATOR_OK) {
                    /* 扇出效果。 */
                    app_dispatch_effects(&effects);
                }
                break;
            }
            /* 消费 NimBLE 最新配对码或清除快照。 */
            case APP_EVENT_PAIRING_UPDATE:
                /* 原子邮箱保证多字段一致；应用任务是 UI 唯一写者。 */
                app_drain_pairing_mailbox();
                break;
            /* 更新电池并执行 15/8/5% 规则。 */
            case APP_EVENT_BATTERY: {
                /* 保存效果。 */
                device_effects_t effects;
                /* 更新电量。 */
                const device_coordinator_status_t status = device_coordinator_update_battery(
                    &s_coordinator,
                    event.data.battery.percent,
                    event.data.battery.charging,
                    app_coordinator_time_ms(event.monotonic_ms),
                    &effects);
                /* 同步标准 Battery 特征。 */
                (void)ble_service_nimble_set_battery_percent(event.data.battery.percent);
                /* 成功时扇出，5% 关机仍由存储确认授权。 */
                if (status == DEVICE_COORDINATOR_OK) {
                    /* 扇出效果。 */
                    app_dispatch_effects(&effects);
                }
                break;
            }
            /* 按马达真实导通时刻登记前后各 20 ms 的 IMU 污染区。 */
            case APP_EVENT_HAPTIC_STARTED:
                /* 应用任务是 imu_pipeline 唯一写者，因此这里不会与 QMI 窗口处理数据竞争。 */
                (void)imu_pipeline_mark_haptic_interval(
                    &s_imu_pipeline,
                    event.data.haptic_interval.start_us,
                    event.data.haptic_interval.end_us);
                /* 结束分支。 */
                break;
            /* 每秒检查一次尚未发出的熄屏或长空闲门槛。 */
            case APP_EVENT_IDLE_POLL: {
                /* 即使即时提示事件曾因队列满丢失，每秒也补取一次最新配对邮箱。 */
                app_drain_pairing_mailbox();
                /* 保存可能到期的六位码清除事件。 */
                ui_event_t pairing_timeout_event;
                /* 60 秒到期时在应用任务清除敏感码，不依赖 NimBLE 再产生事件。 */
                if (ui_app_pairing_build_timeout_event(
                        &s_coordinator.ui,
                        (uint32_t)event.monotonic_ms,
                        &pairing_timeout_event)) {
                    /* 分派超时清除事件。 */
                    const ui_dispatch_result_t pairing_status = ui_dispatch_event(
                        &s_coordinator.ui,
                        &pairing_timeout_event);
                    /* 成功后恢复底层业务页面。 */
                    if (pairing_status == UI_DISPATCH_OK) {
                        /* 配对超时本身算一次活动边界，避免同一轮立即触发熄屏。 */
                        power_idle_timer_note_activity(&s_power_idle_timer, event.monotonic_ms);
                        /* 投递恢复页。 */
                        app_queue_ui(&s_coordinator.ui);
                    }
                }
                /* 常亮功能联调版每秒只读检查 GAP 活动位；无连接且广播意外停止时按当前策略补启。 */
                if (APP_BENCH_ALWAYS_ON && !APP_BENCH_DISABLE_BLE) {
                    /* 调用不覆盖 OFF 策略、不打断现有连接，也不会在健康广播时重启射频。 */
                    const esp_err_t advertise_status = ble_service_nimble_ensure_advertising();
                    /* ESP_FAIL 表示主机已同步但补启仍失败；未同步或明确 OFF 的 INVALID_STATE 留待下一轮。 */
                    if (advertise_status == ESP_FAIL) {
                        /* 输出稳定 ESP-IDF 错误名，便于串口区分上位机扫描问题与控制器启动失败。 */
                        ESP_LOGE(APP_TAG, "BLE advertising keepalive failed=%s", esp_err_to_name(advertise_status));
                    }
                }
                /* 配对码显示期间禁止普通 15～120 秒熄屏，保证完整 60 秒输入机会。 */
                if (s_coordinator.ui.view.pairing_active) {
                    /* 结束本次空闲检查。 */
                    break;
                }
                /* 现场联调阶段禁用全部自动低功耗入口，保证用户能持续查看并操作测试页面。 */
                if (APP_BENCH_ALWAYS_ON) {
                    /* 不产生 SCREEN_TIMEOUT 或 LONG_IDLE，电源状态持续保持 HOME/RUNNING/PAUSED 的亮屏策略。 */
                    break;
                }
                /* 保存空闲时钟输出事件类型。 */
                power_event_type_t idle_event_type = POWER_EVENT_SCREEN_TIMEOUT;
                /* 有准备、运行或暂停会话时只允许熄屏，不允许长空闲 Deep-sleep。 */
                const bool session_active = s_coordinator.power.session_active;
                /* 纯计时器只在首次跨过对应门槛时返回 true。 */
                if (power_idle_timer_poll(
                        &s_power_idle_timer,
                        event.monotonic_ms,
                        s_screen_timeout_ms,
                        APP_LONG_IDLE_MS,
                        session_active,
                        &idle_event_type)) {
                    /* 通过协调器原子提交 UI 与电源变化。 */
                    const device_coordinator_status_t idle_status = app_handle_idle_power_event(
                        idle_event_type,
                        event.monotonic_ms);
                    /* 页面或功耗已不接受该事件时只记录调试信息，计时器不会每秒重发。 */
                    if ((idle_status != DEVICE_COORDINATOR_OK) &&
                        (idle_status != DEVICE_COORDINATOR_ERR_STATE)) {
                        /* 输出异常状态。 */
                        ESP_LOGW(APP_TAG, "idle event=%d rejected status=%d",
                                 (int)idle_event_type,
                                 (int)idle_status);
                    }
                }
                /* 结束分支。 */
                break;
            }
            /* 关键摘要刷盘成功后授权 PMIC。 */
            case APP_EVENT_STORAGE_RESULT:
                if (event.data.storage_result.authorize_shutdown) {
                    /* 成功才授权，失败保持安全关机页但继续供电。 */
                    if (event.data.storage_result.success) {
                        /* 使用当前安全关机策略。 */
                        const power_policy_t policy = power_manager_policy(&s_coordinator.power);
                        /* 授权 PMIC。 */
                        app_queue_power(&policy, true);
                    } else {
                        /* 明确拒绝断电。 */
                        ESP_LOGE(APP_TAG, "summary persist failed; PMIC shutdown blocked");
                    }
                }
                break;
            /* 未知枚举不修改状态。 */
            default:
                ESP_LOGE(APP_TAG, "unknown app event=%d", (int)event.kind);
                break;
        }
    }
}

/* QMI 任务：读取芯片并按值投递，不调用 pipeline。 */
static void app_qmi_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 标记是否需在下一帧前上报丢样。 */
    bool drop_pending = false;
    /* 永久轮询。 */
    while (true) {
        /* 非训练状态不访问 QMI 数据寄存器。 */
        if (!s_sensors.qmi_sampling_enabled) {
            /* 20 ms 检查一次状态，Home 功耗由后续实机测量。 */
            vTaskDelay(pdMS_TO_TICKS(20U));
            /* 继续。 */
            continue;
        }
        /* 先补交上次队列溢出事实。 */
        if (drop_pending) {
            /* 构造丢样事件。 */
            const app_event_t drop_event = {
                /* 标记丢样。 */
                .kind = APP_EVENT_QMI_DROP,
                /* 捕获时间。 */
                .monotonic_ms = app_now_ms(),
            };
            /* 成功后解除待上报。 */
            if (xQueueSend(s_app_event_queue, &drop_event, 0U) == pdPASS) {
                /* 清除待上报。 */
                drop_pending = false;
            }
        }
        /* 等待 QMI 专用锁，防止数据读取与 ACTIVE/WOM/OFF 寄存器事务交叉。 */
        if (xSemaphoreTake(s_sensors.qmi_mutex, portMAX_DELAY) != pdTRUE) {
            /* FreeRTOS 异常时记录一次数据不连续。 */
            drop_pending = true;
            /* 短暂退避，避免不可用互斥锁导致忙等。 */
            vTaskDelay(pdMS_TO_TICKS(10U));
            /* 继续下一轮。 */
            continue;
        }
        /* 锁内再次检查采样门控，关闭方可能已在等锁期间切换模式。 */
        if (!s_sensors.qmi_sampling_enabled) {
            /* 释放 QMI 独占锁，允许电源任务继续完成模式切换。 */
            (void)xSemaphoreGive(s_sensors.qmi_mutex);
            /* 20 ms 后再检查 ACTIVE 状态。 */
            vTaskDelay(pdMS_TO_TICKS(20U));
            /* 不访问 WOM/OFF 模式的数据寄存器。 */
            continue;
        }
        /* 保存一帧六轴定点数据和同一总线时戳。 */
        board_qmi8658_frame_t frame;
        /* 使用读取前单调时刻作为本次总线帧时间。 */
        const board_sensors_result_t status = board_qmi8658_read_available(
            &s_sensors.qmi,
            app_now_us(),
            &frame);
        /* 一次 I2C 读取已结束，在任何结果分支前释放 QMI 专用锁。 */
        (void)xSemaphoreGive(s_sensors.qmi_mutex);
        /* I2C 错误或驱动状态错误上报丢样并退避。 */
        if (status != BOARD_SENSORS_OK) {
            /* 标记丢样待应用任务重置。 */
            drop_pending = true;
            /* 10 ms 退避避免坏设备占满 I2C。 */
            vTaskDelay(pdMS_TO_TICKS(10U));
            /* 继续。 */
            continue;
        }
        /* 没有新轴时只等待下一轮。 */
        if (!frame.accel_available && !frame.gyro_available) {
            /* 按 4 ms 轮询。 */
            vTaskDelay(pdMS_TO_TICKS(APP_QMI_POLL_MS));
            /* 继续。 */
            continue;
        }
        /* 构造按值事件。 */
        app_event_t event;
        /* 清零。 */
        (void)memset(&event, 0, sizeof(event));
        /* 标记 QMI 帧。 */
        event.kind = APP_EVENT_QMI_FRAME;
        /* 保存同一帧毫秒时间。 */
        event.monotonic_ms = frame.timestamp_us / UINT64_C(1000);
        /* 复制原始帧。 */
        event.data.qmi_frame = frame;
        /* 队列满则丢弃本帧，并在恢复后上报连续性断裂。 */
        if (xQueueSend(s_app_event_queue, &event, 0U) != pdPASS) {
            /* 标记待上报。 */
            drop_pending = true;
        }
        /* 等待下一 DATA_READY。 */
        vTaskDelay(pdMS_TO_TICKS(APP_QMI_POLL_MS));
    }
}

/* 电池任务：30 秒读取一次 PMIC。 */
static void app_battery_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 永久轮询。 */
    while (true) {
        /* 读取同一 PMIC 快照。 */
        uint8_t percent = UINT8_MAX;
        /* 保存充电状态。 */
        bool charging = false;
        /* 通过 runtime 回调读取。 */
        if (board_adapter_read_battery(
                board_runtime_adapter(&s_board_runtime),
                &percent,
                &charging) == BOARD_ADAPTER_OK) {
            /* 构造电池事件。 */
            app_event_t event;
            /* 清零。 */
            (void)memset(&event, 0, sizeof(event));
            /* 标记电池。 */
            event.kind = APP_EVENT_BATTERY;
            /* 捕获时间。 */
            event.monotonic_ms = app_now_ms();
            /* 写百分比。 */
            event.data.battery.percent = percent;
            /* 写充电状态。 */
            event.data.battery.charging = charging;
            /* 最多等待 100 ms，避免静默跳过 5% 门槛。 */
            if (xQueueSend(s_app_event_queue, &event, pdMS_TO_TICKS(100U)) != pdPASS) {
                /* 输出错误。 */
                ESP_LOGE(APP_TAG, "battery event queue full");
            }
        } else {
            /* PMIC 读取失败保留上一可信值。 */
            ESP_LOGW(APP_TAG, "AXP2101 battery read failed");
        }
        /* 等待 30 秒。 */
        vTaskDelay(pdMS_TO_TICKS(APP_BATTERY_POLL_MS));
    }
}

/* 空闲任务：只投递单调时钟采样，所有状态变化仍由 app_event_task 串行完成。 */
static void app_idle_task(void *argument)
{
    /* 当前不使用任务参数。 */
    (void)argument;
    /* 永久每秒采样一次。 */
    while (true) {
        /* 先等待完整周期，启动渲染不会被立即误判为空闲。 */
        vTaskDelay(pdMS_TO_TICKS(APP_IDLE_POLL_MS));
        /* 构造无联合体负载的空闲查询事件。 */
        const app_event_t event = {
            /* 标记空闲轮询。 */
            .kind = APP_EVENT_IDLE_POLL,
            /* 捕获当前单调毫秒。 */
            .monotonic_ms = app_now_ms(),
        };
        /* 队列短时满时丢弃本轮；下一秒仍会重试且计时基准不丢失。 */
        if (xQueueSend(s_app_event_queue, &event, 0U) != pdPASS) {
            /* 使用调试日志避免 QMI 突发期间每秒刷警告。 */
            ESP_LOGD(APP_TAG, "idle poll queue full");
        }
    }
}

/* UI 任务：只调用 renderer，所有 LVGL API 在 BSP 锁内。 */
static void app_ui_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 保存页面快照。 */
    ui_context_t ui;
    /* 标记 ui 已收到第一份长期快照，避免读取未初始化栈内容。 */
    bool has_snapshot = false;
    /* 永久等待最新页面。 */
    while (true) {
        /* PREPARE 每 100 ms 醒一次以推进 3-2-1；其它页面永久等待事件，减少 CPU 唤醒。 */
        const TickType_t wait_ticks = has_snapshot && (ui.state == UI_STATE_PREPARE)
            ? pdMS_TO_TICKS(100U)
            : portMAX_DELAY;
        /* 标记本轮是否收到领域层新快照。 */
        const bool received = xQueueReceive(s_ui_queue, &ui, wait_ticks) == pdPASS;
        /* 新快照使局部页面内容有效。 */
        if (received) {
            /* 保存初始化事实。 */
            has_snapshot = true;
        }
        /* 默认只有新快照需要重绘。 */
        bool should_render = received;
        /* PREPARE 的倒计时只修改 UI 任务私有副本，不跨线程写 coordinator。 */
        if (has_snapshot && (ui.state == UI_STATE_PREPARE)) {
            /* 按状态进入时刻和当前单调低 32 位计算 3、2、1、0。 */
            const uint8_t remaining = ui_prepare_countdown_seconds(
                ui.state_entered_ms,
                (uint32_t)app_now_ms());
            /* 只有数字变化才重绘，避免 AMOLED 每 100 ms 无效刷新。 */
            if (remaining != ui.view.prepare_countdown_seconds) {
                /* 更新私有显示字段；领域会话不读取该副本。 */
                ui.view.prepare_countdown_seconds = remaining;
                /* 请求本轮刷新。 */
                should_render = true;
            }
        }
        /* 有新事实或倒计时变化时渲染。 */
        if (should_render) {
            /* 渲染失败只记录，业务状态仍保持。 */
            const ui_lvgl_result_t status = ui_lvgl_renderer_render(&s_ui_renderer, &ui);
            /* 输出错误。 */
            if (status != UI_LVGL_OK) {
                /* 记录错误。 */
                ESP_LOGE(APP_TAG, "LVGL render failed=%d", (int)status);
            }
        }
    }
}

