G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* BLE 任务：发布状态/事件，并在响应后泵送冻结会话页。 */
static void app_ble_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 保存输出消息。 */
    app_ble_output_t output;
    /* 保存已从传输服务取出、但尚未成功排入 NimBLE notification 的稳定数据块。 */
    uint8_t pending_transfer_payload[SESSION_TRANSFER_DATA_SIZE];
    /* 保存 pending_transfer_payload 的有效长度。 */
    size_t pending_transfer_length = 0U;
    /* 标记是否存在需重试的同一数据块，发送失败时禁止继续 pop 下一项。 */
    bool transfer_payload_pending = false;
    /* 首次 BLE 健康检查延后 1 秒，允许 app_main 完成 NimBLE 异步主机启动。 */
    uint64_t next_ble_health_ms = app_now_ms() + UINT64_C(1000);
    /* 每五次一秒检查输出一次状态，兼顾可观测性与串口噪声。 */
    uint8_t ble_health_log_divider = 0U;
    /* 永久运行。 */
    while (true) {
        /* 常亮功能联调版由独立 BLE 任务保活，避免 125 Hz IMU 队列挤掉 IDLE_POLL 后失去检查机会。 */
        const uint64_t now_ms = app_now_ms();
        /* 单调时钟达到下一秒门槛且 BLE 未被编译期隔离时执行一次检查。 */
        if (APP_BENCH_ALWAYS_ON && !APP_BENCH_DISABLE_BLE && (now_ms >= next_ble_health_ms)) {
            /* 下一检查从当前时刻顺延 1 秒；任务短暂阻塞不会连续补跑旧周期。 */
            next_ble_health_ms = now_ms + UINT64_C(1000);
            /* 保存启动、同步、广播、连接和射频模式快照。 */
            ble_service_nimble_runtime_status_t runtime_status;
            /* 先尝试恢复异常停止的广播；健康广播和现有连接不会被重启。 */
            const esp_err_t ensure_status = ble_service_nimble_ensure_advertising();
            /* 恢复调用后读取最终状态，日志反映本轮结束事实。 */
            const esp_err_t snapshot_status = ble_service_nimble_get_runtime_status(&runtime_status);
            /* 每五秒输出一次；uint8 只在 0～4 循环，不存在溢出风险。 */
            ble_health_log_divider = (uint8_t)((ble_health_log_divider + UINT8_C(1)) % UINT8_C(5));
            /* 快照读取失败属于编程错误；正常路径按固定间隔输出全部生命周期位。 */
            if (snapshot_status != ESP_OK) {
                /* 记录空指针或未来 API 错误，当前静态对象不应进入该路径。 */
                ESP_LOGE(APP_TAG, "BLE runtime snapshot failed=%s", esp_err_to_name(snapshot_status));
            } else if (ble_health_log_divider == 0U) {
                /* 输出可由串口脚本解析的稳定键值，不包含密钥、地址或用户数据。 */
                ESP_LOGI(
                    APP_TAG,
                    "BLE_STATUS started=%d synced=%d advertising=%d physical=%d secure=%d mode=%d ensure=%s",
                    runtime_status.started ? 1 : 0,
                    runtime_status.host_synced ? 1 : 0,
                    runtime_status.advertising ? 1 : 0,
                    runtime_status.physical_connection ? 1 : 0,
                    runtime_status.secure_connection ? 1 : 0,
                    (int)runtime_status.power_mode,
                    esp_err_to_name(ensure_status));
            }
        }
        /* 最多等待 100 ms，使会话传输有固定泵送机会。 */
        if (xQueueReceive(s_ble_queue, &output, pdMS_TO_TICKS(APP_TRANSFER_PUMP_MS)) == pdPASS) {
            /* 发布 LiveState。 */
            if (output.kind == APP_BLE_OUTPUT_LIVE_STATE) {
                /* 忽略未连接的无订阅错误。 */
                (void)ble_service_nimble_publish_live_state(&output.live_state);
            } else if (output.kind == APP_BLE_OUTPUT_EVENT) {
                /* 发布 EventV1 payload。 */
                (void)ble_service_nimble_publish_event(output.event_payload, output.event_length);
            } else if ((output.kind == APP_BLE_OUTPUT_RAW_STREAM) && s_raw_stream_enabled) {
                /* 仅在易失开关仍开启时发布；关闭后排队的旧帧会被静默丢弃。 */
                (void)ble_service_nimble_publish_raw_stream(output.raw_payload, output.raw_length);
            }
        }
        /* 未连接时不消费 transfer 页，保留给 PC 重试。 */
        if (!ble_service_nimble_is_connected()) {
            /* 断线后丢弃本地已 pop 副本；PC 重连会用游标重新发 TransferRequest 冻结同一页。 */
            transfer_payload_pending = false;
            /* 清零长度，避免诊断误读旧缓存。 */
            pending_transfer_length = 0U;
            /* 继续等待。 */
            continue;
        }
        /* TransferResponse 的全部 indication 分片必须先由 PC 确认，随后才能发送对应 TransferData。 */
        if (ble_service_nimble_reliable_response_pending()) {
            /* 等下一次 100 ms 泵送机会，不提前消费会话页。 */
            continue;
        }
        /* 没有待重试数据时，才从冻结传输页取出下一条。 */
        if (!transfer_payload_pending) {
            /* 取得 transfer 锁，避免与独立 BLE 业务任务冻结新页并发修改游标。 */
            if (xSemaphoreTake(s_session_transfer_mutex, pdMS_TO_TICKS(20U)) == pdTRUE) {
                /* 取出一条冻结数据并保存到跨循环稳定缓存。 */
                transfer_payload_pending = session_transfer_service_pop_data(
                    &s_session_transfer,
                    pending_transfer_payload,
                    sizeof(pending_transfer_payload),
                    &pending_transfer_length);
                /* 释放锁。 */
                (void)xSemaphoreGive(s_session_transfer_mutex);
            }
        }
        /* 存在数据时尝试发布；本地排队失败保留完全相同 payload 下轮重试。 */
        if (transfer_payload_pending) {
            /* 检查长度后发送。 */
            const esp_err_t error = ble_service_nimble_publish_transfer_data(
                pending_transfer_payload,
                (uint16_t)pending_transfer_length);
            /* 成功排入 NimBLE 后才允许读取下一条；无线 notification 丢失仍由 PC 游标重试恢复。 */
            if (error == ESP_OK) {
                /* 清除待重试标志。 */
                transfer_payload_pending = false;
                /* 清零长度。 */
                pending_transfer_length = 0U;
            }
            /* 本地发送失败保留同一缓存，不前移传输服务第二次。 */
            if (error != ESP_OK) {
                /* 记录错误。 */
                ESP_LOGW(APP_TAG, "transfer data publish failed=%s", esp_err_to_name(error));
            }
        }
    }
}

/* 存储任务：唯一写 session_store；每次 upsert 内含双槽 sync。 */
static void app_storage_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 保存事务。 */
    app_storage_request_t request;
    /* 永久处理。 */
    while (true) {
        /* 阻塞等待摘要。 */
        if (xQueueReceive(s_storage_queue, &request, portMAX_DELAY) != pdPASS) {
            /* 继续等待。 */
            continue;
        }
        /* 取得仓储锁。 */
        bool success = false;
        /* 最多等待 2 秒，关机事务不能无限卡死。 */
        if (xSemaphoreTake(s_session_store_mutex, pdMS_TO_TICKS(2000U)) == pdTRUE) {
            /* 保存是否实际改变；重复 event_seq 不写 Flash。 */
            bool changed = false;
            /* 执行幂等 upsert 和双槽同步。 */
            success = session_store_upsert(&s_session_store, &request.summary, &changed) ==
                      SESSION_STORE_STATUS_OK;
            /* 释放锁。 */
            (void)xSemaphoreGive(s_session_store_mutex);
        }
        /* 输出写入结果。 */
        if (!success) {
            /* 记录失败。 */
            ESP_LOGE(APP_TAG, "session persist failed seq=%lu", (unsigned long)request.summary.session_seq);
        }
        /* 只有关机事务需要回应用任务授权。 */
        if (request.shutdown_after_persist) {
            /* 构造确认。 */
            app_event_t event;
            /* 清零。 */
            (void)memset(&event, 0, sizeof(event));
            /* 标记存储结果。 */
            event.kind = APP_EVENT_STORAGE_RESULT;
            /* 捕获完成时间。 */
            event.monotonic_ms = app_now_ms();
            /* 保存成功。 */
            event.data.storage_result.success = success;
            /* 保存关机授权意图。 */
            event.data.storage_result.authorize_shutdown = true;
            /* 等待送达，避免关键确认丢失。 */
            (void)xQueueSend(s_app_event_queue, &event, portMAX_DELAY);
        }
    }
}

