G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 振动任务：按领域波形调用 GPIO18 非阻塞 PWM，并在脉冲间让出 CPU。 */
static void app_haptic_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 保存振动请求。 */
    fitness_haptic_request_t request;
    /* 永久处理。 */
    while (true) {
        /* 等待下一请求。 */
        if (xQueueReceive(s_haptic_queue, &request, portMAX_DELAY) != pdPASS) {
            /* 继续。 */
            continue;
        }
        /* 遍历 1~3 个脉冲。 */
        for (uint8_t repeat = 0U; repeat < request.repeat_count; ++repeat) {
            /* 在真正调用板级 PWM 前立即捕获单调起点，排队等待时间不计入污染区。 */
            const uint64_t pulse_start_us = app_now_us();
            /* 通过板级适配器启动一次 PWM 脉冲。 */
            const board_adapter_result_t status = board_adapter_pulse_haptic(
                board_runtime_adapter(&s_board_runtime),
                request.on_ms,
                APP_HAPTIC_INTENSITY_PERCENT);
            /* 失败时停止当前波形。 */
            if (status != BOARD_ADAPTER_OK) {
                /* 输出错误。 */
                ESP_LOGE(APP_TAG, "motor pulse failed=%d", (int)status);
                /* 退出重复循环。 */
                break;
            }
            /* 构造已实际启动的马达区间事件；计划终点由硬件定时脉宽换算，单位微秒。 */
            app_event_t haptic_event;
            /* 清零联合体及保留字段。 */
            (void)memset(&haptic_event, 0, sizeof(haptic_event));
            /* 标记马达已启动。 */
            haptic_event.kind = APP_EVENT_HAPTIC_STARTED;
            /* 保存同一事件的毫秒时间供统一诊断。 */
            haptic_event.monotonic_ms = pulse_start_us / UINT64_C(1000);
            /* 保存真实 PWM 启动前的单调微秒时刻。 */
            haptic_event.data.haptic_interval.start_us = pulse_start_us;
            /* on_ms 最大很小，乘 1000 不会接近 uint64 上限。 */
            haptic_event.data.haptic_interval.end_us =
                pulse_start_us + (uint64_t)request.on_ms * UINT64_C(1000);
            /* 插入应用队列前端，使污染登记先于随后到达的 QMI 帧处理。 */
            if (xQueueSendToFront(s_app_event_queue, &haptic_event, pdMS_TO_TICKS(10U)) != pdPASS) {
                /* 队列异常满时记录；不得在马达任务无限等待。 */
                ESP_LOGE(APP_TAG, "haptic contamination event queue full");
            }
            /* 等待本次导通结束；真实关断由 esp_timer 完成。 */
            vTaskDelay(pdMS_TO_TICKS(request.on_ms));
            /* 非最后脉冲等待关闭间隔。 */
            if ((repeat + 1U < request.repeat_count) && (request.off_ms > 0U)) {
                /* 等待关闭间隔。 */
                vTaskDelay(pdMS_TO_TICKS(request.off_ms));
            }
        }
    }
}

/* 为自动 Light-sleep 安装 GPIO38 触摸和 GPIO39 RTC 的低电平唤醒源。 */
static bool app_configure_light_sleep_wake(const power_policy_t *policy)
{
    /* 策略指针为空时无法决定应启用哪个唤醒源。 */
    if (policy == NULL) {
        /* 返回失败，上层将禁用本次自动 Light-sleep。 */
        return false;
    }
    /* 取得已探测板型的真实引脚表，避免在主程序重复硬编码。 */
    board_adapter_t *const adapter = board_runtime_adapter(&s_board_runtime);
    /* 板级运行时未初始化时不允许进入不可验证的睡眠状态。 */
    if (adapter == NULL) {
        /* 返回失败。 */
        return false;
    }
    /* 先移除上一份策略的触摸 GPIO 唤醒，防止状态切换后残留旧源。 */
    const esp_err_t touch_disable_error = gpio_wakeup_disable(
        (gpio_num_t)adapter->profile.touch_interrupt_gpio);
    /* 除了“本来未启用”，其它 GPIO 关闭错误需记录供真机追踪。 */
    if ((touch_disable_error != ESP_OK) && (touch_disable_error != ESP_ERR_INVALID_STATE)) {
        /* 输出触摸引脚和 ESP-IDF 错误名称。 */
        ESP_LOGW(
            APP_TAG,
            "touch GPIO wake disable failed gpio=%u error=%s",
            (unsigned int)adapter->profile.touch_interrupt_gpio,
            esp_err_to_name(touch_disable_error));
    }
    /* 移除上一份策略的 RTC GPIO 唤醒。 */
    const esp_err_t rtc_disable_error = gpio_wakeup_disable(
        (gpio_num_t)adapter->profile.rtc_interrupt_gpio);
    /* 仅忽略源未启用的正常状态。 */
    if ((rtc_disable_error != ESP_OK) && (rtc_disable_error != ESP_ERR_INVALID_STATE)) {
        /* 记录本地 RTC 唤醒源关闭失败。 */
        ESP_LOGW(
            APP_TAG,
            "RTC GPIO wake disable failed gpio=%u error=%s",
            (unsigned int)adapter->profile.rtc_interrupt_gpio,
            esp_err_to_name(rtc_disable_error));
    }
    /* 禁用 ESP 睡眠层的 GPIO 唤醒聚合源，后面按新策略重建。 */
    const esp_err_t source_disable_error = esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_GPIO);
    /* 未启用该源会返回 INVALID_STATE，属于首次配置正常情况。 */
    if ((source_disable_error != ESP_OK) && (source_disable_error != ESP_ERR_INVALID_STATE)) {
        /* 无法清理旧源时禁用自动 Light-sleep，避免未知唤醒路径。 */
        ESP_LOGE(
            APP_TAG,
            "Light-sleep GPIO source reset failed=%s",
            esp_err_to_name(source_disable_error));
        /* 返回失败。 */
        return false;
    }
    /* 策略不需要自动 Light-sleep 时，保持 GPIO 唤醒源关闭即可。 */
    if (!policy->automatic_light_sleep) {
        /* 返回配置成功。 */
        return true;
    }
    /* 记录是否至少启用了一个板级 GPIO 唤醒源。 */
    bool gpio_source_enabled = false;
    /* 触摸 INT 在本板为 GPIO38 低有效，只能用数字 GPIO Light-sleep 唤醒。 */
    if (policy->enable_touch_light_wake) {
        /* 配置触摸 INT 低电平唤醒。 */
        const esp_err_t touch_enable_error = gpio_wakeup_enable(
            (gpio_num_t)adapter->profile.touch_interrupt_gpio,
            GPIO_INTR_LOW_LEVEL);
        /* 引脚不支持或驱动配置失败时不启用自动 Light-sleep。 */
        if (touch_enable_error != ESP_OK) {
            /* 记录实际引脚和错误。 */
            ESP_LOGE(
                APP_TAG,
                "touch Light-sleep wake enable failed gpio=%u error=%s",
                (unsigned int)adapter->profile.touch_interrupt_gpio,
                esp_err_to_name(touch_enable_error));
            /* 返回失败。 */
            return false;
        }
        /* 标记已有一个有效 GPIO 源。 */
        gpio_source_enabled = true;
    }
    /* PCF85063 INT 在本板为 GPIO39 低有效，只用于 Light-sleep。 */
    if (policy->enable_rtc_light_wake) {
        /* 配置 RTC 低电平唤醒。 */
        const esp_err_t rtc_enable_error = gpio_wakeup_enable(
            (gpio_num_t)adapter->profile.rtc_interrupt_gpio,
            GPIO_INTR_LOW_LEVEL);
        /* 任一要求的唤醒源失败都禁用本次自动 Light-sleep。 */
        if (rtc_enable_error != ESP_OK) {
            /* 记录 RTC 引脚和错误。 */
            ESP_LOGE(
                APP_TAG,
                "RTC Light-sleep wake enable failed gpio=%u error=%s",
                (unsigned int)adapter->profile.rtc_interrupt_gpio,
                esp_err_to_name(rtc_enable_error));
            /* 返回失败。 */
            return false;
        }
        /* 标记已有有效 GPIO 源。 */
        gpio_source_enabled = true;
    }
    /* 策略可能只依赖 FreeRTOS 定时器唤醒；没有 GPIO 源时不需启用 GPIO 聚合源。 */
    if (!gpio_source_enabled) {
        /* 自动 Light-sleep 仍可由最近的 RTOS 定时器唤醒。 */
        return true;
    }
    /* 通知 ESP 睡眠层把上述数字 GPIO 中断纳入 Light-sleep 唤醒条件。 */
    const esp_err_t gpio_source_error = esp_sleep_enable_gpio_wakeup();
    /* 聚合源启用失败时拒绝自动 Light-sleep。 */
    if (gpio_source_error != ESP_OK) {
        /* 记录 ESP-IDF 错误。 */
        ESP_LOGE(
            APP_TAG,
            "Light-sleep GPIO source enable failed=%s",
            esp_err_to_name(gpio_source_error));
        /* 返回失败。 */
        return false;
    }
    /* 返回配置成功。 */
    return true;
}

/* 检查 QMI WOM 全链路并为 GPIO21 安装 Deep-sleep EXT1 高电平唤醒。 */
static bool app_prepare_deep_sleep_wake(
    const power_policy_t *policy,
    const bool wom_configured)
{
    /* 策略指针为空时绝不允许进入 Deep-sleep。 */
    if (policy == NULL) {
        /* 返回失败。 */
        return false;
    }
    /* 取得已初始化的板级配置。 */
    board_adapter_t *const adapter = board_runtime_adapter(&s_board_runtime);
    /* 板型不可用时无法验证 GPIO21 是否为 RTC IO。 */
    if (adapter == NULL) {
        /* 返回失败。 */
        return false;
    }
    /* 同时检查产品策略、编译开关、QMI 探测、RTC IO 范围和 WOM 寄存器结果。 */
    if (!board_runtime_qmi_deep_wake_ready(
            &s_board_runtime,
            policy->enable_imu_deep_wake,
            wom_configured)) {
        /* 任一先决条件缺失时拒绝无唤醒源 Deep-sleep。 */
        return false;
    }
    /* 清除 Light-sleep GPIO 等旧唤醒源，Deep-sleep 只保留经验证的 QMI INT1。 */
    const esp_err_t disable_error = esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
    /* ALL 清理失败表示唤醒状态不可预测，必须拒绝睡眠。 */
    if (disable_error != ESP_OK) {
        /* 记录错误名称。 */
        ESP_LOGE(APP_TAG, "Deep-sleep wake reset failed=%s", esp_err_to_name(disable_error));
        /* 返回失败。 */
        return false;
    }
    /* 把 GPIO21 编码为 64 位 EXT1 位图；运行时门控已保证引脚不超过 21。 */
    const uint64_t imu_wake_mask = UINT64_C(1) << adapter->profile.imu_interrupt_gpio;
    /* QMI WOM 输出动作高电平，ESP32-S3 EXT1 使用 ANY_HIGH 唤醒。 */
    const esp_err_t ext1_error = esp_sleep_enable_ext1_wakeup_io(
        imu_wake_mask,
        ESP_EXT1_WAKEUP_ANY_HIGH);
    /* 引脚不是 RTC IO 或 EXT1 配置冲突时不能进入 Deep-sleep。 */
    if (ext1_error != ESP_OK) {
        /* 记录引脚、位图和 ESP-IDF 错误。 */
        ESP_LOGE(
            APP_TAG,
            "QMI EXT1 wake enable failed gpio=%u mask=0x%llX error=%s",
            (unsigned int)adapter->profile.imu_interrupt_gpio,
            (unsigned long long)imu_wake_mask,
            esp_err_to_name(ext1_error));
        /* 返回失败。 */
        return false;
    }
    /* 返回唤醒源已完整安装。 */
    return true;
}

/* 把纯电源领域 BLE 策略逐项映射到 NimBLE 适配层，避免两个组件共享枚举数值假设。 */
static ble_service_nimble_power_mode_t app_map_ble_power_mode(const power_ble_mode_t mode)
{
    /* 按领域枚举显式选择射频模式；未知值使用关闭策略。 */
    switch (mode) {
        /* Deep-sleep 与安全关机前停止广播或连接。 */
        case POWER_BLE_OFF:
            /* 返回 NimBLE 关闭枚举。 */
            return BLE_SERVICE_NIMBLE_POWER_OFF;
        /* 主页和亮屏训练使用快速广播。 */
        case POWER_BLE_FAST_ADVERTISING:
            /* 返回 100～150 ms 广播模式。 */
            return BLE_SERVICE_NIMBLE_POWER_FAST_ADVERTISING;
        /* 熄屏无连接待机使用慢广播。 */
        case POWER_BLE_SLOW_ADVERTISING:
            /* 返回 1.0～1.2 s 广播模式。 */
            return BLE_SERVICE_NIMBLE_POWER_SLOW_ADVERTISING;
        /* 训练连接要求低延迟上传。 */
        case POWER_BLE_CONNECTED_ACTIVE:
            /* 返回活动连接参数。 */
            return BLE_SERVICE_NIMBLE_POWER_CONNECTED_ACTIVE;
        /* 无训练连接待机允许从机延迟和 modem-sleep。 */
        case POWER_BLE_CONNECTED_MODEM_SLEEP:
            /* 返回连接省电参数。 */
            return BLE_SERVICE_NIMBLE_POWER_CONNECTED_MODEM_SLEEP;
        /* 内存损坏或未来未知枚举按关闭处理。 */
        default:
            /* 返回最保守关闭模式。 */
            return BLE_SERVICE_NIMBLE_POWER_OFF;
    }
}

/* 差分应用 BLE 射频模式；离线模式不阻断本地训练。 */
static void app_apply_ble_power_mode(const power_ble_mode_t mode)
{
    /* 转换为 NimBLE 公开枚举。 */
    const ble_service_nimble_power_mode_t mapped_mode = app_map_ble_power_mode(mode);
    /* 已成功应用同一模式时不重复提交连接参数更新。 */
    if (s_applied_ble_power_mode == (int)mapped_mode) {
        /* 无需访问主机栈。 */
        return;
    }
    /* 提交广播启停、快慢间隔或连接省电参数。 */
    const esp_err_t status = ble_service_nimble_set_power_mode(mapped_mode);
    /* 成功时更新差分缓存。 */
    if (status == ESP_OK) {
        /* 只有成功事实进入缓存，失败策略会在下一次电源效果重试。 */
        s_applied_ble_power_mode = (int)mapped_mode;
        /* 结束成功路径。 */
        return;
    }
    /* BLE 服务未启动表示设备处于离线模式，不影响本地识别和低功耗外设。 */
    if (status == ESP_ERR_INVALID_STATE) {
        /* 使用调试级日志，避免离线设备每次策略变化刷错误。 */
        ESP_LOGD(APP_TAG, "BLE power mode skipped: service offline mode=%d", (int)mapped_mode);
        /* 结束离线路径。 */
        return;
    }
    /* 其它错误表示 GAP 参数或主机状态异常，需要现场诊断。 */
    ESP_LOGW(
        APP_TAG,
        "BLE power mode apply failed mode=%d error=%s",
        (int)mapped_mode,
        esp_err_to_name(status));
}

/* 电源任务：差分应用显示、触摸、IMU、CPU 和最终睡眠/关机。 */
static void app_power_task(void *argument)
{
    /* 当前不使用参数。 */
    (void)argument;
    /* 保存最新策略。 */
    app_power_request_t request;
    /* 永久处理。 */
    while (true) {
        /* 等待策略。 */
        if (xQueueReceive(s_power_queue, &request, portMAX_DELAY) != pdPASS) {
            /* 继续。 */
            continue;
        }
        /* 先安装本策略要求的 Light-sleep GPIO 唤醒源。 */
        const bool light_wake_ready = app_configure_light_sleep_wake(&request.policy);
        /* 设置动态频率和自动 Light-sleep。 */
        const esp_pm_config_t pm = {
            /* 使用策略最高 MHz。 */
            .max_freq_mhz = (int)request.policy.max_cpu_mhz,
            /* 使用策略最低 MHz。 */
            .min_freq_mhz = (int)request.policy.min_cpu_mhz,
            /* 只在策略允许且唤醒源配置成功时启用自动 Light-sleep。 */
            .light_sleep_enable = request.policy.automatic_light_sleep && light_wake_ready,
        };
        /* 配置失败只记录，继续应用外设安全状态。 */
        const esp_err_t pm_error = esp_pm_configure(&pm);
        /* 输出失败。 */
        if (pm_error != ESP_OK) {
            /* 记录错误。 */
            ESP_LOGW(APP_TAG, "esp_pm_configure failed=%s", esp_err_to_name(pm_error));
        }
        /* 默认把无效或明确 OFF 策略映射为完全关闭传感器。 */
        board_runtime_qmi_mode_t qmi_mode = BOARD_RUNTIME_QMI_OFF;
        /* 按电源领域枚举选择驱动层寄存器模式。 */
        switch (request.policy.imu_mode) {
            /* 25 Hz 识别策略需要恢复 ACTIVE 量程和 ODR。 */
            case POWER_IMU_ACTIVE_25HZ:
                /* 选择活动采样。 */
                qmi_mode = BOARD_RUNTIME_QMI_ACTIVE;
                /* 结束分支。 */
                break;
            /* 待机与 Deep-sleep 策略需要 21 Hz 低功耗加速度 WOM。 */
            case POWER_IMU_WAKE_ON_MOTION:
                /* 选择运动唤醒。 */
                qmi_mode = BOARD_RUNTIME_QMI_WAKE_ON_MOTION;
                /* 结束分支。 */
                break;
            /* 显式 OFF 与未知枚举都保留安全关闭。 */
            case POWER_IMU_OFF:
            default:
                /* 保持 OFF。 */
                qmi_mode = BOARD_RUNTIME_QMI_OFF;
                /* 结束分支。 */
                break;
        }
        /* 串行切换 QMI 的 ACTIVE/WOM/OFF 真实寄存器状态。 */
        const board_runtime_result_t qmi_status = board_runtime_set_qmi_mode(
            &s_board_runtime,
            qmi_mode);
        /* 记录模式切换失败；Deep-sleep 门控会因 wom_configured=false 拒绝睡眠。 */
        if (qmi_status != BOARD_RUNTIME_OK) {
            /* 输出目标模式和 runtime 错误码。 */
            ESP_LOGE(
                APP_TAG,
                "QMI power mode change failed mode=%d status=%d",
                (int)qmi_mode,
                (int)qmi_status);
        }
        /* 只有 WOM 模式真实写寄存器成功才允许后续 EXT1 门控。 */
        const bool wom_configured = (qmi_status == BOARD_RUNTIME_OK) &&
                                    (qmi_mode == BOARD_RUNTIME_QMI_WAKE_ON_MOTION);
        /* Deep-sleep 前必须先验证 WOM 和 EXT1；失败时不得提前关闭 BLE、屏幕或触摸。 */
        if (request.policy.request_deep_sleep) {
            /* 安装 GPIO21 EXT1 ANY_HIGH 并检查全链路先决条件。 */
            if (!app_prepare_deep_sleep_wake(&request.policy, wom_configured)) {
                /* 拒绝没有可验证唤醒源的 Deep-sleep，避免设备变成无法唤醒。 */
                ESP_LOGE(
                    APP_TAG,
                    "Deep-sleep refused: QMI WOM or GPIO21 EXT1 wake source unavailable");
                /* 保留此前成功应用的 BLE、显示和触摸状态；下一次用户/电源事件可重试。 */
                continue;
            }
        }
        /* Deep-sleep 先决条件已通过或本策略不睡眠，现在才切换 BLE 射频状态。 */
        app_apply_ble_power_mode(request.policy.ble_mode);
        /* 应用 AMOLED 物理 Display On/Off 与亮度。 */
        (void)board_adapter_set_display(
            board_runtime_adapter(&s_board_runtime),
            request.policy.display_on,
            request.policy.display_brightness_percent);
        /* 应用 FT3168 硬件活动状态；待机触摸唤醒策略会保持 true。 */
        (void)board_runtime_set_touch_active(&s_board_runtime, request.policy.touch_active);
        /* 扬声器 v1 默认关闭。 */
        (void)board_runtime_set_speaker_enabled(&s_board_runtime, request.policy.speaker_active);
        /* TF 常规卸载，仅显式日志事务挂载。 */
        (void)board_runtime_set_storage_active(&s_board_runtime, request.policy.storage_active);
        /* 只有唤醒链验证通过且外设已经安全降功耗后才真正进入 Deep-sleep。 */
        if (request.policy.request_deep_sleep) {
            /* 确保 NimBLE 主机和控制器已停止；重复 stop 由服务幂等处理。 */
            (void)ble_service_nimble_stop();
            /* 给日志和 VFS 50 ms 调度机会。 */
            vTaskDelay(pdMS_TO_TICKS(50U));
            /* 进入 Deep-sleep；本函数成功后不会返回。 */
            esp_deep_sleep_start();
        }
        /* PMIC 请求必须同时具有刷盘授权。 */
        if (request.policy.request_pmic_shutdown && request.persist_authorized) {
            /* 停止 BLE 广播/连接。 */
            (void)ble_service_nimble_stop();
            /* 留 600 ms 播放轻量关机动画。 */
            vTaskDelay(pdMS_TO_TICKS(600U));
            /* 请求 AXP2101 真关机。 */
            const board_runtime_result_t status =
                board_runtime_request_pmic_shutdown(&s_board_runtime);
            /* PMIC 写失败时保留供电并输出错误。 */
            if (status != BOARD_RUNTIME_OK) {
                /* 记录错误。 */
                ESP_LOGE(APP_TAG, "AXP2101 shutdown failed=%d", (int)status);
            }
        }
    }
}

