G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 创建所有队列和同步对象。 */
static bool app_create_os_objects(void)
{
    /* 创建主事件队列。 */
    s_app_event_queue = xQueueCreate(APP_EVENT_QUEUE_LENGTH, sizeof(app_event_t));
    /* 创建 UI 最新帧队列。 */
    s_ui_queue = xQueueCreate(APP_UI_QUEUE_LENGTH, sizeof(ui_context_t));
    /* 创建 BLE 输出队列。 */
    s_ble_queue = xQueueCreate(APP_BLE_QUEUE_LENGTH, sizeof(app_ble_output_t));
    /* 创建存储队列。 */
    s_storage_queue = xQueueCreate(APP_STORAGE_QUEUE_LENGTH, sizeof(app_storage_request_t));
    /* 创建振动队列。 */
    s_haptic_queue = xQueueCreate(APP_HAPTIC_QUEUE_LENGTH, sizeof(fitness_haptic_request_t));
    /* 创建电源最新策略队列。 */
    s_power_queue = xQueueCreate(APP_POWER_QUEUE_LENGTH, sizeof(app_power_request_t));
    /* 创建 BLE broker 互斥锁。 */
    s_ble_command_mutex = xSemaphoreCreateMutex();
    /* 创建 BLE broker 完成信号。 */
    s_ble_command_done = xSemaphoreCreateBinary();
    /* 创建仓储互斥锁。 */
    s_session_store_mutex = xSemaphoreCreateMutex();
    /* 创建传输服务互斥锁。 */
    s_session_transfer_mutex = xSemaphoreCreateMutex();
    /* 创建 QMI 专用互斥锁，串行化数据读取与低功耗寄存器切换。 */
    s_sensors.qmi_mutex = xSemaphoreCreateMutex();
    /* 全部对象必须成功。 */
    return (s_app_event_queue != NULL) && (s_ui_queue != NULL) &&
           (s_ble_queue != NULL) && (s_storage_queue != NULL) &&
           (s_haptic_queue != NULL) && (s_power_queue != NULL) &&
           (s_ble_command_mutex != NULL) && (s_ble_command_done != NULL) &&
           (s_session_store_mutex != NULL) && (s_session_transfer_mutex != NULL) &&
           (s_sensors.qmi_mutex != NULL);
}

/* 初始化 NVS，处理分区页耗尽和版本变化。 */
static esp_err_t app_init_nvs(void)
{
    /* 首次初始化。 */
    esp_err_t error = nvs_flash_init();
    /* 仅在官方可恢复错误下擦除后重建。 */
    if ((error == ESP_ERR_NVS_NO_FREE_PAGES) || (error == ESP_ERR_NVS_NEW_VERSION_FOUND)) {
        /* 擦除旧 NVS。 */
        ESP_RETURN_ON_ERROR(nvs_flash_erase(), APP_TAG, "NVS erase failed");
        /* 重新初始化。 */
        error = nvs_flash_init();
    }
    /* 返回结果。 */
    return error;
}

/* 把有效配置同步写入 NVS；RawStream 属于断线即关闭的易失状态，不写入持久化 blob。 */
static esp_err_t app_persist_device_config(const device_config_t *config)
{
    /* 必填配置不能为空。 */
    if (config == NULL) {
        /* 返回 ESP-IDF 非法参数。 */
        return ESP_ERR_INVALID_ARG;
    }
    /* 创建持久化副本，避免修改应用任务正在使用的运行配置。 */
    device_config_t persisted = *config;
    /* 原始六轴流重启、断线或换用户后必须重新显式授权。 */
    persisted.raw_stream_enabled = false;
    /* 保存固定 44 字节 CRC32 blob。 */
    uint8_t blob[DEVICE_CONFIG_BLOB_SIZE];
    /* 保存编码输出长度。 */
    size_t blob_length = 0U;
    /* 使用纯 C codec 验证全部范围并编码。 */
    const device_config_status_t encode_status = device_config_blob_encode(
        &persisted,
        blob,
        sizeof(blob),
        &blob_length);
    /* 内部配置非法或尺寸漂移时拒绝写 NVS。 */
    if ((encode_status != DEVICE_CONFIG_OK) || (blob_length != sizeof(blob))) {
        /* 记录 codec 状态。 */
        ESP_LOGE(APP_TAG, "device config encode failed=%d len=%u",
                 (int)encode_status,
                 (unsigned int)blob_length);
        /* 返回参数错误。 */
        return ESP_ERR_INVALID_ARG;
    }
    /* 打开独立读写命名空间。 */
    nvs_handle_t handle = 0U;
    /* NVS 打开失败时不改变运行配置。 */
    esp_err_t error = nvs_open(APP_CONFIG_NVS_NAMESPACE, NVS_READWRITE, &handle);
    /* 传播打开错误。 */
    if (error != ESP_OK) {
        /* 返回原错误。 */
        return error;
    }
    /* 写入完整 blob；NVS 自身还提供条目级 CRC 和断电恢复。 */
    error = nvs_set_blob(handle, APP_CONFIG_NVS_KEY, blob, blob_length);
    /* set 成功后 commit 才形成跨重启事实。 */
    if (error == ESP_OK) {
        /* 提交当前命名空间事务。 */
        error = nvs_commit(handle);
    }
    /* 无论成功或失败都释放句柄。 */
    nvs_close(handle);
    /* 返回最终 NVS 状态。 */
    return error;
}

/* 从 NVS 恢复设备配置；缺失、损坏或旧格式均安全回退冻结默认值。 */
static void app_load_device_config(void)
{
    /* 先写完整默认值，任何读取失败都保留可启动配置。 */
    device_config_set_defaults(&s_device_config);
    /* 启动时强制关闭原始流。 */
    s_raw_stream_enabled = false;
    /* 尝试只读打开产品命名空间。 */
    nvs_handle_t handle = 0U;
    /* 命名空间从未创建时属于首次启动。 */
    const esp_err_t open_error = nvs_open(APP_CONFIG_NVS_NAMESPACE, NVS_READONLY, &handle);
    /* 首次启动直接使用默认值。 */
    if (open_error == ESP_ERR_NVS_NOT_FOUND) {
        /* 写入默认熄屏毫秒。 */
        s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
        /* 返回。 */
        return;
    }
    /* 其它打开错误记录后继续默认值。 */
    if (open_error != ESP_OK) {
        /* 记录 NVS 错误。 */
        ESP_LOGW(APP_TAG, "device config NVS open failed=%s; using defaults",
                 esp_err_to_name(open_error));
        /* 写入默认熄屏毫秒。 */
        s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
        /* 返回。 */
        return;
    }
    /* 固定容量缓冲只接受当前 44 字节格式。 */
    uint8_t blob[DEVICE_CONFIG_BLOB_SIZE];
    /* 输入长度初始化为完整容量，NVS 会返回实际所需长度。 */
    size_t blob_length = sizeof(blob);
    /* 读取完整配置条目。 */
    const esp_err_t read_error = nvs_get_blob(
        handle,
        APP_CONFIG_NVS_KEY,
        blob,
        &blob_length);
    /* 读取结束立即关闭句柄。 */
    nvs_close(handle);
    /* 缺键表示升级前设备，继续默认值。 */
    if (read_error == ESP_ERR_NVS_NOT_FOUND) {
        /* 写入默认熄屏毫秒。 */
        s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
        /* 返回。 */
        return;
    }
    /* 长度、介质或读取错误均不使用部分字节。 */
    if ((read_error != ESP_OK) || (blob_length != sizeof(blob))) {
        /* 输出实际错误和长度。 */
        ESP_LOGW(APP_TAG, "device config NVS read failed=%s len=%u; using defaults",
                 esp_err_to_name(read_error),
                 (unsigned int)blob_length);
        /* 写入默认熄屏毫秒。 */
        s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
        /* 返回。 */
        return;
    }
    /* 在局部对象执行魔数、版本、保留位、范围和 CRC32 校验。 */
    device_config_t decoded;
    /* 解码失败不污染默认配置。 */
    const device_config_status_t decode_status = device_config_blob_decode(
        blob,
        blob_length,
        &decoded);
    /* 损坏或未来格式回退默认值。 */
    if (decode_status != DEVICE_CONFIG_OK) {
        /* 记录稳定 codec 状态。 */
        ESP_LOGW(APP_TAG, "device config blob rejected=%d; using defaults", (int)decode_status);
        /* 写入默认熄屏毫秒。 */
        s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
        /* 返回。 */
        return;
    }
    /* RawStream 即使旧 blob 曾保存 true，冷启动仍强制关闭。 */
    decoded.raw_stream_enabled = false;
    /* 全部验证通过后一次性提交。 */
    s_device_config = decoded;
    /* 秒转毫秒；最大 600 秒不会溢出 uint32。 */
    s_screen_timeout_ms = (uint32_t)s_device_config.screen_timeout_seconds * UINT32_C(1000);
}

/* 先初始化显示、触摸、I2C、马达与功放门控，使后续自检失败仍可显示中文 ERROR 页。 */
static bool app_init_board_runtime(void)
{
    /* 构造外部驱动回调；hub 生命周期为静态。 */
    const board_runtime_config_t config = {
        /* 注入真实传感器回调。 */
        .external_ops = {
            /* 指向静态 hub。 */
            .context = &s_sensors,
            /* 注入电池读取。 */
            .read_battery = app_sensor_read_battery,
            /* 注入 QMI ACTIVE/WOM/OFF 真实寄存器切换。 */
            .set_qmi_mode = app_sensor_set_qmi_mode,
            /* 注入 RTC。 */
            .read_rtc_unix_seconds = app_sensor_read_rtc,
            /* 注入 PMIC 关机。 */
            .request_pmic_shutdown = app_sensor_request_shutdown,
        },
        /* Mock 后端默认也使用厂家 400 mAh 的 80% 电量。 */
        .mock = {
            /* 设 80%。 */
            .battery_percent = 80U,
            /* 默认未充电。 */
            .charging = false,
            /* 模拟有 TF。 */
            .storage_present = true,
            /* 模拟三芯片存在。 */
            .sensor_devices_present = true,
        },
        /* 启动亮度直接使用 NVS/Cmd9 偏好，首次启动默认为 35%。 */
        .initial_brightness_percent = s_device_config.brightness_percent,
    };
    /* 初始化厂家 BSP、显示、触摸、I2C、马达和功放门控。 */
    if (board_runtime_init(&s_board_runtime, &config) != BOARD_RUNTIME_OK) {
        /* 输出失败。 */
        ESP_LOGE(APP_TAG, "board_runtime_init failed");
        /* 返回失败。 */
        return false;
    }
    /* 清空静态诊断快照，避免复位前残留值被后续传感器初始化误用。 */
    (void)memset(&s_board_diagnostics, 0, sizeof(s_board_diagnostics));
    /* 读取启动阶段固定的显示、I2C、QMI8658、PMIC 与 RTC 探测结果。 */
    if (board_runtime_get_diagnostics(&s_board_runtime, &s_board_diagnostics) != BOARD_RUNTIME_OK) {
        /* 输出诊断读取失败，禁止后续使用未初始化的设备地址。 */
        ESP_LOGE(APP_TAG, "board diagnostics unavailable");
        /* 返回失败，避免向错误 I2C 地址发送配置命令。 */
        return false;
    }
    /* 返回成功；外设芯片是否可用于产品功能由显示 SELF_TEST 页后的独立阶段判断。 */
    return true;
}

/* 在 SELF_TEST 页可见期间初始化 QMI8658、AXP2101 与 PCF85063。 */
static bool app_init_external_sensors(void)
{
    /* QMI8658 必须在 0x6A 或 0x6B 应答；零地址表示板级探测没有发现 IMU。 */
    if (!s_board_diagnostics.qmi_present) {
        /* 输出明确故障，便于实机自检区分总线故障与寄存器配置故障。 */
        ESP_LOGE(APP_TAG, "QMI8658 not found at 0x6A or 0x6B");
        /* 没有 IMU 无法执行动作识别，停止启动。 */
        return false;
    }
    /* 取得 BSP 共用 I2C 总线。 */
    i2c_master_bus_handle_t bus =
        (i2c_master_bus_handle_t)board_runtime_i2c_handle(&s_board_runtime);
    /* 总线必须有效。 */
    if (bus == NULL) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "BSP I2C handle unavailable");
        /* 返回失败。 */
        return false;
    }
    /* 使用板级探测得到的 0x6A/0x6B 地址注册 QMI，同时注册固定地址的 AXP2101 与 PCF85063。 */
    if (board_sensors_esp_idf_i2c_init_with_qmi_address(
            &s_sensors.i2c,
            bus,
            s_board_diagnostics.qmi_i2c_address) != BOARD_SENSORS_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "board sensor I2C adapter init failed");
        /* 返回失败。 */
        return false;
    }
    /* 按真实 SA0 地址初始化 QMI 到 ±8g@125 Hz 和 ±1024dps@112.1 Hz。 */
    if (board_qmi8658_init_with_address(
            &s_sensors.qmi,
            &s_sensors.i2c.port,
            s_board_diagnostics.qmi_i2c_address) != BOARD_SENSORS_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "QMI8658 init failed; detected address=0x%02X",
                 (unsigned int)s_board_diagnostics.qmi_i2c_address);
        /* 返回失败。 */
        return false;
    }
    /* 初始化 AXP2101；安全电量和关机依赖它。 */
    if (board_axp2101_init(&s_sensors.axp, &s_sensors.i2c.port) != BOARD_SENSORS_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "AXP2101 init failed");
        /* 返回失败。 */
        return false;
    }
    /* 初始化 RTC；失败不阻断单调会话，但 UTC 会保持未知。 */
    if (board_pcf85063_init(&s_sensors.rtc, &s_sensors.i2c.port) != BOARD_SENSORS_OK) {
        /* 输出警告。 */
        ESP_LOGW(APP_TAG, "PCF85063 init failed; session UTC remains unknown");
    }
    /* 默认关闭 QMI 数据轮询，开始会话后由电源策略开启。 */
    s_sensors.qmi_sampling_enabled = false;
    /* 标记外部回调可用。 */
    s_sensors.initialized = true;
    /* 返回成功。 */
    return true;
}

/* 挂载 LittleFS 并恢复最近 200 条会话。 */
static bool app_init_session_store(void)
{
    /* 配置内部 Flash LittleFS；首次空白分区允许格式化。 */
    const esp_vfs_littlefs_conf_t config = {
        /* 挂载路径。 */
        .base_path = APP_LITTLEFS_BASE_PATH,
        /* 对应 partitions.csv 的 littlefs 标签。 */
        .partition_label = "littlefs",
        /* 首次空白或损坏时格式化；恢复前仍由双槽 CRC 拒绝半写记录。 */
        .format_if_mount_failed = true,
        /* 挂载 VFS。 */
        .dont_mount = false,
    };
    /* 注册 VFS。 */
    const esp_err_t mount_error = esp_vfs_littlefs_register(&config);
    /* 挂载失败不能提供安全摘要。 */
    if (mount_error != ESP_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "LittleFS mount failed=%s", esp_err_to_name(mount_error));
        /* 返回失败。 */
        return false;
    }
    /* 打开固定双槽文件并扩容为 0xFF。 */
    if (session_file_backend_open(
            &s_session_file_backend,
            APP_SESSION_FILE_PATH,
            session_store_required_backend_size(),
            true) != SESSION_STORE_STATUS_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "session file open failed path=%s", APP_SESSION_FILE_PATH);
        /* 返回失败。 */
        return false;
    }
    /* 生成后端接口副本。 */
    const session_store_backend_t backend =
        session_file_backend_interface(&s_session_file_backend);
    /* 恢复两个槽中最新有效快照。 */
    if (session_store_init(&s_session_store, &backend) != SESSION_STORE_STATUS_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "session store recovery failed");
        /* 返回失败。 */
        return false;
    }
    /* 绑定会话补传。 */
    if (!session_transfer_service_init(&s_session_transfer, &s_session_store)) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "session transfer init failed");
        /* 返回失败。 */
        return false;
    }
    /* 返回成功。 */
    return true;
}

