G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* 从最近摘要生成重启后下一会话序号。 */
static uint32_t app_next_session_sequence(void)
{
    /* 空仓储从 1 开始。 */
    if (session_store_count(&s_session_store) == 0U) {
        /* 返回 1。 */
        return 1U;
    }
    /* 读取最新摘要。 */
    session_summary_t latest;
    /* 读取失败回退 1，并由日志提示。 */
    if (session_store_get_recent(&s_session_store, 0U, &latest) != SESSION_STORE_STATUS_OK) {
        /* 输出警告。 */
        ESP_LOGW(APP_TAG, "latest session read failed; sequence resets to 1");
        /* 返回 1。 */
        return 1U;
    }
    /* uint32 最大值后跳过零。 */
    const uint32_t next = latest.session_seq + 1U;
    /* 零哨兵改为 1。 */
    return next == 0U ? 1U : next;
}

/*
 * 在长期 UI 任务启动前同步显示开机页与自检页。
 * 该函数只操作局部纯 UI 上下文，不修改已经初始化到 HOME 的业务协调器；
 * renderer 在每次调用内获取 LVGL 锁，因此启动任务无需直接接触任何 lv_ 对象。
 */
static bool app_show_startup_pages(ui_context_t *startup_ui)
{
    /* 调用方必须提供持续到自检结束的上下文，失败路径还要用它渲染 ERROR 页。 */
    if (startup_ui == NULL) {
        /* 空上下文无法维护 BOOT 到 SELF_TEST 的合法状态转移。 */
        return false;
    }
    /* 使用当前单调毫秒初始化到 BOOT，避免 RTC 校时影响动画。 */
    ui_context_init(startup_ui, (uint32_t)app_now_ms());
    /* 首帧立即显示产品 Logo 与本地 AI 提示。 */
    if (ui_lvgl_renderer_render(&s_ui_renderer, startup_ui) != UI_LVGL_OK) {
        /* 渲染失败表示屏幕对象树不可用，禁止伪装启动成功。 */
        ESP_LOGE(APP_TAG, "boot page render failed");
        /* 返回失败。 */
        return false;
    }
    /* 读取集中动画配置；均衡模式的开机显示时长固定为 800 ms。 */
    const ui_animation_profile_t animation = ui_default_animation_profile();
    /* app_main 本身是 FreeRTOS 任务，阻塞期间会让出 CPU，不是忙等待。 */
    vTaskDelay(pdMS_TO_TICKS(animation.boot_ms));
    /* 构造 BOOT 到 SELF_TEST 的纯状态事件。 */
    const ui_event_t boot_ready = {
        /* 标记板级初始化已完成，可以展示自检结果。 */
        .type = UI_EVENT_BOOT_READY,
        /* 记录切页时单调毫秒。 */
        .monotonic_ms = (uint32_t)app_now_ms(),
    };
    /* 状态机必须从 BOOT 准确进入 SELF_TEST。 */
    if (ui_dispatch_event(startup_ui, &boot_ready) != UI_DISPATCH_OK) {
        /* 理论错误需阻止进入无法解释的主页。 */
        ESP_LOGE(APP_TAG, "boot page transition failed");
        /* 返回失败。 */
        return false;
    }
    /* 显示硬件、触摸、IMU 与存储均已完成检查的自检页。 */
    if (ui_lvgl_renderer_render(&s_ui_renderer, startup_ui) != UI_LVGL_OK) {
        /* 自检页渲染失败同样视为 UI 启动失败。 */
        ESP_LOGE(APP_TAG, "self-test page render failed");
        /* 返回失败。 */
        return false;
    }
    /* 返回成功；真实外设和存储检查接下来在 SELF_TEST 页可见期间执行。 */
    return true;
}

/*
 * 显示质量隔离模式只绘制一次 HOME 页面。
 * 状态机仍依次接收 BOOT_READY 和 SELF_TEST_OK，避免直接改写 state 破坏 presenter 合同；
 * 两个中间状态不调用渲染器，因此面板上不存在可与 HOME 同坐标叠加的旧文字帧。
 */
static bool app_show_static_home_once(ui_context_t *static_ui)
{
    /* 调用方必须提供在永久显示期间持续有效的局部 UI 上下文。 */
    if (static_ui == NULL) {
        /* 空指针无法承载合法状态转移，返回失败且不接触 LVGL。 */
        return false;
    }
    /* 从 BOOT 初始化纯状态对象；此处不渲染 BOOT，避免向 AMOLED 写入第一组文字。 */
    ui_context_init(static_ui, (uint32_t)app_now_ms());
    /* 构造 BOOT 到 SELF_TEST 的合法状态事件。 */
    const ui_event_t boot_ready = {
        /* 标记板级显示初始化已完成。 */
        .type = UI_EVENT_BOOT_READY,
        /* 记录单调毫秒；该值只服务状态机，不参与任何页面动画。 */
        .monotonic_ms = (uint32_t)app_now_ms(),
    };
    /* 只推进状态，不调用 ui_lvgl_renderer_render，因此 SELF_TEST 文字不会写入面板。 */
    if (ui_dispatch_event(static_ui, &boot_ready) != UI_DISPATCH_OK) {
        /* 状态机拒绝表示启动合同损坏，不能用直接写 state 的方式绕过。 */
        ESP_LOGE(APP_TAG, "static HOME BOOT_READY transition failed");
        /* 返回失败。 */
        return false;
    }
    /* 构造 SELF_TEST 到 HOME 的合法状态事件。 */
    const ui_event_t self_test_ok = {
        /* 表示本显示隔离固件允许进入 HOME；传感器与存储未在此模式初始化。 */
        .type = UI_EVENT_SELF_TEST_OK,
        /* 记录第二次状态转移的单调毫秒。 */
        .monotonic_ms = (uint32_t)app_now_ms(),
    };
    /* 再次只推进状态，使 presenter 最终读取标准 HOME 视图。 */
    if (ui_dispatch_event(static_ui, &self_test_ok) != UI_DISPATCH_OK) {
        /* 拒绝转移时记录唯一故障点。 */
        ESP_LOGE(APP_TAG, "static HOME SELF_TEST_OK transition failed");
        /* 返回失败。 */
        return false;
    }
    /* 全流程唯一一次渲染直接绘制 HOME；静态渲染器会立即加载、整页失效并同步刷新。 */
    if (ui_lvgl_renderer_render(&s_ui_renderer, static_ui) != UI_LVGL_OK) {
        /* HOME 仍无法绘制时把故障限定到页面树、锁或显示刷新链。 */
        ESP_LOGE(APP_TAG, "static HOME single render failed");
        /* 返回失败。 */
        return false;
    }
    /* 返回成功；调用方随后永久等待，页面不再切换或重绘。 */
    return true;
}

/* 把已可见的 SELF_TEST 页切到中文 ERROR 页并保留稳定故障码。 */
static void app_show_startup_error(ui_context_t *startup_ui, const int32_t fault_code)
{
    /* 空上下文表示连最小 UI 状态都不可用，只能依靠串口日志。 */
    if (startup_ui == NULL) {
        /* 结束安全无操作路径。 */
        return;
    }
    /* 在派发失败事件前写入稳定码；状态机合同明确从 context 读取该字段。 */
    startup_ui->fault_code = fault_code;
    /* 构造只含单调时间的自检失败事件。 */
    const ui_event_t failed = {
        /* 指明关键自检失败。 */
        .type = UI_EVENT_SELF_TEST_FAILED,
        /* 使用单调毫秒，RTC 故障不会影响页面状态。 */
        .monotonic_ms = (uint32_t)app_now_ms(),
    };
    /* 只有 SELF_TEST 到 ERROR 的合法转移才允许渲染故障页。 */
    if (ui_dispatch_event(startup_ui, &failed) != UI_DISPATCH_OK) {
        /* 输出状态机错误；此时保留当前 SELF_TEST 页面。 */
        ESP_LOGE(APP_TAG, "startup ERROR transition failed code=%ld", (long)fault_code);
        /* 结束。 */
        return;
    }
    /* 渲染器内部获取 BSP LVGL 锁；失败时串口仍保留同一稳定故障码。 */
    if (ui_lvgl_renderer_render(&s_ui_renderer, startup_ui) != UI_LVGL_OK) {
        /* 记录渲染失败。 */
        ESP_LOGE(APP_TAG, "startup ERROR render failed code=%ld", (long)fault_code);
    }
}

/* 完成 SELF_TEST 到 HOME 的合法转移；真实协调器 HOME 随后覆盖局部启动上下文。 */
static bool app_finish_startup_success(ui_context_t *startup_ui)
{
    /* 上下文必须仍停留在本次启动的 SELF_TEST 页面。 */
    if (startup_ui == NULL) {
        /* 返回失败。 */
        return false;
    }
    /* 自检页至少再保留 350 ms，避免快速主机或真机上一闪而过。 */
    vTaskDelay(pdMS_TO_TICKS(APP_SELF_TEST_HOLD_MS));
    /* 构造成功事件。 */
    const ui_event_t passed = {
        /* 指明全部关键软件与板级合同已建立。 */
        .type = UI_EVENT_SELF_TEST_OK,
        /* 使用单调时间。 */
        .monotonic_ms = (uint32_t)app_now_ms(),
    };
    /* 必须从 SELF_TEST 精确进入 HOME。 */
    if (ui_dispatch_event(startup_ui, &passed) != UI_DISPATCH_OK) {
        /* 记录错误。 */
        ESP_LOGE(APP_TAG, "startup HOME transition failed");
        /* 返回失败。 */
        return false;
    }
    /* 返回成功；长期 UI 首帧使用协调器的权威 HOME 快照。 */
    return true;
}

/* 在板级显示可用后尽早建立 LVGL 页面树，保证后续外设失败可见。 */
static bool app_init_ui_renderer(void)
{
    /* 构造 LVGL 锁端口。 */
    const ui_lvgl_port_t ui_port = {
        /* 锁上下文为 board_runtime。 */
        .context = &s_board_runtime,
        /* 使用 BSP 锁。 */
        .lock = board_runtime_lvgl_lock,
        /* 使用 BSP 解锁。 */
        .unlock = board_runtime_lvgl_unlock,
    };
    /* 创建全部中文页面和按钮。 */
    if (ui_lvgl_renderer_init(
            &s_ui_renderer,
            &ui_port,
            app_ui_command_callback,
            NULL) != UI_LVGL_OK) {
        /* 页面树不可用时无法提供触屏产品。 */
        ESP_LOGE(APP_TAG, "LVGL renderer init failed");
        /* 返回失败。 */
        return false;
    }
    /* 返回成功。 */
    return true;
}

/* 初始化协调器和 IMU 流水线；LVGL renderer 已在外设自检前建立。 */
static bool app_init_domains(void)
{
    /* 取得启动探测后的板级配置，协调器不应再硬编码 Deep-sleep 能力。 */
    board_adapter_t *const adapter = board_runtime_adapter(&s_board_runtime);
    /* 板级运行时未就绪时拒绝初始化业务域。 */
    if (adapter == NULL) {
        /* 记录运行时状态错误。 */
        ESP_LOGE(APP_TAG, "board adapter unavailable before domain initialization");
        /* 返回失败。 */
        return false;
    }
    /* 构造协调器配置。 */
    const device_coordinator_config_t coordinator_config = {
        /* 使用持久化后下一序号。 */
        .next_session_seq = app_next_session_sequence(),
        /* 使用 NVS 恢复的下次会话体重，单位 g。 */
        .weight_g = s_device_config.weight_g,
        /* 使用 NVS 恢复的目标种类。 */
        .goal_kind = s_device_config.goal_kind,
        /* 使用 NVS 恢复的次数、秒或 mcal 目标值。 */
        .goal_value = s_device_config.goal_value,
        /* 使用编译配置生成的板型能力；真机仍须校准 40 mg/4 样本 WOM 参数。 */
        .allow_imu_deep_wake = adapter->profile.enable_imu_deep_wake,
    };
    /* 初始化到 Home。 */
    if (device_coordinator_init(&s_coordinator, &coordinator_config, app_now_ms()) !=
        DEVICE_COORDINATOR_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "device coordinator init failed");
        /* 返回失败。 */
        return false;
    }
    /* 用 NVS 恢复值覆盖纯 UI 冻结默认值，设置页首次打开即显示真实配置。 */
    app_project_device_config_to_ui(&s_coordinator.ui);
    /* 构造严格重采样与双 M0 配置。 */
    const imu_pipeline_config_t pipeline_config = {
        /* ±8 g 每 LSB。 */
        .accel_g_per_lsb = BOARD_QMI8658_ACCEL_G_PER_LSB,
        /* ±1024 deg/s 每 LSB。 */
        .gyro_dps_per_lsb = BOARD_QMI8658_GYRO_DPS_PER_LSB,
        /* 生产双 M0 使用短时最高频率锁，推理结束立即允许动态降频。 */
        .infer = app_pm_locked_dual_m0_infer,
        /* 当前模型无可变上下文。 */
        .inference_context = NULL,
        /* 25 Hz 点进入计数/热量。 */
        .on_sample = app_pipeline_on_sample,
        /* 不保存原始窗口。 */
        .on_window = NULL,
        /* 推理结果进入动作锁定。 */
        .on_inference = app_pipeline_on_inference,
        /* 回调无需上下文。 */
        .callback_context = NULL,
    };
    /* 初始化流水线。 */
    if (imu_pipeline_init(&s_imu_pipeline, &pipeline_config) != IMU_PIPELINE_OK) {
        /* 输出错误。 */
        ESP_LOGE(APP_TAG, "IMU pipeline init failed");
        /* 返回失败。 */
        return false;
    }
    /* 返回成功。 */
    return true;
}

/* 创建唯一任务集合。 */
static bool app_create_tasks(void)
{
    /* 应用任务 20 KiB 栈，覆盖双 M0 特征和前向临时数组。 */
    const BaseType_t app_created = xTaskCreatePinnedToCore(
        app_event_task,
        "app_owner",
        20U * 1024U,
        NULL,
        9U,
        NULL,
        1);
    /* QMI 读取任务固定 core0。 */
    const BaseType_t qmi_created = xTaskCreatePinnedToCore(
        app_qmi_task,
        "qmi_reader",
        4U * 1024U,
        NULL,
        10U,
        NULL,
        0);
    /* UI 任务可由调度器分配。 */
    const BaseType_t ui_created = xTaskCreate(
        app_ui_task,
        "ui_render",
        8U * 1024U,
        NULL,
        5U,
        NULL);
    /* BLE 发布任务。 */
    const BaseType_t ble_created = xTaskCreate(
        app_ble_task,
        "ble_publish",
        6U * 1024U,
        NULL,
        6U,
        NULL);
    /* 存储任务。 */
    const BaseType_t storage_created = xTaskCreate(
        app_storage_task,
        "session_store",
        6U * 1024U,
        NULL,
        4U,
        NULL);
    /* 马达任务。 */
    const BaseType_t haptic_created = xTaskCreate(
        app_haptic_task,
        "haptic",
        3U * 1024U,
        NULL,
        7U,
        NULL);
    /* 电池任务。 */
    const BaseType_t battery_created = xTaskCreate(
        app_battery_task,
        "battery",
        3U * 1024U,
        NULL,
        3U,
        NULL);
    /* 电源任务。 */
    const BaseType_t power_created = xTaskCreate(
        app_power_task,
        "power",
        4U * 1024U,
        NULL,
        4U,
        NULL);
    /* 空闲计时任务只投递每秒事件，2 KiB 栈足够 FreeRTOS 队列操作。 */
    const BaseType_t idle_created = xTaskCreate(
        app_idle_task,
        "idle_timer",
        2U * 1024U,
        NULL,
        2U,
        NULL);
    /* 全部九个任务必须创建成功。 */
    return (app_created == pdPASS) && (qmi_created == pdPASS) &&
           (ui_created == pdPASS) && (ble_created == pdPASS) &&
           (storage_created == pdPASS) && (haptic_created == pdPASS) &&
           (battery_created == pdPASS) && (power_created == pdPASS) &&
           (idle_created == pdPASS);
}

/* 启动 NimBLE 服务。 */
static bool app_start_ble(const uint8_t initial_battery_percent)
{
    /* 读取蓝牙 MAC。 */
    uint8_t mac[6] = {0U};
    /* 读取失败时仍使用固定名称。 */
    if (esp_read_mac(mac, ESP_MAC_BT) != ESP_OK) {
        /* 清零保留默认后缀。 */
        (void)memset(mac, 0, sizeof(mac));
    }
    /* 设备名使用 MAC 后两字节避免多设备混淆。 */
    (void)snprintf(
        s_ble_device_name,
        sizeof(s_ble_device_name),
        "BPNN-FIT-%02X%02X",
        (unsigned int)mac[4],
        (unsigned int)mac[5]);
    /* 序列号使用完整 48 位 MAC。 */
    (void)snprintf(
        s_ble_serial_number,
        sizeof(s_ble_serial_number),
        "%02X%02X%02X%02X%02X%02X",
        (unsigned int)mac[0],
        (unsigned int)mac[1],
        (unsigned int)mac[2],
        (unsigned int)mac[3],
        (unsigned int)mac[4],
        (unsigned int)mac[5]);
    /* 查询 LittleFS 总容量；单位 byte，值仅表示 Manifest 构建时快照。 */
    size_t littlefs_total_bytes = 0U;
    /* 查询 LittleFS 已使用容量；单位 byte。 */
    size_t littlefs_used_bytes = 0U;
    /* 读取已挂载 littlefs 分区容量，失败时不能发布字段不完整的正式 Manifest。 */
    const esp_err_t littlefs_info_error = esp_littlefs_info(
        "littlefs",
        &littlefs_total_bytes,
        &littlefs_used_bytes);
    /* 容量查询失败说明 Manifest 的必填存储字段不可用。 */
    if (littlefs_info_error != ESP_OK) {
        /* 记录精确 ESP-IDF 错误并让设备保持 BLE 离线模式。 */
        ESP_LOGE(APP_TAG, "LittleFS info for BLE Manifest failed=%s",
                 esp_err_to_name(littlefs_info_error));
        /* 返回失败，禁止重新退回空 Manifest。 */
        return false;
    }
    /* 已用容量异常大于总容量时钳制为零并记录，避免 size_t 无符号下溢。 */
    const uint64_t littlefs_available_bytes =
        littlefs_used_bytes <= littlefs_total_bytes
            ? (uint64_t)(littlefs_total_bytes - littlefs_used_bytes)
            : UINT64_C(0);
    /* 异常容量关系只影响提示值，不破坏已经成功恢复的会话仓储。 */
    if (littlefs_used_bytes > littlefs_total_bytes) {
        /* 输出异常原始值，供现场诊断 LittleFS 实现或分区表。 */
        ESP_LOGW(APP_TAG, "LittleFS used exceeds total used=%u total=%u",
                 (unsigned int)littlefs_used_bytes,
                 (unsigned int)littlefs_total_bytes);
    }
    /* 能力位仅声明主应用已接入的振动、历史补传、LittleFS 与显式开发者原始流。 */
    const uint32_t manifest_capabilities =
        (uint32_t)BLE_SERVICE_MANIFEST_CAPABILITY_HAPTIC_FEEDBACK |
        (uint32_t)BLE_SERVICE_MANIFEST_CAPABILITY_SESSION_HISTORY |
        (uint32_t)BLE_SERVICE_MANIFEST_CAPABILITY_LITTLEFS_STORAGE |
        (uint32_t)BLE_SERVICE_MANIFEST_CAPABILITY_RAW_STREAM;
    /* 构造全部正式 Manifest 字段；SHA 和类别顺序直接来自自动生成模型头。 */
    const ble_service_manifest_config_t manifest_config = {
        /* 完整 48 位蓝牙 MAC 作为动态设备 ID，和标准序列号保持一致。 */
        .device_id = s_ble_serial_number,
        /* 板卡修订使用当前厂家 2.06 板型。 */
        .board_revision = s_ble_hardware_revision,
        /* 协议主版本直接复用共享逻辑帧常量。 */
        .protocol_major = IMU_BLE_PROTOCOL_MAJOR,
        /* 协议次版本直接复用共享逻辑帧常量。 */
        .protocol_minor = IMU_BLE_PROTOCOL_MINOR,
        /* 固件版本与标准 0x2A26 特征一致。 */
        .firmware_version = s_ble_firmware_revision,
        /* 特征维度直接使用生成头 FEATURE_DIM，当前为 297。 */
        .feature_dimension = (uint16_t)FEATURE_DIM,
        /* 特征公式与顺序版本使用 Manifest v1 固定常量。 */
        .feature_version = BLE_SERVICE_MANIFEST_FEATURE_VERSION,
        /* 基础模型摘要直接引用生成头，禁止人工抄写造成漂移。 */
        .base_model_sha256_hex = BP_BASE_MODEL_SHA256,
        /* 掩码模型摘要直接引用生成头，禁止人工抄写造成漂移。 */
        .masked_model_sha256_hex = BP_MASKED_MODEL_SHA256,
        /* 类别数量直接使用生成头 CLASS_NUM，当前为 11。 */
        .class_count = (uint8_t)CLASS_NUM,
        /* 类别名按 logits 索引直接使用生成头 BP_CLASS_NAMES。 */
        .class_names = BP_CLASS_NAMES,
        /* 卡路里固定 milliMET 表当前为版本 1。 */
        .calorie_table_version = BLE_SERVICE_MANIFEST_CALORIE_TABLE_VERSION,
        /* 只设置已经完整接入的四项能力。 */
        .capabilities = manifest_capabilities,
        /* 写入启动时 LittleFS 可用容量快照，单位 byte。 */
        .littlefs_available_bytes = littlefs_available_bytes,
    };
    /* 保存 Manifest 构建后的实际字节数。 */
    size_t manifest_length = 0U;
    /* 先构建并校验全部 TLV，再交给 NimBLE 深拷贝。 */
    const ble_service_status_t manifest_status = ble_service_manifest_build(
        &manifest_config,
        s_ble_manifest,
        sizeof(s_ble_manifest),
        &manifest_length);
    /* 任何字段、SHA、类表或容量错误都禁止 BLE 退回空 Manifest。 */
    if ((manifest_status != BLE_SERVICE_STATUS_OK) ||
        (manifest_length == 0U) ||
        (manifest_length > UINT16_MAX)) {
        /* 输出 BLE 统一状态和长度，便于定位生成头或字段错误。 */
        ESP_LOGE(APP_TAG, "BLE Manifest build failed status=%d length=%u",
                 (int)manifest_status,
                 (unsigned int)manifest_length);
        /* 返回失败，设备仍可离线训练。 */
        return false;
    }
    /* 配置 GATT。 */
    const ble_service_nimble_config_t config = {
        /* 广播名。 */
        .device_name = s_ble_device_name,
        /* 厂商名。 */
        .manufacturer_name = "Waveshare+BPNN",
        /* 型号。 */
        .model_number = s_ble_model_number,
        /* 唯一序列号。 */
        .serial_number = s_ble_serial_number,
        /* 硬件修订来自当前板型，实物丝印后再细化。 */
        .hardware_revision = s_ble_hardware_revision,
        /* 固件语义版本。 */
        .firmware_revision = s_ble_firmware_revision,
        /* 发布已完整校验的正式 Manifest TLV；start 返回前复制到 NimBLE 静态状态。 */
        .manifest_payload = s_ble_manifest,
        /* builder 已保证长度不超过 512 和 uint16_t 上限。 */
        .manifest_length = (uint16_t)manifest_length,
        /* 使用启动 PMIC 电量。 */
        .initial_battery_percent = initial_battery_percent,
        /* 命令经同步 broker 进入应用任务。 */
        .command_handler = app_ble_command_handler,
        /* 无额外上下文。 */
        .command_context = NULL,
        /* 会话补传包装器。 */
        .transfer_handler = app_transfer_handler,
        /* 指向静态服务。 */
        .transfer_context = &s_session_transfer,
        /* 配对码显示。 */
        .passkey_display = app_ble_passkey_display,
        /* 配对成功、失败、断线、忘记或停服时清除屏幕敏感码。 */
        .passkey_clear = app_ble_passkey_clear,
        /* 两个回调共享启动前初始化的静态无锁邮箱。 */
        .passkey_context = &s_pairing_mailbox,
        /* 连接状态回调。 */
        .connection_changed = app_ble_connection_changed,
        /* 无额外上下文。 */
        .connection_context = NULL,
    };
    /* 启动服务与广播。 */
    const esp_err_t error = ble_service_nimble_start(&config);
    /* 失败时输出。 */
    if (error != ESP_OK) {
        /* 记录错误。 */
        ESP_LOGE(APP_TAG, "NimBLE start failed=%s", esp_err_to_name(error));
        /* 返回失败。 */
        return false;
    }
    /* 返回成功。 */
    return true;
}

/* 等待异步 NimBLE 主机完成同步并进入可连接广播，防止业务任务栈与主机内存池并发抢占片内 RAM。 */
static bool app_wait_ble_ready(void)
{
    /* 使用单调毫秒时钟计算固定截止点，系统校时不会改变等待长度。 */
    const uint64_t deadline_ms = app_now_ms() + APP_BLE_READY_TIMEOUT_MS;
    /* 保存最后一次生命周期快照，超时时输出精确启动阶段。 */
    ble_service_nimble_runtime_status_t runtime_status;
    /* 清零全部布尔位和射频枚举，避免首次快照读取失败时输出未初始化值。 */
    (void)memset(&runtime_status, 0, sizeof(runtime_status));
    /* 截止前周期让出 CPU，NimBLE 主机任务可完成控制器事件、GATT 注册和广播配置。 */
    while (app_now_ms() < deadline_ms) {
        /* 读取只含按值字段的生命周期快照；函数不返回或保存内部指针。 */
        const esp_err_t snapshot_error = ble_service_nimble_get_runtime_status(&runtime_status);
        /* 服务、主机同步和广播活动三项同时成立才允许九个业务任务开始分配栈。 */
        if ((snapshot_error == ESP_OK) &&
            runtime_status.started &&
            runtime_status.host_synced &&
            runtime_status.advertising) {
            /* 输出可由真机脚本解析的成功状态，不包含地址、密钥或配对信息。 */
            ESP_LOGI(
                APP_TAG,
                "BLE_READY started=1 synced=1 advertising=1");
            /* 返回成功，调用方现在可以创建业务任务。 */
            return true;
        }
        /* 休眠 20 ms 让出调度器；不会占用 NimBLE 主机所在 core0。 */
        vTaskDelay(pdMS_TO_TICKS(APP_BLE_READY_POLL_MS));
    }
    /* 超时输出最后事实，区分控制器失败、主机未同步和广播配置失败。 */
    ESP_LOGE(
        APP_TAG,
        "BLE_READY timeout started=%d synced=%d advertising=%d",
        runtime_status.started ? 1 : 0,
        runtime_status.host_synced ? 1 : 0,
        runtime_status.advertising ? 1 : 0);
    /* 返回失败；调用方必须停止半启动服务，释放控制器资源后稳定离线运行。 */
    return false;
}

