G1ow9711/IMU_BPNN_Classification/esp32/firmware/main/main.c
/* ESP-IDF 应用入口。 */
void app_main(void)
{
    /* 读取本次启动原因；枚举由 ESP-IDF 定义，后续日志可区分掉电、软件复位、看门狗和 Deep-sleep。 */
    const esp_reset_reason_t reset_reason = esp_reset_reason();
    /* 明确记录当前固件为现场常亮版本，串口可据此区分正式低功耗版本。 */
    ESP_LOGW(
        APP_TAG,
        "bench functional mode: reset_reason=%d screen_off=0 sleep=0 ble=1 initial_power_policy=1",
        (int)reset_reason);
    /* 分级隔离分支严格早于 NVS：第一阶段仅显示，第二阶段只增加三个 I2C 外设驱动。 */
    if (APP_BENCH_DISPLAY_ONLY || APP_BENCH_SENSOR_ONLY) {
        /* 不读取 NVS；先恢复冻结默认值，显示-only 会在 BSP 初始化前覆盖为厂家同档 100%。 */
        device_config_set_defaults(&s_device_config);
        /* 仅显示复测使用 100% 亮度，排除 35% AMOLED 调光把低灰阶文字边缘表现为抖动。 */
        if (APP_BENCH_DISPLAY_ONLY) {
            /* 亮度单位为百分比；100 是厂家 BSP 冷启动默认值，不改变产品 NVS 默认配置。 */
            s_device_config.brightness_percent = UINT8_C(100);
        }
        /* 初始化厂家 BSP 2.0.0 的显示、触摸和共用 I2C；第二阶段在页面可见后才配置独立外设。 */
        if (!app_init_board_runtime()) {
            /* 最早显示初始化失败只能写串口，不能继续创建 LVGL 对象。 */
            ESP_LOGE(APP_TAG, "bench staged board runtime failed");
            /* 结束 app_main；BSP 失败事实由复位日志定位。 */
            return;
        }
        /* 创建真实中文页面树和 Noto Sans SC 字体对象，直接覆盖字体、布局和 SH8601 刷新链。 */
        if (!app_init_ui_renderer()) {
            /* 页面树失败表示问题位于自定义 LVGL/UI 层。 */
            ESP_LOGE(APP_TAG, "bench staged UI renderer failed");
            /* 结束当前入口，禁止进入任何非显示初始化。 */
            return;
        }
        /* 显示-only 在首个 BOOT 帧前关闭全部 LVGL 动画，避免旧页面与新页面中文字形交叉淡入。 */
        if (APP_BENCH_DISPLAY_ONLY &&
            (ui_lvgl_renderer_set_animations_enabled(&s_ui_renderer, false) != UI_LVGL_OK)) {
            /* 动画开关失败表示 LVGL 锁或渲染器状态异常，不能继续产生不可解释的动态刷新。 */
            ESP_LOGE(APP_TAG, "display-only failed to disable LVGL animations");
            /* 保留串口错误并结束入口，不进入传感器或产品链。 */
            return;
        }
        /* 保存隔离阶段局部页面状态；该对象在永久等待期间始终有效。 */
        ui_context_t bench_ui;
        /* 显示-only 只绘制一次 HOME；传感器-only 保留三页启动链供下一阶段观察自检结果。 */
        if (APP_BENCH_DISPLAY_ONLY) {
            /* 单页 helper 通过合法事件推进状态，但只向面板提交一张 HOME。 */
            if (!app_show_static_home_once(&bench_ui)) {
                /* 单次 HOME 失败时记录显示链问题。 */
                ESP_LOGE(APP_TAG, "display-only static HOME failed");
                /* 不进入普通产品启动链。 */
                return;
            }
        } else if (!app_show_startup_pages(&bench_ui)) {
            /* 传感器-only 的 BOOT 或 SELF_TEST 渲染失败时记录阶段错误。 */
            ESP_LOGE(APP_TAG, "sensor-only startup pages failed");
            /* 不进入外设初始化。 */
            return;
        }
        /* 传感器阶段默认尚未失败；显示-only 不进入下面的 I2C 独立驱动路径。 */
        bool bench_sensor_ready = true;
        /* 第二阶段只增加 QMI8658、AXP2101 与 PCF85063，不创建其它产品对象。 */
        if (APP_BENCH_SENSOR_ONLY) {
            /* 创建 QMI 专用互斥量；维持驱动访问合同，但不创建完整产品队列或其它锁。 */
            s_sensors.qmi_mutex = xSemaphoreCreateMutex();
            /* 互斥量创建失败表示内部 RAM 不足，不能安全进入独立 QMI 驱动。 */
            if (s_sensors.qmi_mutex == NULL) {
                /* 记录明确阶段错误，避免把内存失败误判为 I2C 或 PMIC 故障。 */
                ESP_LOGE(APP_TAG, "sensor-only QMI mutex allocation failed");
                /* 标记失败；下方显示固定传感器错误页并永久停留。 */
                bench_sensor_ready = false;
            } else if (!app_init_external_sensors()) {
                /* 任一 QMI/AXP 关键初始化失败都保持自检错误页；RTC 失败只由该函数记录警告。 */
                ESP_LOGE(APP_TAG, "sensor-only external sensor initialization failed");
                /* 标记失败，禁止切到 HOME 或进入后续产品链。 */
                bench_sensor_ready = false;
            }
            /* 失败时显示稳定中文故障码 1001，方便肉眼确认故障已发生在传感器阶段。 */
            if (!bench_sensor_ready) {
                /* SELF_TEST 合法切到 ERROR；该函数内部持有 LVGL 锁并同步刷新。 */
                app_show_startup_error(&bench_ui, APP_STARTUP_FAULT_SENSOR);
                /* 输出唯一失败标记，区分硬掉电、初始化返回失败和后续软件路径。 */
                ESP_LOGE(APP_TAG, "SENSOR_ONLY_FAULT_POINT ui=ERROR sensors=0 storage=0 model=0 tasks=0");
            }
        }
        /* 只有传感器-only 仍停在 SELF_TEST；显示-only 已由单页 helper 进入 HOME。 */
        if (APP_BENCH_SENSOR_ONLY && bench_sensor_ready && !app_finish_startup_success(&bench_ui)) {
            /* 状态机拒绝意味着页面合同本身不一致。 */
            ESP_LOGE(APP_TAG, "bench staged HOME transition failed");
            /* 不继续。 */
            return;
        }
        /* 传感器-only 成功时渲染 HOME；显示-only 禁止第二次渲染，失败时 ERROR 已单独绘制。 */
        if (APP_BENCH_SENSOR_ONLY && bench_sensor_ready &&
            (ui_lvgl_renderer_render(&s_ui_renderer, &bench_ui) != UI_LVGL_OK)) {
            /* HOME 刷新失败表明自定义页面或显示缓冲仍有问题。 */
            ESP_LOGE(APP_TAG, "bench staged HOME render failed");
            /* 结束入口。 */
            return;
        }
        /* 第二阶段成功时输出唯一标记，证明三个外设已初始化且未进入存储、模型和产品任务。 */
        if (APP_BENCH_SENSOR_ONLY && bench_sensor_ready) {
            /* 串口监视器以该文本判断 QMI、AXP 与 RTC 初始化调用均已返回。 */
            ESP_LOGW(APP_TAG, "SENSOR_ONLY_STABLE_POINT ui=HOME sensors=1 storage=0 model=0 tasks=0");
        } else if (APP_BENCH_DISPLAY_ONLY) {
            /* 保留第一阶段标记，未来切回显示-only 时无需改动日志解析工具。 */
            ESP_LOGW(APP_TAG, "DISPLAY_ONLY_STABLE_POINT ui=HOME sensors=0 storage=0 model=0 tasks=0");
        }
        /* 永久让出 CPU；LVGL 使用 BSP 自建任务运行，本循环不调用休眠或电源管理。 */
        while (true) {
            /* 每秒阻塞等待，既保持 app_main 局部 UI 上下文生命周期，又不产生忙循环。 */
            vTaskDelay(pdMS_TO_TICKS(1000U));
        }
    }
    /* 初始化 NVS；失败阻断绑定和安全配置。 */
    ESP_ERROR_CHECK(app_init_nvs());
    /* 恢复 CRC32 设备配置；缺失或损坏时使用冻结默认值继续安全启动。 */
    app_load_device_config();
    /* 常亮功能联调版只在 RAM 打开开发者门，允许上位机命令 11 实测 RawStream；不写回 NVS。 */
    if (APP_BENCH_ALWAYS_ON) {
        /* true 仅解除 RawStream 安全门，诊断流仍需 PC 显式发送开启命令。 */
        s_device_config.developer_mode = true;
    }
    /* 创建所有队列与锁。 */
    if (!app_create_os_objects()) {
        /* 触发可诊断内存错误复位。 */
        ESP_ERROR_CHECK(ESP_ERR_NO_MEM);
    }
    /* 初始化 NimBLE 到应用任务的配对事件邮箱；此时尚未启动任何生产任务或 BLE。 */
    ui_app_pairing_mailbox_init(&s_pairing_mailbox);
    /* 创建完整特征与双 M0 共用的最高频率锁；参数 0 表示不限定最低持续时间。 */
    ESP_ERROR_CHECK(esp_pm_lock_create(
        ESP_PM_CPU_FREQ_MAX,
        0,
        "dual_m0",
        &s_inference_pm_lock));
    /* 先初始化厂家 BSP 与显示；该步骤失败时物理屏幕本身不可用于故障页。 */
    if (!app_init_board_runtime()) {
        /* 记录不可显示的最早板级错误。 */
        ESP_LOGE(APP_TAG, "board runtime blocked startup before UI");
        /* 返回并删除 app_main 任务。 */
        return;
    }
    /* 显示可用后立即创建中文页面树。 */
    if (!app_init_ui_renderer()) {
        /* 页面树失败时只能依赖串口诊断。 */
        ESP_LOGE(APP_TAG, "UI renderer blocked startup");
        /* 返回。 */
        return;
    }
    /* 保存贯穿 BOOT、SELF_TEST 和可能 ERROR 页的局部启动上下文。 */
    ui_context_t startup_ui;
    /* 显示 BOOT 动画后进入可见 SELF_TEST 页。 */
    if (!app_show_startup_pages(&startup_ui)) {
        /* 启动页面链失败，避免继续进入不可见产品状态。 */
        ESP_LOGE(APP_TAG, "startup pages blocked startup");
        /* 返回。 */
        return;
    }
    /* 在 SELF_TEST 可见期间初始化关键板载传感器。 */
    if (!app_init_external_sensors()) {
        /* 显示稳定传感器故障码。 */
        app_show_startup_error(&startup_ui, APP_STARTUP_FAULT_SENSOR);
        /* 保留 LVGL 任务与 ERROR 页，暂停 app_main 而不是静默返回。 */
        vTaskSuspend(NULL);
        /* 静态分析保护；暂停成功后不会到达。 */
        return;
    }
    /* 在 SELF_TEST 可见期间挂载内部存储并恢复会话。 */
    if (!app_init_session_store()) {
        /* 无安全持久化时显示中文错误页。 */
        ESP_LOGE(APP_TAG, "session storage blocked startup");
        /* 显示稳定存储故障码。 */
        app_show_startup_error(&startup_ui, APP_STARTUP_FAULT_STORAGE);
        /* 保留页面并暂停当前任务。 */
        vTaskSuspend(NULL);
        /* 静态分析保护。 */
        return;
    }
    /* 初始化 coordinator 与双 M0；renderer 已经用于启动页面。 */
    if (!app_init_domains()) {
        /* 领域失败时停止启动并显示稳定错误。 */
        ESP_LOGE(APP_TAG, "domain self-test blocked startup");
        /* 显示领域故障码。 */
        app_show_startup_error(&startup_ui, APP_STARTUP_FAULT_DOMAIN);
        /* 保留页面并暂停当前任务。 */
        vTaskSuspend(NULL);
        /* 静态分析保护。 */
        return;
    }
    /* 全部关键检查通过后完成 SELF_TEST 到 HOME 的合法状态转移。 */
    if (!app_finish_startup_success(&startup_ui)) {
        /* 把状态机异常归入领域故障并保留可见页。 */
        app_show_startup_error(&startup_ui, APP_STARTUP_FAULT_DOMAIN);
        /* 暂停当前任务。 */
        vTaskSuspend(NULL);
        /* 静态分析保护。 */
        return;
    }
    /* 领域和 UI 已处于 Home 后建立空闲基准，避免把启动耗时计入熄屏门槛。 */
    power_idle_timer_init(&s_power_idle_timer, app_now_ms());
    /* 读取启动电量；失败使用未知哨兵。 */
    uint8_t battery_percent = UINT8_MAX;
    /* 保存充电状态。 */
    bool charging = false;
    /* 读取 PMIC。 */
    const board_adapter_result_t battery_status = board_adapter_read_battery(
        board_runtime_adapter(&s_board_runtime),
        &battery_percent,
        &charging);
    /* 读取失败保持 255。 */
    if (battery_status != BOARD_ADAPTER_OK) {
        /* 输出警告。 */
        ESP_LOGW(APP_TAG, "initial battery unknown");
        /* 标记未充电。 */
        charging = false;
    }
    /* BLE 控制器必须在九个业务任务栈之前预留连续片内 RAM，避免大栈先分配造成碎片。 */
    if (!APP_BENCH_DISABLE_BLE) {
        /* 读取当前可用于控制器、任务栈和普通内部对象的片内总空闲字节数。 */
        const size_t ble_internal_free = heap_caps_get_free_size(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        /* 读取最大连续片内块；控制器单次分配不能跨越多个离散空闲区。 */
        const size_t ble_internal_largest = heap_caps_get_largest_free_block(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        /* 串口同时输出总量与连续量，便于区分容量不足和内存碎片。 */
        ESP_LOGI(
            APP_TAG,
            "BLE_HEAP before_start free=%u largest=%u",
            (unsigned int)ble_internal_free,
            (unsigned int)ble_internal_largest);
        /* 启动 BLE 控制器和 NimBLE 主机任务；该调用在主机同步前异步返回。 */
        if (!app_start_ble(battery_percent)) {
            /* 记录离线模式。 */
            ESP_LOGW(APP_TAG, "device continues in offline mode");
        /* 服务启动后等待主机同步和广告活动，禁止九个任务栈抢占主机内存池。 */
        } else if (!app_wait_ble_ready()) {
            /* 停止半启动或不可广播的服务，释放控制器与主机资源。 */
            (void)ble_service_nimble_stop();
            /* 超时后明确进入稳定离线模式，后续任务不会因 BLE 失败反复复位。 */
            ESP_LOGW(APP_TAG, "BLE not ready; device continues in stable offline mode");
        }
    } else {
        /* 明确记录 BLE 未启动是诊断设计，不是 NimBLE 初始化失败。 */
        ESP_LOGW(APP_TAG, "bench isolation: BLE startup skipped");
    }
    /* BLE 控制器完成片内保留后再创建九个业务任务，防止任务栈切碎控制器连续块。 */
    if (!app_create_tasks()) {
        /* 任务创建失败不可降级运行；此时串口已保留 BLE 启动前内存证据。 */
        ESP_ERROR_CHECK(ESP_ERR_NO_MEM);
    }
    /* 渲染初始 Home。 */
    app_queue_ui(&s_coordinator.ui);
    /* 隔离版保持 BSP 已建立的 35% 常亮状态；普通版本才允许初始策略切换全部外设。 */
    if (!APP_BENCH_SKIP_INITIAL_POWER_POLICY) {
        /* 应用初始 Home 功耗策略。 */
        const power_policy_t initial_policy = power_manager_policy(&s_coordinator.power);
        /* 投递策略。 */
        app_queue_power(&initial_policy, false);
        /* PMIC 可信时立即送入 15/8/5% 规则。 */
        if (battery_percent <= 100U) {
            /* 构造电池事件。 */
            app_event_t battery_event;
            /* 清零。 */
            (void)memset(&battery_event, 0, sizeof(battery_event));
            /* 标记电池。 */
            battery_event.kind = APP_EVENT_BATTERY;
            /* 捕获时间。 */
            battery_event.monotonic_ms = app_now_ms();
            /* 写百分比。 */
            battery_event.data.battery.percent = battery_percent;
            /* 写充电状态。 */
            battery_event.data.battery.charging = charging;
            /* 确保启动门槛送达。 */
            (void)xQueueSend(s_app_event_queue, &battery_event, portMAX_DELAY);
        }
    } else {
        /* 诊断期间不让后台电源任务重新发送 Display/QMI/BLE 命令。 */
        ESP_LOGW(APP_TAG, "bench isolation: initial power and battery policies skipped");
    }
    /* 输出软件预算；不是实机功耗结果。 */
    ESP_LOGI(
        APP_TAG,
        "ready reset_reason=%d battery=400mAh active_budget=%.2fmA standby_budget=%.3fmA features=297",
        (int)reset_reason,
        (double)power_budget_max_average_current_ma(POWER_ACTIVE_RUNTIME_TARGET_HOURS),
        (double)power_budget_max_average_current_ma(POWER_DEEP_STANDBY_TARGET_HOURS));
    /* app_main 初始化完成，删除自身；长期工作由九个任务承担。 */
    vTaskDelete(NULL);
}
